org/计算机网络原理笔记.org
#+SETUPFILE: ../theme-rose.setup
#+DATE: <2020-07-16 四>
#+TITLE: 计算机网络原理笔记
#+begin_quote
此文章转自 [[https://blog.csdn.net/x910131/article/details/106795996?utm_medium=distribute.pc_aggpage_search_result.none-task-blog-2~all~first_rank_v2~rank_v25-15-106795996.nonecase][CSDN NorthStar131]]
#+end_quote
* 第一章 计算机网络概述
** 计算机网络基本概念(填空选择题)
 1>计算机网络定义
  *1.定义:
    1)计算机网络是 互连的、自治的 计算机的集合;
      互连: 是指利用通信链路链接相互独立的计算机系统;
      自治: 是指互连的计算机系统 彼此独立 ,不存在主从或控制与被控制的关系;

    2)一个计算机网络是由资源子网和通信子网构成的,
      资源子网负责信息的处理,通信子网负责全网中的信息传递;

  *2.起源:从技术范畴来看,计算机网络是 计算机技术 与 通信技术 相融合的产物;

  *3.互联网与因特网(了解)
     #1.互连网(internet):泛指由多个计算机网络互连而成的网络;
     #2.因特网(Internet):指当前全球最大的、应用最广泛的计算机网络;

  *4.因特网服务提供商(Internet Service Provider, ISP)

 2>网络协议的定义(填空题)
  *1.网络协议:网络通信实体之间在 数据交换 过程中需要遵循的规则或约定(例如:HTTP,FTP等);
  *2.协议的三要素(填空题)
    #1.语法: 定义实体之间交换信息的 格式与结构;
    #2.语义: 定义实体之间交换信息中的 控制信息;
    #3.时序(同步):定义实体之间交换信息的 顺序 及如何匹配或适应彼此的 速度;

 3>计算机网络功能(选择)(软硬件信息资源共享)
  *0.是指在不同主机之间实现快速的信息交换,通过信息交换,计算机网络可实现 资源共享 这一核心功能;
  *1.硬件 资源共享: 计算资源(CPU)、存储资源、打印机与扫描仪I/O等共享; 例如云存储,云计算;
  *2.软件 资源共享: SaaS(Software as a Service,软件即服务) 例如:大型办公软件、大型数据库系统等;
  *3.信息 资源共享: 信息检索,新闻浏览等, 典型为 计算机网络所支持的信息交换;

 4>计算机网络的分类
  *1.按覆盖范围分类(选择题)
     #1.个域网(PAN,Personal Area Network):随身穿戴或便携设备,通过无线技术构成的小范围网络; 1~10m
     #2.局域网(LAN,Local Area Network):通常部署在办公室,办公楼,厂区,校区等; 10m~1Km
     #3.城域网(MAN,Metropolitan Area Network):覆盖一个城市范围的网络; 5~50Km
     #4.广域网(WAN,Wide Area Network):覆盖范围在几十到几千千米,可实现异地城域网的互连;

  *2.按拓扑结构分类(选择题)
    1)按拓扑结构的形状分类
    #0.拓扑(topology)
       是研究几何图形或空间在连续改变形状后还能保持不变的一些性质的一个学科;
       它只考虑 物体间的位置关系 而不考虑它们的形状和大小;(星型,总线,环形,网状,树形,混合)

    #1.星形拓扑结构(个域网(PAN)或局域网(LAN))
       包括一个中央结点,网络中的主机通过点对点通信
       链路与中央结点连接;                        ●
       优点:易于监控管理,故障诊断,隔离;         ●- ● -●
       缺点:中央结点一旦故障,全网瘫痪;           ●   ●
       受限制与中央结点的端口数量;

    #2.总线型拓扑结构(早期局域网(LAN))
       网络采用一条广播信道作为公共传输介质,所有结点均与总线连接,
       结点间的通信均通过共享的总线进行;                   ●   ●   ●
       优点:结构简单,电缆数量少,易于扩展.                  ┴-┬-┴-┬-┴
       缺点:通信范围受限,故障诊断与隔离困难,容易产生冲突;      ●   ●

    #3.环形拓扑结构(早期局域网(LAN),城域网(MAN))                    ●--●
       利用通信链路将所有结点连接成一个闭合的环;                    /    \
       优点:电缆长度短,可以使用光纤,易于避免冲突;                  ●      ●
       缺点:某结点故障引起全网瘫痪,加新(撤出)结点麻烦,等待时间较长;  \     /
                                                                  ●--●

    #4.网状拓扑结构(广域网(WAN)和核心网络)                      ●--●
       网络中的结点通过多条链路与不同的结点直接相连接;           /\  /\
       优点:网络可靠性高,一条或多条链路故障时,网络仍然可以联通;  ●--╳--●
       缺点:网络结构复杂,成本高;                               \/  \/
                                                              ●--●
    #5.树形拓扑结构(目前局域网LAN)                    ●
       可以看作是总线型拓扑或星型拓扑结构网络的扩展;   / \
       优点:易于扩展,故障易隔离;                    ●   ●
       缺点:根结点要求高;                          /\  /\
                                                 ● ● ● ●
                                                                ● ● ●
                                                                 ╲│╱
    #6.混合型拓扑结构(绝大多数实际网络)                         ●    ○    ●
       由两种以上简单拓扑结构网络混合连接而成的网络;               ╲ ╱  ╲ ╱
       优点:易于扩散,可以构建不同规模的网络,根据需要优选网络结构; ●──○────○──●
       缺点:结构复杂,管理与维护复杂;                             ╱      ╲
                                                              ●       ●

    2)按拓扑结构传输模式分类
     #1.点对点模式: 星形拓扑结构、网状形拓扑结构、树形拓扑结构;
     #2.点与总线相连模式: 总线形拓扑结构;

    3)按采用信道的拓扑结构分类
     #1.采用广播信道的拓扑结构
        总线型拓扑结构;
        树形拓扑结构;
        环形拓扑结构;
        无限通信与卫星通信型;

     #2.直接链路连接: 网状形拓扑结构;

  *3.按交换方式分类
    #1.电路交换网络;
    #2.报文交换网络;
    #3.分组交换网络;

  *4.按网络用户属性
    #1.公用网:是指由国家或企业出资建立,面向公众提供收费或免费服务的网络(电信网络);
    #2.私有网:某个组织(政府或企业)出资建设,专门面向该组织内部提供网络传输服务,不向公众开放;(银行,军事,铁路)

** 计算机网络结构
  *大规模现代计算机网络的结构包括 网络边缘,接入网络 与 网络核心 三部分;

 1>网络边缘(上网使用的设备)
   连接到网络上的计算机、服务器、智能手机、智能传感器、智能家电等称为
   主机 或 端系统, 连接到网上的所有端系统构成了 网络边缘;

 2>接入网络(上网的途径)
  *0.是指实现网络边缘的端系统与网络核心连接与连入的网络;

  *1.电话拨号接入:利用电话网络接入;

  *2.非对称数字用户线路ADSL(Asymmetrical Digital Subscriber Line):
     #1.利用电话网络接入;#2.基于频分多路复用技术;#3.非对称(上行小,下行大);#4.独享式接入;

  *3.混合光纤共轴电缆HFC接入网络:
     #1.利用有线电视网络接入;#2.基于频分多路复用技术;#3.非对称(上行小,下行大);#4.共享式接入;

  *4.局域网:典型的局域网技术是以太网,WIFI等;

  *5.移动接入网络:利用移动通信网络,如3G/4G/5G网络,实现智能手机,移动终端等设备的网络接入;

 3>网络核心(网络实现数据转发方式)
    是由通信链路互连的 分组交换设备(路由器和交换机) 构成的网络,
    作用:通过 数据交换 来实现网络边缘中主机之间的 中继 与 转发;

** 数据交换技术
  0>数据交换的概念
  *1.交换设备: 具有多通信端口,可同时连接多个通信结点;(交换设备互连构成网络核心)
  *2.数据交换: 是实现在大规模网络核心上进行数据传输的 技术基础;
  *3.常见的数据交换技术包括: 电路交换,报文交换,分组交换;

 1>电路交换
  *1.电路交换是 最早 出现的一种交换方式, 电话网络 是最早、最大的电路交换网络;
  *2.电路交换进行通信步骤(3个阶段): 建立电路->传输数据->拆除电路;
  *3.优点: 实时性高,时延和时延抖动小;
  *4.缺点: 不适用于猝发式通信,信道利用率低,且传输率单一;
  *5.用途:适用于语音和视频这类实时性强的业务;
  *6.特点:电路交换是有连接的,在通信时需要先建立电路连接,
         在通信过程中独占一个信道,通信结束后拆除电路连接;

 2>报文交换(消息交换)
  *1.报文: 发送方把要发送的信息(数据) 附加上 接收主机的地址和控制信息(首部);
  *2.报文交换:发送方组装好报文,发给相邻报文交换机
      示意图如下:

        源 -----交换设备-----交换设备-----目的
       报文   存储转发\        /
     首部|数据         交换设备

  *3.交换结点的这种 接收-暂存-转发 的工作方式,称为 存储-转发 的交换方式;
  *4.优点: 信道利用率高; 适用于电报通信;
  *5.缺点: 网络的延迟时间变长; 有时还需要丢弃报文;
  *6.特点:
     报文交换机必须接受一个完整的报文后,才能把报文转发到某个输出线路中;
     1)报文交换可以把一个报文发送到多个目的地,而电路交换网络很难做到这点;
     2)报文交换网络中交换结点需要缓冲存储,报文需要排队,因此会导致报文经过
~       网络的延迟时间变长且不固定(数据块长度不限且可变);

 3>分组交换
  *1.分组交换(包交换):是目前计算机网络 广泛采用 的交换技术;

  *2.分组交换需将待传输的数据(即报文)分割成较小的独立的数据块,(首部/数据)
     每个数据块附加地址、序号 等控制信息构成数据分组,每个分组独立传输到目的地,
     到目的地将收到的分组重新组装,还原为报文, 采用 存储-转发 交换方式;

  *3.示意图:
        源  ----交换设备-----交换设备-----目的
       分组   存储转发\        /
      ▌▌▌▌▌▌▌         交换设备

  *4.优点:
    #1.交换设备存储容量要求低;    报文交换设备:          分组交换设备:
    #2.交换速度快;                  1400MB                1400MB
    #3.可靠传输效率高;(丢包少)      首部|数据        首部|数据    首部|数据
    #4.更加公平;(效率高)       报文1:1500MB(丢弃)  分组1:100MB  分组2:100MB

  *5.缺点: 有效传输效率降低(每组都附加地址)

  *6.分组长度的确定:
     在其他条件相同的情况下,分组长度越长,延迟时间越长;
     (每组长度越长,在交换设备中存储停留的时间越长)(16B-4096B)

  *7.ARPAnet是第一个分组交换的计算机网络，也是当今因特网的祖先。(*****)

  *8.因特网的标准都有一个(Request For Comments,RFC)编号,
     如著名的IP协议和TCP协议最早分别为RFC791 和 RFC793;

