public/计算机网络原理笔记.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-02-21 Sun 15:27 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>计算机网络原理笔记</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Evan Meek">
<link rel="shortcut icon" href="/images/rose-red.png" type="image/x-icon" />
<link rel="stylesheet" href="/css/animate.min.css" />
<link rel="stylesheet" href="/css/all.min.css" />
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">计算机网络原理笔记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgcaad637">第一章 计算机网络概述</a>
<ul>
<li><a href="#org189465c">计算机网络基本概念(填空选择题)</a></li>
<li><a href="#org877d150">计算机网络结构</a></li>
<li><a href="#org8f6a957">数据交换技术</a></li>
<li><a href="#orge6df541">计算机网络性能</a></li>
<li><a href="#orgadb530c">计算机网络体系结构</a></li>
</ul>
</li>
<li><a href="#org56b3848">第二章 应用层</a>
<ul>
<li><a href="#org1bdc63e">计算机网络应用体系结构(3种)</a></li>
<li><a href="#org0dbe437">网络应用通信基本原理</a></li>
<li><a href="#org4e180a4">域名系统(DNS,Domain Naming System)</a></li>
<li><a href="#org539ce65">万维网应用</a></li>
<li><a href="#org0243eb4">Internet电子邮件</a></li>
<li><a href="#orgd7ca04f">FTP 文件传输协议(File Transfer Protocol,FTP)</a></li>
</ul>
</li>
<li><a href="#orgec8a383">第三章 传输层</a>
<ul>
<li><a href="#org7e9a7f8">传输层的基本服务</a></li>
<li><a href="#orga6584e5">传输层的复用与分解(用)</a></li>
<li><a href="#orgb6e9103">停等协议与滑动窗口协议</a></li>
<li><a href="#org29f52e4">UDP(用户数据报协议 User Datagram Protocol)</a></li>
<li><a href="#org3678a43">TCP(传输控制协议 Transfer Control Protocol)</a></li>
<li><a href="#orgf98cd96">TCP流量控制(选择,填空)</a></li>
<li><a href="#org7e34e11">TCP拥塞控制(综合题)</a></li>
</ul>
</li>
<li><a href="#org23a7128">第四章 网络层</a>
<ul>
<li><a href="#orgeafabd3">网络层服务</a></li>
<li><a href="#orgdd01856">数据报网络与虚电路网络</a></li>
<li><a href="#org24257a3">网络互连与网络互连设备</a></li>
<li><a href="#org9cbef3e">网络层拥塞控制</a></li>
<li><a href="#orgaf3a27b">Internet网络层</a></li>
<li><a href="#orgdfc8f82">路由算法与路由协议</a></li>
</ul>
</li>
<li><a href="#orgb8ed8d0">第五章 数据链路层与局域网</a>
<ul>
<li><a href="#org286e299">数据链路层服务</a></li>
<li><a href="#org218dadf">差错控制</a></li>
<li><a href="#org706de45">多路访问控制协议</a></li>
<li><a href="#orga4424eb">局域网(LAN)</a></li>
<li><a href="#orgd7d8b95">点对点链路协议</a></li>
</ul>
</li>
<li><a href="#orgc60fd72">第六章 物理层</a>
<ul>
<li><a href="#orge3ea4e5">数据通信基础</a></li>
<li><a href="#org7dfc3af">物理介质</a></li>
<li><a href="#org03a8b4f">信道与信道容量</a></li>
<li><a href="#orgd663cb4">基带传输</a></li>
<li><a href="#org690bf1e">频带传输</a></li>
<li><a href="#orgcee1a03">物理层接口规程</a></li>
</ul>
</li>
<li><a href="#org98bff00">第七章 无线与移动网络</a>
<ul>
<li><a href="#org2cba24e">无线网络</a></li>
<li><a href="#orgda492a5">移动网络</a></li>
<li><a href="#orgacc1e35">无线局域网 IEEE 802.11</a></li>
<li><a href="#org97966a2">蜂窝网络</a></li>
<li><a href="#org1cb32f1">移动IP网络</a></li>
<li><a href="#org52d29e7">其他典型无线网络简介(WiMax 蓝牙 ZigBee)</a></li>
</ul>
</li>
<li><a href="#orgee40c3e">第八章 网络安全</a>
<ul>
<li><a href="#org0b8a34a">网络安全概述</a></li>
<li><a href="#orgac21b06">数据加密</a></li>
<li><a href="#org1fa5ff1">消息完整性与数字签名</a></li>
<li><a href="#org1cd4886">身份认证</a></li>
<li><a href="#org3fc51b0">密钥分发中心与证书认证</a></li>
<li><a href="#orgc5f4478">防火墙与入侵检测系统</a></li>
<li><a href="#orgab24739">网络安全协议</a></li>
</ul>
</li>
</ul>
</div>
</div>
<blockquote>
<p>
此文章转自 <a href="https://blog.csdn.net/x910131/article/details/106795996?utm_medium=distribute.pc_aggpage_search_result.none-task-blog-2~all~first_rank_v2~rank_v25-15-106795996.nonecase">CSDN NorthStar131</a>
</p>
</blockquote>
<div id="outline-container-orgcaad637" class="outline-2">
<h2 id="orgcaad637">第一章 计算机网络概述</h2>
<div class="outline-text-2" id="text-orgcaad637">
</div>
<div id="outline-container-org189465c" class="outline-3">
<h3 id="org189465c">计算机网络基本概念(填空选择题)</h3>
<div class="outline-text-3" id="text-org189465c">
<p>
1&gt;计算机网络定义
 *1.定义:
   1)计算机网络是 互连的、自治的 计算机的集合;
     互连: 是指利用通信链路链接相互独立的计算机系统;
     自治: 是指互连的计算机系统 彼此独立 ,不存在主从或控制与被控制的关系;
</p>

<p>
2)一个计算机网络是由资源子网和通信子网构成的,
  资源子网负责信息的处理,通信子网负责全网中的信息传递;
</p>

<p>
*2.起源:从技术范畴来看,计算机网络是 计算机技术 与 通信技术 相融合的产物;
</p>

<p>
*3.互联网与因特网(了解)
   #1.互连网(internet):泛指由多个计算机网络互连而成的网络;
   #2.因特网(Internet):指当前全球最大的、应用最广泛的计算机网络;
</p>

<p>
*4.因特网服务提供商(Internet Service Provider, ISP)
</p>

<p>
2&gt;网络协议的定义(填空题)
 *1.网络协议:网络通信实体之间在 数据交换 过程中需要遵循的规则或约定(例如:HTTP,FTP等);
 *2.协议的三要素(填空题)
   #1.语法: 定义实体之间交换信息的 格式与结构;
   #2.语义: 定义实体之间交换信息中的 控制信息;
   #3.时序(同步):定义实体之间交换信息的 顺序 及如何匹配或适应彼此的 速度;
</p>

<p>
3&gt;计算机网络功能(选择)(软硬件信息资源共享)
 *0.是指在不同主机之间实现快速的信息交换,通过信息交换,计算机网络可实现 资源共享 这一核心功能;
 *1.硬件 资源共享: 计算资源(CPU)、存储资源、打印机与扫描仪I/O等共享; 例如云存储,云计算;
 *2.软件 资源共享: SaaS(Software as a Service,软件即服务) 例如:大型办公软件、大型数据库系统等;
 *3.信息 资源共享: 信息检索,新闻浏览等, 典型为 计算机网络所支持的信息交换;
</p>

<p>
4&gt;计算机网络的分类
 *1.按覆盖范围分类(选择题)
    #1.个域网(PAN,Personal Area Network):随身穿戴或便携设备,通过无线技术构成的小范围网络; 1~10m
    #2.局域网(LAN,Local Area Network):通常部署在办公室,办公楼,厂区,校区等; 10m~1Km
    #3.城域网(MAN,Metropolitan Area Network):覆盖一个城市范围的网络; 5~50Km
    #4.广域网(WAN,Wide Area Network):覆盖范围在几十到几千千米,可实现异地城域网的互连;
</p>

<p>
*2.按拓扑结构分类(选择题)
  1)按拓扑结构的形状分类
  #0.拓扑(topology)
     是研究几何图形或空间在连续改变形状后还能保持不变的一些性质的一个学科;
     它只考虑 物体间的位置关系 而不考虑它们的形状和大小;(星型,总线,环形,网状,树形,混合)
</p>

<p>
#1.星形拓扑结构(个域网(PAN)或局域网(LAN))
   包括一个中央结点,网络中的主机通过点对点通信
   链路与中央结点连接;                        ●
   优点:易于监控管理,故障诊断,隔离;         ●- ● -●
   缺点:中央结点一旦故障,全网瘫痪;           ●   ●
   受限制与中央结点的端口数量;
</p>

<p>
#2.总线型拓扑结构(早期局域网(LAN))
   网络采用一条广播信道作为公共传输介质,所有结点均与总线连接,
   结点间的通信均通过共享的总线进行;                   ●   ●   ●
   优点:结构简单,电缆数量少,易于扩展.                  ┴-┬-┴-┬-┴
   缺点:通信范围受限,故障诊断与隔离困难,容易产生冲突;      ●   ●
</p>

<p>
#3.环形拓扑结构(早期局域网(LAN),城域网(MAN))                    ●&#x2013;●
   利用通信链路将所有结点连接成一个闭合的环;                    /    \
   优点:电缆长度短,可以使用光纤,易于避免冲突;                  ●      ●
   缺点:某结点故障引起全网瘫痪,加新(撤出)结点麻烦,等待时间较长;  \     /
                                                              ●&#x2013;●
</p>

<p>
#4.网状拓扑结构(广域网(WAN)和核心网络)                      ●&#x2013;●
   网络中的结点通过多条链路与不同的结点直接相连接;           /\  /\
   优点:网络可靠性高,一条或多条链路故障时,网络仍然可以联通;  ●&#x2013;╳&#x2013;●
   缺点:网络结构复杂,成本高;                               \/  \/
                                                          ●&#x2013;●
#5.树形拓扑结构(目前局域网LAN)                    ●
   可以看作是总线型拓扑或星型拓扑结构网络的扩展;   / \
   优点:易于扩展,故障易隔离;                    ●   ●
   缺点:根结点要求高;                          /\  /\
                                             ● ● ● ●
                                                            ● ● ●
                                                             ╲│╱
#6.混合型拓扑结构(绝大多数实际网络)                         ●    ○    ●
   由两种以上简单拓扑结构网络混合连接而成的网络;               ╲ ╱  ╲ ╱
   优点:易于扩散,可以构建不同规模的网络,根据需要优选网络结构; ●──○────○──●
   缺点:结构复杂,管理与维护复杂;                             ╱      ╲
                                                          ●       ●
</p>

<p>
2)按拓扑结构传输模式分类
 #1.点对点模式: 星形拓扑结构、网状形拓扑结构、树形拓扑结构;
 #2.点与总线相连模式: 总线形拓扑结构;
</p>

<p>
3)按采用信道的拓扑结构分类
 #1.采用广播信道的拓扑结构
    总线型拓扑结构;
    树形拓扑结构;
    环形拓扑结构;
    无限通信与卫星通信型;
</p>

<p>
#2.直接链路连接: 网状形拓扑结构;
</p>

<p>
*3.按交换方式分类
  #1.电路交换网络;
  #2.报文交换网络;
  #3.分组交换网络;
</p>

<p>
*4.按网络用户属性
  #1.公用网:是指由国家或企业出资建立,面向公众提供收费或免费服务的网络(电信网络);
  #2.私有网:某个组织(政府或企业)出资建设,专门面向该组织内部提供网络传输服务,不向公众开放;(银行,军事,铁路)
</p>
</div>
</div>

<div id="outline-container-org877d150" class="outline-3">
<h3 id="org877d150">计算机网络结构</h3>
<div class="outline-text-3" id="text-org877d150">
<p>
*大规模现代计算机网络的结构包括 网络边缘,接入网络 与 网络核心 三部分;
</p>

<p>
1&gt;网络边缘(上网使用的设备)
  连接到网络上的计算机、服务器、智能手机、智能传感器、智能家电等称为
  主机 或 端系统, 连接到网上的所有端系统构成了 网络边缘;
</p>

<p>
2&gt;接入网络(上网的途径)
 *0.是指实现网络边缘的端系统与网络核心连接与连入的网络;
</p>

<p>
*1.电话拨号接入:利用电话网络接入;
</p>

<p>
*2.非对称数字用户线路ADSL(Asymmetrical Digital Subscriber Line):
   #1.利用电话网络接入;#2.基于频分多路复用技术;#3.非对称(上行小,下行大);#4.独享式接入;
</p>

<p>
*3.混合光纤共轴电缆HFC接入网络:
   #1.利用有线电视网络接入;#2.基于频分多路复用技术;#3.非对称(上行小,下行大);#4.共享式接入;
</p>

<p>
*4.局域网:典型的局域网技术是以太网,WIFI等;
</p>

<p>
*5.移动接入网络:利用移动通信网络,如3G/4G/5G网络,实现智能手机,移动终端等设备的网络接入;
</p>

<p>
3&gt;网络核心(网络实现数据转发方式)
   是由通信链路互连的 分组交换设备(路由器和交换机) 构成的网络,
   作用:通过 数据交换 来实现网络边缘中主机之间的 中继 与 转发;
</p>
</div>
</div>

<div id="outline-container-org8f6a957" class="outline-3">
<h3 id="org8f6a957">数据交换技术</h3>
<div class="outline-text-3" id="text-org8f6a957">
<p>
0&gt;数据交换的概念
*1.交换设备: 具有多通信端口,可同时连接多个通信结点;(交换设备互连构成网络核心)
*2.数据交换: 是实现在大规模网络核心上进行数据传输的 技术基础;
*3.常见的数据交换技术包括: 电路交换,报文交换,分组交换;
</p>

<p>
1&gt;电路交换
 *1.电路交换是 最早 出现的一种交换方式, 电话网络 是最早、最大的电路交换网络;
 *2.电路交换进行通信步骤(3个阶段): 建立电路-&gt;传输数据-&gt;拆除电路;
 *3.优点: 实时性高,时延和时延抖动小;
 *4.缺点: 不适用于猝发式通信,信道利用率低,且传输率单一;
 *5.用途:适用于语音和视频这类实时性强的业务;
 *6.特点:电路交换是有连接的,在通信时需要先建立电路连接,
        在通信过程中独占一个信道,通信结束后拆除电路连接;
</p>

<p>
2&gt;报文交换(消息交换)
 *1.报文: 发送方把要发送的信息(数据) 附加上 接收主机的地址和控制信息(首部);
 *2.报文交换:发送方组装好报文,发给相邻报文交换机
     示意图如下:
</p>

<p>
   源 &#x2013;&#x2014;交换设备&#x2013;&#x2014;交换设备&#x2013;&#x2014;目的
  报文   存储转发\        /
首部|数据         交换设备
</p>

<p>
  *3.交换结点的这种 接收-暂存-转发 的工作方式,称为 存储-转发 的交换方式;
  *4.优点: 信道利用率高; 适用于电报通信;
  *5.缺点: 网络的延迟时间变长; 有时还需要丢弃报文;
  *6.特点:
     报文交换机必须接受一个完整的报文后,才能把报文转发到某个输出线路中;
     1)报文交换可以把一个报文发送到多个目的地,而电路交换网络很难做到这点;
     2)报文交换网络中交换结点需要缓冲存储,报文需要排队,因此会导致报文经过
~       网络的延迟时间变长且不固定(数据块长度不限且可变);
</p>

<p>
3&gt;分组交换
 *1.分组交换(包交换):是目前计算机网络 广泛采用 的交换技术;
</p>

<p>
*2.分组交换需将待传输的数据(即报文)分割成较小的独立的数据块,(首部/数据)
   每个数据块附加地址、序号 等控制信息构成数据分组,每个分组独立传输到目的地,
   到目的地将收到的分组重新组装,还原为报文, 采用 存储-转发 交换方式;
</p>

<p>
*3.示意图:
      源  -&#x2014;交换设备&#x2013;&#x2014;交换设备&#x2013;&#x2014;目的
     分组   存储转发\        /
    ▌▌▌▌▌▌▌         交换设备
</p>

<p>
*4.优点:
  #1.交换设备存储容量要求低;    报文交换设备:          分组交换设备:
  #2.交换速度快;                  1400MB                1400MB
  #3.可靠传输效率高;(丢包少)      首部|数据        首部|数据    首部|数据
  #4.更加公平;(效率高)       报文1:1500MB(丢弃)  分组1:100MB  分组2:100MB
</p>

<p>
*5.缺点: 有效传输效率降低(每组都附加地址)
</p>

<p>
*6.分组长度的确定:
   在其他条件相同的情况下,分组长度越长,延迟时间越长;
   (每组长度越长,在交换设备中存储停留的时间越长)(16B-4096B)
</p>

<p>
<b>7.ARPAnet是第一个分组交换的计算机网络，也是当今因特网的祖先。(<b>**</b></b>)
</p>

<p>
*8.因特网的标准都有一个(Request For Comments,RFC)编号,
   如著名的IP协议和TCP协议最早分别为RFC791 和 RFC793;
</p>
</div>
</div>
