org/计算机网络原理笔记.org
** 计算机网络性能
 1>速率与带宽
   *1.速率:是指网络 单位时间内 传送的 数据量,用以描述网络传输数据的 快慢;
      也称为数据传输速率 或 数据速率(date rate), 单位: bit/s (位每秒)

   *2.速率单位转换:
      1Kbit/s=1000bit/s=10³bit/s         1Byte(字节)=8bit(位);
      1Mbit/s=1000000bit/s=10^6bit/s     1bit=0/1
      1Gbit/s=10^9bit/s                  速率的基本单位:bit/s(位每秒)
      1Tbit/s=10^12bit/s

   *3.带宽
      在通信和信号处理领域,指的是信号的频带宽度(最高和最低频率之差),单位Hz(赫兹);
      在计算机网络中,指的是:一条链路或信道的最高数据速率,单位:bit/s(位每秒)

 2>时延
  *1.时延
      时延:也称延迟,指数据从网络中的一个结点(主机或交换设备)到达另一结点所需要的时间;
      跳:在计算机网络中,通常将连接两个结点的直接链路称为有"一个跳步",简称 "一跳";
         分组
        ↙
        ▌    第一跳     ▌     第二跳    ▌    第三跳  ▌
       源主机-------分组交换机1-----分组交换机2-----目的

                    图1:一个简单的分组交换网络

  *2.分组每跳 传输过程中主要产生 4类 时间延时:

      -----------交换设备1--------------------交换设备2----------
                A    B  c \  d: 传播时延:dp  /
               \ / \  /   ↘
    结点处理时延dc 排队时延dq 传输时延(发送时延)dt

                    图2:传输过程中产生的4类时延

  *3.时延分类
    总时延dh=结点处理时延dc+排队时延dq+发送时延dt+传播时延dp;
    1)结点处理时延,记为dc
    2)排队时延,记为dq
    3)传输时延(发送时延),记为dt:
      /**
       * L:分组长度,单位bit;
       * R:链路带宽(即速率),单位:bit/s
       * 传输时延=分组长度/链路带宽
       * 从发送第一位到发送完最后一位所用时间
       */
       dt=L/R; bit/bit/s= bit•s/bit=s;

    4)传播时延,记为dp,
      /**
       * D:物理链路长度,单位:m
       * V:信号传播速度,单位:m/s
       * 传播时延=物理链路长度/信号传播速度
       * 光速=3×10^8m/s
       */
       dp=D/V; m/m/s= m•s/m=s;

 3>时延带宽积
    时延带宽积:是物理链路的传播时延 与 链路带宽 的乘积,记为G;
    公式:G=传播时延×链路带宽=dp•R=s•bit/s=bit;//时延带宽积的单位:bit
    时延带宽积物理意义: 一段链路可以容纳的数据位数, 也称为 以位为单位的链路长度;
    示例:
    设信号传播速度 V=2500km/s, 链路长度 D=500m,链路带宽 R=10Mbit/s,
    求该段链路的时延带宽积;
    V=2500000m/s  D=500m, R(带宽)=10000000bit/s
    G=D/V•R =  (500/2500000)•10000000=2000 bit
    G=D/V•R =(5×10^2)/(25×10^5)=1/(5×10^3)×10^7=2×10^3 bit

    例题2:
    设主机A和主机B由一条带宽为R=10^8bit/s、长度为D=100m的链路互连，
    信号传播速率为V=250000km/s。如果主机A从t=0时刻开始向主机B发送
    长度为 L=1024bit的分组。
    1)求主机A和主机B间的链路传输时延dt;
      dt=L/R=1024/10^8=1.024×10^-5s;

    2)求主机A发送该分组的传播时延dp;
      dp=D/V=100/250000000=4×10^-7s;

    3)求该分组从主机A到主机B的延迟T。(忽略结点处理时延和排队时延)
      T=dt+dp=1.024×10-5s+4×10-7s=1.064×10-5s;

    4)求主机A与主机B间链路的时延带宽积G
      G=dp×R=4×10^-7 × 0^8=40bit;


 4>丢包率(选择,填空)
   作用:丢包率常被用于评价和衡量网络性能,在很大程度上反映 网络拥塞程度;
    /**
     * N1:丢失分组总数
     * Ns:发送分组总数
     * Nr:接收分组总数
     */
     η=N1/Ns=Ns-Nr/Ns

  5>吞吐量(Thr Throught)
    是指在 单位时间内 源主机通过网络向目的主机 实际送达 的数据量,
    记为Thr,单位:bit/s 或 B/s(字节每秒) : 1B=8bit
    受网络链路带宽, 网络连接复杂性, 网络协议, 网络拥塞程度 影响
    S  R1     R2    Ri   RN-1   RN
    ▋-----●------●- - -●-----●-----▉   Thr=min(R1,R2,R3)

  +-------------+---------+--------------------------------------------+
  |  速率、带宽  |  bit/s  |   网络 单位时间内 传送的 数据量, 1bit=0/1    |
  +-------------+---------+--------------------------------------------+
  |     时延    |    s    | 结点处理时延dc+排队时延dq+发送时延dt+传播时延dp|
  +-------------+---------+--------------------------------------------+
  |  时延带宽积  |   bit   |    G=传播时延dp×链路带宽R =s•bit/s=bit;     |
  +-------------+---------+--------------------------------------------+
  |    丢包率    |   %     |η=N1(丢包总数)/NS(发送总数)=Ns-Nr(接收总数)/Ns|
  +-------------+---------+--------------------------------------------+
  |    吞吐量    |bit/s,B/s| Thr（最大吞吐量）=min(R1，R2，Ri，R(N-1)，RN)|
  +-------------+---------+--------------------------------------------+

  例题:
  设主机A和主机B由一条宽带为R=10^8bit/s,长度为D=100m的链路互连,信号传播率
  为V=250000Km/s如果主机A从t=0时开始向主机B发送长度为L=1024bit的分组,试求:
 1>主机A和主机B间的链路传输延时dt;
    dt=L/R=1024/10^8=1.204×10^-5 s
 2>主机A发送该分组的传播延迟dp;
    dp=D/V=100/(25×10^7)=4×10^-7 s
 3>该分组从主机A到主机B的延时T;
    1.204×10^-5+4×10^-7=(1.024+0.04)×10^-5=1.064×10^-5
 4>t=dt时,分组的第一位在何处;
    分组的第一位已经到达主机B,因为dt>dp 0.124>0.04;
  5>主机A与主机B间链路时延带宽积G;
    G=dp×R=4×10^-7×10^8=40bit;

  例2:
  如图所示的网络中,A在 t=0 时刻开始向C发送一个 4Mbit 的文件;
  B在t=(0.1+e)s(e无限趋近0的小正实数)时刻向D发送一个2Mbit文件;
  忽略传播延迟和结点处理延迟(注:M=10^6);如果采用报文交换方式,
  则A将文件交付给C需要大约多长时间? B将文件交付给D需要大约多长时间;
  //延迟时间=dt(L/R)+dp(D/V)
  dt(AC)=4Mbit/20Mbps=0.2s; dp(AC)=

    20Mbps▊→                20Mbps▊→
  A----------┐    40Mbps   ┌----------C
             ¤-------------¤
  B----------┘             └----------D
    20Mbps▊→                20Mbps▊→

