public/计算机网络原理笔记.html

<div id="outline-container-orgadb530c" class="outline-3">
<h3 id="orgadb530c">计算机网络体系结构</h3>
<div class="outline-text-3" id="text-orgadb530c">
<p>
1&gt;计算机网络体系结构定义
   计算机网络所划分的 层次 以及 各层协议 的集合就称为计算机 网络体系结构;
</p>

<p>
2&gt;OSI参考模型(七层)
  开发系统互连(Open System Interconnection, OSI)参考模型: 国际标准化组织;
  采用分层结构化技术,采用三级抽象,即体系结构,服务定义,协议规格说明,将整个通信
  功能分为7层,数据 由上到下 层层封装;
  (发送端)
  应用层 :为用户提供一个使用网络应用的 "接口"; HTTP/HTTPS  FTP  SMTP
    ↕       (通信软件)
  表示层 :用于处理应用实体间交换数据的语法,解决格式和数据表示的差别,不独立存在;
    ↕       (翻译)        文本压/解压缩,数据加/解密,字符编码的转换;
  会话层 :通过两台计算机建立、管理、终止通信来完成会话,不独立存在; socket
    ↕       (确认对方可通话)
  传输层 :复用/分解、处理端到端的可靠数据传输,连接控制、流量控制、拥塞控制; 传输协议 TCP UDP
    ↕       (控制速度,数据分组) 将通信子网的技术、设计和欠缺与上层相隔离
  网络层 :将分组通过交换网络传送至目的主机(路径选择功能),  转发和路由;
    ↕       (加IP地址)
  数据链路层:1.差错控制,2.流量控制,3.链路管理(建立连接),4.寻址;
    ↕ (加MAC地址,Media Access Control Address 它用来确认网络设备位置的位址,每个网卡都有一个MAC )
  物理层: 无结构比特流传输;规定数据终端设备(DTE)与数据通信设备(DCE)之间接口的相关特性,(机械,电气,功能、规程)
           (光纤,双绞线,电磁波)                     发送端                    接收端
                                                   应用层&lt;-&#x2013;&#x2014; 协议 --&#x2013;&#x2014;&gt;应用层 ╮
  *1.数据在垂直的层次中 自上而下 地逐层传递至物理层;    ↕                          ↕    │
                                                   表示层&lt;-&#x2013;&#x2014; 协议 --&#x2013;&#x2014;&gt;表示层 │
  *2.对等层不直接进行通信,称为虚拟通信;                ↕                          ↕     &gt;端到端层(端口)
                                                   会话层&lt;-&#x2013;&#x2014; 协议 --&#x2013;&#x2014;&gt;会话层 │    虚拟通信
  *3.物理层的两个端点进制物理通信,称为实通信;           ↕                          ↕   │  信息处理服务
                                                   传输层&lt;-&#x2013;&#x2014; 协议 --&#x2013;&#x2014;&gt;传输层 ╯
  *4.中间系统通常只实现物理层、数据链路层和网络层功能;   ↕             ↕            ↕
                                                   网络层&lt;─协议─&gt;网络层&lt;─协议─&gt;网络层    ╮
      物理层、数据链路层、网络层为 结点到结点层;         ↕            ↕            ↕      |
                                                数据链路层&lt;协议&gt;数据链路层&lt;协议&gt;数据链路层 &gt;结点到结点层
      传输层、会话层、表示层、应用层为 端到端层;         ↕            ↕            ↕      |数据交换和传输
   (端到端层的第一个层)                              物理层&lt;─协议─&gt;物理&lt;──协议──&gt;层物理层 ╯&#x2014;实通信
                                                     ↑__<sub>传输介质</sub>__↑↑_<sub>传输介质</sub>___↑
                                                    发送方      中间系统       接收方
3&gt;有关术语
 *1.数据单元:在层的实体之间传送的比特组,
    对等层之间传输的数据单元:协议数据单元(PDU,Protocol Data Unit)
    应用层&lt;&#x2013;&gt;表示层&lt;&#x2013;&gt;会话层&lt;&#x2013;&gt;传输层&lt;-&#x2014;&gt;网络层&lt;&#x2013;&gt;数据链路层&lt;&#x2013;&gt;物理层
    (报文)                   数据段或报文段  分组或包      帧     比特流或位流
    (报应)                      (数段)       (络分)                (物流)
</p>

<p>
*2.服务访问点(Service Access Point,SAP)
   相邻层的服务是通过其接口上的 服务访问点 进行的,每个SAP都
   有一个唯一的 地址号码,N层SAP就是(N+1)层可以访问N层的地方;
</p>

<p>
*3.服务原语
   OSI参考模型中的每一层的真正功能是为其上一层服务的,第N层向(N+1)层
   N-PDU可表示为N-PC加上N-SDU,提供服务都通过一组原语描述的,包括四类:
   1)请求(Request): 用户实体请求服务做某种工作;
   2)指示(Indication): 用户实体被告知某件事发生;
   3)响应(Response): 用户实体表示对某件事的响应;
   4)证实(Confirm): 用户实体收到关于它的请求的答复;
</p>

<p>
4&gt;TCP/IP参考模型
  应用层(报文): 网络应用 www服务:HTTP 文件传输:FTP 电子邮件:SMTP和POP3
    ↕
  传输层(段): 面向连接:提供可靠数据流传输的传输控制协议:TCP
    ↕        无连接:不提供可靠数据传输的用户数据协议:UDP
    ↕
  网络互联层(数据报):TCP/IP参考模型 核心 ,IP协议,ICMP(互联网控制报文协议);
    ↕
  网络接口层(帧) :提供给网络互联层一个访问接口
</p>

<p>
*Internet组织在长期运行因特网的实践中,提出了一个基于TCP/IP协议簇的
 网络管理标准协议 SNMP ,并得到众多支持,使之成为事实上的网络管理工业标准;
</p>

<p>
5&gt;五层参考模型
  描述计算机网络中 最常用、最接近实际网络 的参考模型;
  应用层(报文)-&gt;传输层(段)-&gt;网络层(数据报)-&gt;链路层(帧)-&gt;物理层(比特流)
</p>
</div>
</div>
</div>

<div id="outline-container-org56b3848" class="outline-2">
<h2 id="org56b3848">第二章 应用层</h2>
<div class="outline-text-2" id="text-org56b3848">
</div>
<div id="outline-container-org1bdc63e" class="outline-3">
<h3 id="org1bdc63e">计算机网络应用体系结构(3种)</h3>
<div class="outline-text-3" id="text-org1bdc63e">
<p>
1&gt;客户/服务器(C/S)结构网络应用;(Client/Server)
 *1.C/S结构网络应用 是最典型、最基本的网络应用(例如:www应用;文件传输;电子邮件;)
 *2.特点:
   #1.网络通信双方分为客户程序 和 服务器程序,客户与客户之间不进行直接通信;
   #2.服务器程序 需 先运行起来, 做好接受通信的准备;
   #3.客户程序后运行,主动与服务器进行通信;
</p>

<p>
2&gt;纯P2P结构网络应用;
  P2P(Peer to Peer(对等端))
  通信双方没有传统意义上的客户端服务器之分,地位对等,通信双方都具备客户端与服务器的特征;
  P2P与传统因特网C/S两者在传输层及以下各层的协议结构是相同的,差别在 应用层;
  P2P网络是一种在IP网络上构建的覆盖网;
</p>

<p>
3&gt;混合结构网络应用(选择);
  混合结构网络应用将C/S应用和P2P应用相结合;
</p>
</div>
</div>
<div id="outline-container-org0dbe437" class="outline-3">
<h3 id="org0dbe437">网络应用通信基本原理</h3>
<div class="outline-text-3" id="text-org0dbe437">
<p>
1&gt;网络应用的基本通信过程
  网络应用的基本通信过程就是运行在不同主机上的 应用进程 间以C/S方式进行的通信;
  (微信)客户端   应用层协议   服务器端 (微信)
        应用层-----------&#x2013;&#x2014;应用层
         接口--&#x2013;&#x2014;API--&#x2013;&#x2014;接口  Application Programming Interface
        传输层                传输层            (应用编程接口)
</p>

<p>
2&gt;网络应用编程接口
   典型的 网络应用编程接口 是套接字(Socket),对于一个传输层协议,需要
   为其接口的每个套接字分配特定的编号,标识该套接字,该编号称为 端口号;
</p>
</div>
</div>

<div id="outline-container-org4e180a4" class="outline-3">
<h3 id="org4e180a4">域名系统(DNS,Domain Naming System)</h3>
<div class="outline-text-3" id="text-org4e180a4">
<p>
1&gt;域名系统
  *1.作用(选择题):将域名映射为IP地址,实现映射的过程,称为域名解析;
                         域名解析
     域名:www.baidu.com&lt;------&#x2013;&#x2014;&gt;IP地址:115.239.211.122;
</p>

<p>
*2.域名解析的原理(选择题)
   为了实现域名解析,域名系统会建立 分布式 数据库,存储域名与IP地址的映射关系数据;
</p>

<p>
2&gt;层次化域名空间
  *1.域名的命名方式:层次树状结构命名方式,每个域名有不同级别的域名构成,各层域名间用 点 分割;
     四级域名.三级域名.二级域名.顶级域名.根  例如 www.baidu.com (顶二三)
     域名不区分大小写;                    (三级域名.二级域名.顶级域名)
</p>

<p>
我国二级域名 划分为类别域名 和 行政区域名 两大类;
</p>

<p>
*2.顶级域名的分类
  #1.国家顶级域名:cn,us,uk等;
  #2.通用顶级域名:com(公司),org(非盈利组织),gov(政府),edu(教育),
                 net(网络组织),mil(军事组织),int(国际组织)等
  #3.基础结构域名:只有一个,arpa(反向域名解析);
</p>

<p>
3&gt;域名服务器
 *0.区:一个服务器所负责管辖的范围;
    DNS服务器:管辖范围不以"域"为单位, 而以"区"为单位;
 *1.作用:存储着自己所管辖范围内主机的域名到IP地址的映射
 *2.分类:根据其主要保存的域名信息以及在域名解析过程的作用分为:
    #1.根域名服务器:根域名服务器是最重要的服务器(a-m),全球有13个,保存所有顶级域名服务器的域名和IP;
    #2.顶级域名服务器:负责管理在该顶级域名服务器注册的所有二级域名;.com结尾的IP
    #3.权威域名服务器:保存该区中的 所有主机 的域名和IP地址的映射;
    #4.中间域名服务器:不是以上三种的域名服务器;
    #5.本地域名服务器:主机在网络地址配置是都会配置的,用于保存被查询域名信息;
                     是主机进行域名查询时首先被查询的域名服务器。
     本地域名服务器-&gt;根域名服务器-&gt;顶级域名服务器-&gt;中间域名服务器-&gt;权威域名服务器;
</p>

<p>
4&gt;域名解析过程(简答题)
   递归解析:
   主机进行域名查询时,本地域名服务器没有 被查询域名信息,则本地域名服务器 代理主机
   查询根域名服务器,根域名服务器代理本地域名服务器查询下一个域名服务,依次类推,
   直到得到被查询域名的IP地址,最后将解析结果发送给主机; 本地-&gt;根-&gt;顶级-&gt;权威
                                                    ↑&#x2014;根&lt;-顶级←&#x2013;┛
   迭代解析:
   主机进行域名查询时,本地域名服务器没有查询域名信息,则先求助根域名服务器,
   根域名服务器只是将下一步要查询的服务器告知查询主机的本地域名服务器,本地
   域名服务器继续查询下一个域名服务器,直到查询到被查询的域名的IP地址;
   本地-&gt;根 本地-&gt;顶级 本地-&gt;权威
</p>
</div>
</div>
