public/计算机网络原理笔记.html

<div id="outline-container-org539ce65" class="outline-3">
<h3 id="org539ce65">万维网应用</h3>
<div class="outline-text-3" id="text-org539ce65">
<p>
1&gt;万维网应用结构
 *1.万维网应用主要包括 浏览器、web服务器、HTTP协议;
   #1.浏览器:Web应用的客户代理;
   #2.web服务器:存储管理供用户请求浏览的Web页面(Web文档)
   #3.超文本传输协议(HTTP):客户和服务器间交换基于应用层的协议HTTP;
</p>

<p>
*2.URL:统一资源定位符(Uniform Resource Locator)
  URL作用:URL是HTTP标识被操作资源的方法;
  URL地址主要两个部分组成:存放对象的 主机域名(或IP地址) 和 对象的路径名;
  例:<a href="http://www.abc.edu.cn/cs/index.html">http://www.abc.edu.cn/cs/index.html</a>    //对象:网页上的图片、文字、视频等资源
          服务器主机域名(IP地址)/对象的路径名
</p>

<p>
URL的寻址方式确保万维网上的每个Web页面或对象都有一个唯一的标识符;
</p>

<p>
*3.用户通常利用客户端软件来使用某个网络应用,例如,浏览器,邮件收发软件等
   这个软件被称为 用户代理(user agent);
</p>

<p>
2&gt;HTTP(HyperText Transfer Protocol,HTTP) (综合题)
 *1.HTTP(超文本传输协议)概述
    Web应用的应用层协议,定义浏览器如何向Web服务器发送请求,以及Web服务器
    如何向浏览器进行响应,目前主要使用HTTP/1.0和HTTP1.1,以HTTP/1.1为主流;
</p>

<p>
*2.HTTP连接
  1)浏览器在向服务器发送请求之前,首先需要 建立TCP连接,
    然后才 发送 HTTP请求报文, 接收 HTTP响应报文;
    RTT:
    HTTP客户进程向服务器请求建立连接,从客户发送连接请求,到收到服务器连接确认,
    用时一个往返时间(Round Trip Time, RTT),RTT作为一个 时间单位 来使用
    客户端----------&#x2013;&#x2014;&gt;服务器
        ↖---------&#x2013;&#x2014;↙
</p>

<p>
2)使用TCP策略不同分为:
  #1.非持久连接的HTTP;
     指客户与服务器建立TCP连接后,通过该连接发送HTTP请求报文,接收HTTP响应报文,然后断开连接;
</p>

<p>
$1.一条连接(8个RTT)
  非持久连接HTTP的响应时间: 以请求浏览一个引用为例 总共8个RTT时间, 请求每个对象时,都要新建TCP连接;
</p>

<p>
$2.多条连接(4个RTT)
  优化:典型的优化技术:并行连接和持久连接;
  并行连接:通过建立多条并行TCP连接,并行发送HTTP请求和并行接收HTTP响应;(4个RTT, RTT是往返时间)
  并行连接会增加客户端主机的资源开销,如内存开销,故系统通常同时建立的并行TCP连接数是有限制的;
</p>

<p>
#2.持久连接的HTTP;
 $1.非流水(管道)方式的持久连接:
    客户端收通过持久连接到响应报文后,不断开TCP连接,继续请求接下来的文档;
</p>

<p>
$2.流水(管道)方式持久连接(HTTP1.1):
   客户端在通过持久连接收到前一个响应报文后,不断开连接,继续并行请求所需文档;
</p>

<p>
① HTTP/1.0 默认是非持久连接;
② HTTP/1.1 默认使用流水方式持久连接,HTTP/1.1持久连接默认是激活的; 半双工
③ HTTP/1.1代理服务器 不应该与 HTTP/1.0客户端 建立持久连接;
</p>

<p>
例题
设某网页的URL为“<a href="http://www.abc.com/index.html%E2%80%9D%EF%BC%8C%E4%B8%94%E8%AF%A5URL%E5%AF%B9%E5%BA%94%E7%9A%84IP%E5%9C%B0%E5%9D%80%E5%9C%A8%E4%BD%A0%E7%9A%84%E8%AE%A1%E7%AE%97%E6%9C%BA%E4%B8%8A%E6%B2%A1%E6%9C%89%E7%BC%93%E5%AD%98">http://www.abc.com/index.html%E2%80%9D%EF%BC%8C%E4%B8%94%E8%AF%A5URL%E5%AF%B9%E5%BA%94%E7%9A%84IP%E5%9C%B0%E5%9D%80%E5%9C%A8%E4%BD%A0%E7%9A%84%E8%AE%A1%E7%AE%97%E6%9C%BA%E4%B8%8A%E6%B2%A1%E6%9C%89%E7%BC%93%E5%AD%98</a>
(hosts中没有),文件index.html引用了 8个小图像,在域名解析的过程中,无等待的一次DNS解析请求与
响应时间记为RTTd,HTTP请求传输Web对象过程的一次往返时间记为RTTh。试给出：
 1.该URL中的域名。 域名:www.abc.com ;
</p>

<p>
2.浏览器解析到该URL对应的IP地址的最短时间和最长时间。
  最短时间1个RTTd (本地), 最长4个RTTd (本地+根+顶级+权威);
</p>

<p>
3.若浏览器没有配置并行TCP连接,则基于HTTP1.0获取该Web页的完整内容(包括引用的图像)
  所需要的时间(不包括域名解析时间):
  /**
</p>
<ul class="org-ul">
<li>解题思路:画图</li>
<li>连接TCP:1RTTh,</li>
<li>请求空网页:1RTTh  获取8张图片的URL;</li>
<li>(建立TCP 1RTTh+请求图1RTTh) *8=16RTTh</li>
</ul>
<p>
*/
  1+1+16=18RTTh;
</p>

<p>
4.若浏览器配置5个并行TCP连接，则基于HTTP1.0获取该Web页的完整内容(包括引用的图像)
  需要的时间(不包括域名解析时间):
  /**
</p>
<ul class="org-ul">
<li>并行5个</li>
<li>建立TCP连接 1RTTh,</li>
<li>请求web空页面1RTTh, 获取8张图片的URL;</li>
<li>建立5条TCP连接:1RTTh</li>
<li>请求图片1,2,3,4,5:1RTTh</li>
<li>建立3条TCP连接 :1RTTh</li>
<li>请求 6,7,8:1RTTh</li>
</ul>
<p>
*/
  6RTTh;
</p>

<p>
5.若浏览器没有配置并行TCP连接，分别计算基于非流水方式的HTTP1.1获取该Web页完整内容需要的时间
  以及基于流水方式的HTTP1.1获取该Web页的完整内容(包括引用的图像)需要的时间(不包括域名解析时间)
  /**                                     /**
</p>
<ul class="org-ul">
<li>建立TCP连接 1RTTh,                      * 建立TCP连接 1RTTh,</li>
<li>请求web空页面1RTTh, 获取8张图片的URL;    * 请求web空页面1RTTh, 获取8张图片的URL;</li>
<li>请求8张图片 8RTTh,                      * 请求8张图片 1RTTh,</li>
</ul>
<p>
*/                                       */
 非流水方式=10RTTh;                        流水方式=3RTTh;
</p>

<p>
3)HTTP报文(选择,填空)
*1.报文结构:
</p>
<p>
<del>-------</del>----------------------------<del>----------------------------------</del>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">报文结构</td>
<td class="org-left">请求报文</td>
<td class="org-left">响应报文</td>
</tr>
</tbody>
</table>
<p>
<del>-------</del>----------------------------<del>----------------------------------</del>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">起始行</td>
<td class="org-left">请求行:&lt;方法&gt;&lt;URL&gt;&lt;协议版本&gt;</td>
<td class="org-left">状态行:&lt;协议版本&gt;&lt;状态码&gt;&lt;原因短语&gt;</td>
</tr>
</tbody>
</table>
<p>
<del>-------</del>----------------------------<del>----------------------------------</del>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">首部行</td>
<td class="org-left">携带附加信息</td>
<td class="org-left">携带附加信息</td>
</tr>
</tbody>
</table>
<p>
<del>-------</del>----------------------------<del>----------------------------------</del>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">空白行</td>
<td class="org-left">CR回车 LF换行(必须有)</td>
<td class="org-left">CRLF(回车换行)</td>
</tr>
</tbody>
</table>
<p>
<del>-------</del>----------------------------<del>----------------------------------</del>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">报文主体</td>
<td class="org-left">实际要请求的内容</td>
<td class="org-left">实际要响应的内容</td>
</tr>
</tbody>
</table>
<p>
<del>-------</del>----------------------------<del>----------------------------------</del>
*请求报文和响应报文最大的不同在于起始行,起始行在请求报文中为请求行,在响应报文中为状态行;
</p>

<p>
*2.请求方法:
</p>
<p>
<del>------</del>-----------------------------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">GET</td>
<td class="org-left">请求读取由URL所标识的信息, 是 最常见 的方法;</td>
</tr>
</tbody>
</table>
<p>
<del>------</del>-----------------------------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">HEAD</td>
<td class="org-left">请求读取由URL所标识的信息的首部;</td>
</tr>
</tbody>
</table>
<p>
<del>------</del>-----------------------------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">POST</td>
<td class="org-left">给服务器添加信息;</td>
</tr>
</tbody>
</table>
<p>
<del>------</del>-----------------------------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">OPTION</td>
<td class="org-left">请求一些选项的信息;</td>
</tr>
</tbody>
</table>
<p>
<del>------</del>-----------------------------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">PUT</td>
<td class="org-left">在指明的URL下存储一个文档;</td>
</tr>
</tbody>
</table>
<p>
<del>------</del>-----------------------------------&#x2013;&#x2014;+
</p>

<p>
*3.状态码:2位十进制数,利用第一位十进制数字区分5类状态码;
</p>
<p>
<del>---------</del>---------<del>-------------</del>----------------------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">状态码类别</td>
<td class="org-left">取值范围</td>
<td class="org-left">作用</td>
<td class="org-left">说明</td>
</tr>
</tbody>
</table>
<p>
<del>---------</del>---------<del>-------------</del>----------------------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">1××</td>
<td class="org-left">100~199</td>
<td class="org-left">信息提示</td>
<td class="org-left">通告请求已接收,可能还需要进一步交互</td>
</tr>
</tbody>
</table>
<p>
<del>---------</del>---------<del>-------------</del>----------------------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">2××</td>
<td class="org-left">200~299</td>
<td class="org-left">成功</td>
<td class="org-left">成功完成客户请求操作,并进行响应</td>
</tr>
</tbody>
</table>
<p>
<del>---------</del>---------<del>-------------</del>----------------------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">3××</td>
<td class="org-left">300~399</td>
<td class="org-left">重定向</td>
<td class="org-left">表示资源已移走,需要向新URL发送请求</td>
</tr>
</tbody>
</table>
<p>
<del>---------</del>---------<del>-------------</del>----------------------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">4××</td>
<td class="org-left">400~499</td>
<td class="org-left">客户端错误</td>
<td class="org-left">由于客户端错误无法成功响应</td>
</tr>
</tbody>
</table>
<p>
<del>---------</del>---------<del>-------------</del>----------------------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">5××</td>
<td class="org-left">500~599</td>
<td class="org-left">服务器错误</td>
<td class="org-left">由于服务器错误,无法成功响应</td>
</tr>
</tbody>
</table>
<p>
<del>---------</del>---------<del>-------------</del>----------------------------&#x2013;&#x2014;+
</p>

<p>
常见状态码
</p>
<p>
<del>-----</del>------------------------------<del>---------------------------------</del>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">状态码</td>
<td class="org-left">短语</td>
<td class="org-left">说明</td>
</tr>
</tbody>
</table>
<p>
<del>-----</del>------------------------------<del>---------------------------------</del>
</p>
<table>


<colgroup>
<col  class="org-right">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-right">100</td>
<td class="org-left">Continue</td>
<td class="org-left">已成功收到请求的初始部分,请客户端继续</td>
</tr>
</tbody>
</table>
<p>
<del>-----</del>------------------------------<del>---------------------------------</del>
</p>
<table>


<colgroup>
<col  class="org-right">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-right">200</td>
<td class="org-left">OK</td>
<td class="org-left">成功,所请求信息在响应报文中</td>
</tr>
</tbody>
</table>
<p>
<del>-----</del>------------------------------<del>---------------------------------</del>
</p>
<table>


<colgroup>
<col  class="org-right">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-right">301</td>
<td class="org-left">Moved Permanently</td>
<td class="org-left">重定向</td>
</tr>
</tbody>
</table>
<p>
<del>-----</del>------------------------------<del>---------------------------------</del>
</p>
<table>


<colgroup>
<col  class="org-right">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-right">400</td>
<td class="org-left">Bad Request</td>
<td class="org-left">客户端请求错误</td>
</tr>
</tbody>
</table>
<p>
<del>-----</del>------------------------------<del>---------------------------------</del>
</p>
<table>


<colgroup>
<col  class="org-right">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-right">401</td>
<td class="org-left">Unauthorized</td>
<td class="org-left">未授权,需要输入用户名和密码</td>
</tr>
</tbody>
</table>
<p>
<del>-----</del>------------------------------<del>---------------------------------</del>
</p>
<table>


<colgroup>
<col  class="org-right">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-right">404</td>
<td class="org-left">Not Found</td>
<td class="org-left">客户端请求的对象,在服务器上不存在</td>
</tr>
</tbody>
</table>
<p>
<del>-----</del>------------------------------<del>---------------------------------</del>
</p>
<table>


<colgroup>
<col  class="org-right">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-right">451</td>
<td class="org-left">Unsupported Media Type</td>
<td class="org-left">不支持的媒体类型</td>
</tr>
</tbody>
</table>
<p>
<del>-----</del>------------------------------<del>---------------------------------</del>
</p>
<table>


<colgroup>
<col  class="org-right">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-right">505</td>
<td class="org-left">HTTP Version Not Supported</td>
<td class="org-left">请求使用的HTTP版本,服务器不支持</td>
</tr>
</tbody>
</table>
<p>
<del>-----</del>------------------------------<del>---------------------------------</del>
</p>

<p>
3&gt;cookie(选择,填空)
 *1.HTTP服务器不保存客户的任何信息,被称为无状态协议;
 *2.为了记录保存客户信息,引入Cookie机制,用于用户跟踪;
 *3.Cookie(小型文本文件):
    网站为了辨别用户身份,进行会话跟踪而存在 用户本地终端 上的数据;
</p>

<p>
*4.Cookie技术包括4部分内容(简答)
  1)HTTP 响应报文 中的Cookie头行: Set-Cookie 用户的Cookie ID,用户偏好等;
  2)用户浏览器在本地 存储、维护、和管理的Cookie文件;
  3)HTTP请求报文中的Cookie头行:用户已访问过的网站再次访问是,浏览器会检索本地Cookie文件;
  4)网站在后台数据中存储、维护Cookie信息:分配用户ID、每个ID用户在本网站的访问特征等;
</p>

<p>
*5.Cookie的常见用途
 1)网站可以利用Cookie的ID来准确统计网站的实际访问人数,新访问者和重复访问者的人数对比及访问频率;
 2)网站可以利用Cookie限制某些特定用户的访问;
 3)网站可以存储用户访问过程中的操作习惯和偏好;
 4)记录用户登录网站使用的用户名、密码等信息;
 5)电子商务网站利用Cookie可以实现"购物车"功能;
</p>
</div>
</div>
