public/计算机网络原理笔记.html
<div id="outline-container-org0243eb4" class="outline-3">
<h3 id="org0243eb4">Internet电子邮件</h3>
<div class="outline-text-3" id="text-org0243eb4">
<p>
1&gt;邮件系统结构(选择填空)
  *1.邮件服务器(电子邮件体系结构的核心)
     负责发送和接收邮件,向发信人报告信件传送情况(已交付,被拒绝,丢失),用户注册,分配存储空间
     xuezhihui  @    163.com
     用户邮箱名  在 邮箱服务器域名
</p>

<p>
*2.用户代理(电子邮件应用的客户端软件)
   Outlook,Apple Mail, Fox Mail等支持用户撰写、显示、处理 和
   收发邮件,为用户阅读,回复,转发,保存和撰写邮件提供编辑与操作环境;
</p>

<p>
*3.简单邮件传输协议(SMTP)
   是核心应用层协议,实现邮件服务器之间或用户代理到邮件服务器间的 邮件传输;
</p>

<p>
*4.邮件读取协议(POP3,IMAP,HTTP)
   第三版邮局协议    	      Post Office Protocol - Version 3	POP3
   互联网邮件访问协议	      Internet Message Access Protocol	IMAP
   Web邮件系统的邮件读取协议	HyperText Transfer Protocol	    HTTP
</p>

<p>
2&gt;SMTP 简单邮件传输协议 (Simple Mail Transfer Protocol)
  *1.通过3个阶段的应用层交互完成邮件传输:
     1)握手阶段
     2)邮件传输阶段
     3)关闭阶段
</p>

<p>
*2.定义了14条命令,每条命令用4个字母组成;
   例如: HELO:标识发件人身份; DATA:通知服务器准备开始发送邮件内容, QUIT:命令退出;
</p>

<p>
*3.SMTP定义了21种应答信息,一般只一行,由3位数字的代码开始,后面附上(可无)简单的文字说明;
   例如:220 mail.abc.com     SMTP服务器端口号 25;
</p>

<p>
*4.SMTP的特点
  1)SMTP只能传送 7位 ASCII码文本内容,(包括SMTP命令,应答消息,以及邮件内容);
  2)SMTP传送的邮件内容中不能包含 "CRLF.CRLF", (因为该信息用于标识邮件内容的结束);
  3)SMTP是 "推动" 协议(HTTP是"拉动"协议);
  4)SMTP使用 TCP连接 是持久的;
</p>


<p>
3&gt;电子邮件格式与MIME
  *1.一封邮件的格式结构
     首部  空白  行主体
</p>

<p>
*2.邮件中常见的首部行内容:
   To	   后面收件人的电子邮件地址  (必填)
   Subject	邮件的主题             ╮
   Cc	   表示应给发送一个邮件副本  |
   From	   表示发信人的电子邮件地址   &gt;可选
   Date	   发信日期                |
   Reply-To 对方回信所用的地址       ╯
</p>

<p>
*3.MIME 互联网邮件扩展（Multipurpose Internet Mail Extensions）
  0)用于传输非7位ASCII码文本内容时;
  1)有5个 MIME邮件 首部字段;
    MIME-Version(MIME版本), Content-Description(邮件概述),Content-Id(邮件唯一标识)
    Content-Transfer-Encoding(编码方式)  Content-Type(主体内容类型和格式)
  2)定义了 多种邮件内容的格式, 对多媒体电子邮件的表示方法进行了标准化;
  3)定义了邮件传送编码,可对 任何内容格式进行转换 ,从而适用于通过SMTP进行传送;
</p>

<p>
4&gt;邮件读取协议
  *1.POP3 第三版邮局协议(Post Office Protocol - Version 3)
     1)授权阶段(用户名和密码)
     2)事务处理阶段(list,retr,dele)
     3)更新阶段(quit)
</p>

<p>
user  xxxx:用于向服务器传送用户名
pass  xxxx:用于向服务器发送用户密码
list:用于请求所有的邮件序号和邮件长度
retr邮件号:用于请求服务器传送第几封邮件
dele邮件号:用于将邮件标记为删除
quit: 结束会话，并更新操作
</p>

<p>
*2.IMAP 互联网邮件访问协议(Internet Message Access Protocol)
   IMAP 服务器将每个邮件与一个文件夹进行关联，
   通过 IMAP 收件人可以对邮件进行移动、查询、阅读、删除等操作。
   IMAP 允许用户代理只读邮件的部分内容;
</p>

<p>
IMAP与POP3的区别:
对邮件的操作是否会反映在服务器上 IMAP(会)  POP3(不会)
</p>

<p>
*3.HTTP：Web邮件系统的邮件读取协议
</p>
</div>
</div>
