public/计算机网络原理笔记.html
<div id="outline-container-orgd7ca04f" class="outline-3">
<h3 id="orgd7ca04f">FTP 文件传输协议(File Transfer Protocol,FTP)</h3>
<div class="outline-text-3" id="text-orgd7ca04f">
<p>
*1.在互联网的两个主机间实现文件互传的网络应用,其应用层协议称为FTP;
</p>

<p>
*2.进程两大组成部分:
  #1.主进程:负责接受新的客户请求;
  #2.从属进程: 负责处理单个客户请求,与具体客户进行交互;
  应用结构
    FTP  &lt;───控制连接(持久,端口号21)───&gt; FTP
   客户端&lt;&#x2014;数据连接(临时,端口号20)&#x2014;&gt;服务器
     ↕                                  ↕
  文件系统                           文件系统
</p>

<p>
*3.FTP控制信息的传送方式为 带外控制;
   #0.由于FTP专门使用一个独立的控制连接传输控制信息,与传输文件信息进行分离,故将其传送方式称为 "带外控制";
   #1.控制连接：客户和服务器之间传输控制信息。如用户标识、口令、改变远程目录，上传下载文件命令等。
   #2.数据连接：实际传送文件内容。 *.控制连接服务器端口号为21; 数据连接服务器端口号为20;
</p>

<p>
带内控制协议: 命令、数据通过一个TCP连接传输的应用层协议,例如HTTP;
带外控制协议: 专门使用一个独立的控制连接传输控制信息,与传输文件信息进行分离,例如FTP;
</p>

<p>
*4.FTP是 有状态 的协议, FTP的命令是 可读的
   例如:List(文件列表), RETR下载/STOR上传 filename ,USER usename, PASS password,
</p>

<p>
*5.不需要专门的用户名和口令就可以登录的FTP服务器称为 匿名 服务器;
</p>

<p>
7.P2P应用
 *1.P2P:Peer to Peer  P2P应用:BitTorrent、PPLive 和 PPstream等;
</p>

<p>
*2.P2P应用特点(选择,填空)
  #1.应用的对等方是用户的计算机;
  #2.很强的应用规模伸缩性;
  #3.应用都是动态地在对等方之间进行;
  #4.应用充分聚集利用了端系统的计算能力以及网络传输带宽;
</p>

<p>
8.Socket编程基础
  套接字(Socket): 典型的网络应用编程接口
  端口号(Port number):标识套接字;
</p>

<p>
*1.常见的服务器端口号(选择,填空)
   20,21   FTP文件传输协议端口号 控制端口号21，数据端口号20;
   23      Telnet远程终端协议的端口号;
   25      SMTP简单邮件传输协议端口号;
   53      DNS域名服务器端口号;
   69      TFTP简单文件传送协议端口号;
   80      HTTP超文本传输协议端口号;
   110     POP3第三版的邮局协议端口号;
   161,162 SNMP简单网络管理协议的端口号;
   520     RIP路由信息协议的端口号;
</p>

<p>
*2.Socket API函数
</p>
<ol class="org-ol">
<li>创建套接字: socket();
参数: 流式套接字: SOCK<sub>STREAM</sub>;面向传输层: TCP接口;
     数据报套接字:SOCK<sub>DGRAM</sub>; 面向传输层: UDP接口;
     原始套接字:  SOCK<sub>RAW</sub>;   面向网络层: 如IP,ICMP等接口;</li>
<li>绑定套接字的本机地址和端口号: bind();</li>
<li>设置监听: listen();</li>
<li>建立连接: TCP客户端: connect(); TCP服务端: accept();</li>
<li>发送数据: TCP: send(); UDP: sendto</li>
<li>接收数据: TCP: recv(); UDP: recvfrom;</li>
<li>关闭套接字: close();</li>
</ol>

<p>
*3.UDP及TCP的Socket
  #1.UDP Socket:
     UDP客户端                  UDP服务端
</p>
<ol class="org-ol">
<li>创建套接字 socket()   1)创建套接字 socket()</li>
<li>发送数据   sendto     2)绑定地址和端口号 bind()</li>
<li>接收数据   recvfrom   3)接收数据 recvfrom</li>
<li>关闭套接字 close()    4)发送数据 sendto
5)关闭套接字 close()</li>
</ol>

<p>
#2.TCP Socket:
   TCP客户端               TCP服务端
</p>
<ol class="org-ol">
<li>创建套接字 socket()   1)创建套接字 socket()</li>
<li>建立连接 connect()    2)绑定地址和端口号 bind()</li>
<li>发送数据 send()       3)设置监听 listen();</li>
<li>接收数据 recv()       4)建立连接 accept()</li>
<li>关闭套接字 close()    5)接收数据 recv()
6)发送数据 send()
7)关闭套接字close()</li>
</ol>
<p>
WebSocket
特点
 1.服务器可以主动向客户端推送消息,客户端也可以主动向服务器发送信息,是真正的双向平等对话;
   实现原理:客户端向WebSocket服务器通知(notify)一个带有所有接收者ID(recipient IDs)的
   事件(event),服务器接收后立即通知所有活跃的(active)客户端,只有ID在接收者ID序列中的
   客户端才会处理这个事件,WebSocket本身是基于TCP协议的;
</p>

<p>
2.WebSocket与Http区别
         Http                                WebSocket
  Client       Server                Client            Server
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Request</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Handshake</th>
<th scope="col" class="org-left">握手</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Response</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Acknowledgement</td>
<td class="org-left">确认</td>
</tr>

<tr>
<td class="org-left">&lt;------------</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&lt;-----------------</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&lt;-----------&#x2013;&#x2014;&gt;</td>
</tr>

<tr>
<td class="org-left">Request</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Bi-directional msg</td>
<td class="org-left">双向通信(双全工模式)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Response</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Connection end</td>
<td class="org-left">连接结束</td>
</tr>

<tr>
<td class="org-left">&lt;------------</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&lt;-----------&#x2013;&#x2014;&gt;</td>
</tr>
</tbody>
</table>
<p>
  ↓             ↓                    ↓                  ↓
Connection lifecycle                 Connection lifecycle  连接生命周期
</p>

<p>
*1.WebSocket 是一个持久化协议,相对HTTP这种非持久的协议来说,Http的生命周期是
   通过Request来界定的,也就是一个Request,回应一个Response,Http请求结束(HTTP1.0);
</p>

<p>
*2.在HTTP1.1中有了改进,增加了一个keep-alive,也就是说,在一个HTTP连接中,可以发送
   多个Request,接收多个Response,但请记住 Request=Response,也就是说,一个Request
   只能有一个Response,而且这个Response也是被动的,不能主动发起;
</p>

<p>
首先我们来看个典型的 WebSocket 握手:
Client: 发起请求
</p>
<hr>
<p>
GET /chat HTTP/1.1        //请求方式
Host: server.classOuter.com  //主机
Connection: Upgrade       //表示要升级协议
Upgrade: websocket        //表示要升级到WebSocket协议
Sec-WebSocket-Key: x3JJHMbDL1EzLkh9GBhXDw== //与服务端响应首部的sec-WebSocket-Accept配套,来验证服务器;
Sec-WebSocket-Protocol: chat, superchat //是一个用户定义的字符串,区分同URL下,不同的服务所需要的协议。
Sec-WebSocket-Version: 13 //所使用的 WebSocket Draft （协议版本）
Origin: <a href="http://classouter.com">http://classouter.com</a>
</p>
<hr>

<p>
Server: 接受到请求,成功建立WebSocket
</p>
<hr>
<p>
HTTP/1.1 101 Switching Protocols //状态码101表示已经切换为WebSocket协议,后续的数据交互都按照新的协议来;
Upgrade: websocket
Connection: Upgrade
Sec-WebSocket-Protocol: chat
Sec-WebSocket-Accept: HSmrc0sMlYUkAGmm5OPpG2HaGWk= //根据客户端的set-WebSocket-key,先SHA1算出摘要,
//toBase64( sha1(Sec-WebSocket-Key + 258EAFA5-E914-47DA-95CA-C5AB0DC85B11) ),  再转成base64字符串
</p>
<hr>

<p>
3.WebSocket的特点
 *1.建立在TCP协议之上,服务器端实现比较容易;
 *2.与HTTP协议有着良好的兼容性,默认端口也是80和443,并且握手阶段
    采用HTTP协议,因此握手时不容易屏蔽,能通过各种HTTP代理服务器;
 *3.数据格式比较轻量,性能开销小,通信高效;
 *4.可以发送文本,也可以发送二进制数据;
 *5.没有同源限制,客户端可以与任意服务器通信;
 *6.协议标识符是ws(如果加密.则为wss),服务器网址就是URL;
</p>

<p>
4.数据帧
  WebSocket客户端,服务端通信的最小单位是帧(frame),由一个或多个帧组成一条完整的消息(message);
   *1.发送端: 将消息切割成多个帧,并发送给服务端;
   *2.接收端: 接收消息帧,并将关联的帧重新组装成完整的消息;
</p>

<p>
5.连接保持+心跳
  WebSocket为了保持客户端,服务端的实时双向通信,需要确保客户端,服务端之间的TCP保持连接没有断开,
  然而,对于长时间没有数据往来的连接,如果依旧长时间保持着,可能会浪费宝贵的连接资源,这个时候可以
  采用心跳来实现;
   *1.发送方&#x2013;&gt;接收方: ping
   *2.接收方&#x2013;&gt;发送方: pong
</p>

<p>
ping、pong的操作,对应的是WebSocket的两个控制帧,opcode分别是0x9,0xA;
</p>

<p>
6.关闭连接
  一旦发送或接收到Close控制帧,这就是说，<sub>WebSocket</sub> 关闭阶段握手已启动，且 WebSocket 连接处于 CLOSING 状态。
  当底层TCP连接已关闭，这就是说 WebSocket连接已关闭 且 WebSocket 连接处于 CLOSED 状态。
  如果 TCP 连接在 WebSocket 关闭阶段已经完成后被关闭，WebSocket连接被说成已经 完全地 关闭了。
</p>

<p>
7.关闭连接的原因状态码
</p>

<p>
状态码	  名称	                             描述
0–999     保留段,                             未使用.
1000   CLOSE<sub>NORMAL</sub>         正常关闭; 无论为何目的而创建, 该链接都已成功完成任务.
1001	  CLOSE<sub>GOING</sub><sub>AWAY</sub>     终端离开, 可能因为服务端错误, 也可能因为浏览器正从打开连接的页面跳转离开.
1002   CLOSE<sub>PROTOCOL</sub><sub>ERROR</sub> 由于协议错误而中断连接.
1003	  CLOSE<sub>UNSUPPORTED</sub>     由于接收到不允许的数据类型而断连(如仅接收文本数据的终端接收到了二进制数据).
1004		                    保留. 其意义可能会在未来定义.
1005   CLOSE<sub>NO</sub><sub>STATUS</sub>     保留.  表示没有收到预期的状态码.
1006   CLOSE<sub>ABNORMAL</sub>     保留. 用于期望收到状态码时连接非正常关闭 (也就是说, 没有发送关闭帧).
1007	  Unsupported Data	    由于收到了格式不符的数据而断开连接 (如文本消息中包含了非 UTF-8 数据).
1008	  Policy Violation	    由于收到不符合约定的数据而断连.这是通用状态码,用于不适用1003和1009码的场景.
1009	  CLOSE<sub>TOO</sub><sub>LARGE</sub>     由于收到过大的数据帧而断开连接.
1010	  Missing Extension	    客户端期望服务器商定一个或多个拓展, 但服务器没有处理, 因此客户端断开连接.
1011	  Internal Error	    客户端由于遇到没有预料的情况阻止其完成请求, 因此服务端断开连接.
1012   Service Restart	    服务器由于重启而断开连接.
1013   Try Again Later	    服务器由于临时原因断开连接, 如服务器过载因此断开一部分客户端连接.
1014		                    由 WebSocket 标准保留以便未来使用.
1015	  TLS Handshake	        保留. 表示连接由于无法完成 TLS 握手而关闭 (例如无法验证服务器证书).
1016–1999		            由 WebSocket 标准保留以便未来使用.
2000–2999		            由 WebSocket 拓展保留使用.
3000–3999		            可以由库或框架使用.不应由应用使用. 可以在 IANA 注册, 先到先得.
4000–4999		            可以由应用使用.
</p>

<p>
8.ajax轮询 与 long poll
 1&gt;ajax轮询
   原理:让客户端隔个几秒就发送一次请求，询问服务器是否有新信息。
</p>

<p>
2&gt;long poll
  原理:采取的是阻塞模型（一直打电话，没收到就不挂电话），也就是说，客户端发起连接后，如果没消息，
       就一直不返回Response给客户端。直到有消息才返回，返回完之后，客户端再次建立连接，周而复始。
</p>

<p>
3&gt;实现支持
  ajax轮询 需要服务器有很快的处理速度和资源。（速度）
  long poll 需要有很高的并发，也就是说同时接待客户的能力。（场地大小）
</p>

<p>
4&gt;WebSocket使用回调，即：你有信息了再来通知我，而不是我傻乎乎的每次跑来问你
</p>
</div>
</div>
</div>
