org/计算机网络原理笔记.org
** 传输层的基本服务
 1.传输层功能
  1>传输层的核心任务: 应用进程之间提供 端到端的 逻辑通信服务;
    只有主机(协议栈)才有传输层; (端口号到端口号)
    网络核心中的路由器、交换机、集线器等只用到下三层的功能;(网络层,数据链路层,物理层)
    从传输层的角度看,端到端的通信是 应用进程 之间的通信;

  2>传输层功能
    *1.对应用层报文进行 分段 和 重组;
    *2.面向应用层实现 复用 与 分解;
    *3.实现端到端的流量控制;
    *4.拥塞控制
    *5.传输层寻址
    *6.对报文进行差错检测 crc
    *7.实现进程间的 端到端 可靠 数据传输控制;

    助记:吩咐刘墉寻差错-可靠
         分复流拥寻差错 -可靠传输

 2.传输层寻址与端口
  1>一台计算机中,不同应用进程用 进程标识符(进程ID,PID) 来区分;

  2>TCP/IP体系结构网络的解决方法:
    在传输层使用协议端口号,通常简称为 端口(port),
    在全网范围内利用 "IP地址+端口号" 唯一标识一个通信端点;
    应用层和传输层间抽象的协议端口是 软件端口;

  3>传输层端口号:
    *0.传输层端口号为16位整数,可编号65536个(2的16次方)
    *1.服务器端使用的端口号: 熟知端口号 和 登记端口号;
       例如 FTP服务器默认端口号 为 21;
           HTTP服务器默认端口号 为 80

    *3.客户端使用的端口号:临时性,在客户进程运行时
       由操作系统随机选取唯一的未被使用的端口;

       端口号小于256的端口为 常用端口;
       0——1023:	    熟知端口号 \
                                服务器端
       1024——49151:	登记端口号 /

       49152——65535:客户端口号，或短暂端口号(*3)

 3.无连接服务与面向连接服务(***** 简答题)
   +----------------------------------+------------------------------------------+
   |          无连接服务(UDP)          |              面向连接服务(TCP)            |
   +----------------------------------+------------------------------------------+
   |数据传输前:无需与对端进行任何信息交换| 数据传输前:需要双方交换一些控制信息,建立逻辑 |
   |直接构造传输层报文段,并向接收端发送; | 连接,然后再传输数据,传输结束后还需要拆除连接;|
   +----------------------------------+------------------------------------------+
   |           类型于信件通信;         |               类似于电话通信               |
   +----------------------------------+------------------------------------------+

** 传输层的复用与分解(用)
 1.复用与分解
  1>多路复用:
    在源主机,传输层协议从不同的套接字收集应用进程发送的数据块,
    并为每个数据块封装上首部信息(包括用于分解的信息)构成报文段,
    然后将报文段传递给网络层;

  2>多路分解
    在目的主机,传输层协议读取报文段中的字段,标识出接收套接字,
    进而通过该套接字,将传输层的报文段中的数据交付给正确的套接字;

  3>作用
    传输层的多路复用与多路分解(分用)可 支持众多 应用进程共用
    同一个传输层协议, 并能将接收的数据准确交付给不同应用进程,

 2.UDP(用户数据报协议 User Datagram Protocol)
   Internet提供 无连接服务的传输层协议;
   UDP将应用层的数据块封装成一个UDP报文段,包括应用数据,源端口号,目的端口号;
   UDP套接字二元组:<目的IP地址, 目的端口号>

   UDP套接字分配端口号的两种方法:
   1)自动为该套接字分配一个未被使用的端口号(通常从1024~65535中选一个分配);
   2)通过调用函数bind(),为该套接字绑定一个特定端口号;

 3.TCP(传输控制协议 Transfer Control Protocol)
   Internet提供 面向连接服务的传输层协议;
   TCP套接字四元组:<源IP地址, 源端口号, 目的IP地址, 目的端口号>

 4.传输层协议依据 IP地址 和 端口号 实现 多路分解 与 多路复用;

** 停等协议与滑动窗口协议
 1.可靠数据传输基本原理
  1>不可靠传输信道在不可靠性表现:
    *1.比特差错: 1001-1000
    *2.乱序: 数据块 1,2,4,5,6,3,
    *3.数据丢失: 数据块 1,2,5

  2>基于不可靠信道实现可靠数据传输采取的措施
    *1.差错检测: 利用差错编码实现数据包传输过程中的比特差错检验;
    *2.确认:  接收方向发送方反馈接收状态,ACK(肯定确认); NAK(否定确认)
    *3.重传:  发送方重新发送接收方没有正确接收的数据;
    *4.序号:  确保数据按序提交;(对数据进行编号,即便不按编号到达,可以按编号提交)
    *5.计时器:解决 数据丢失 问题;

  3>传输层实现可靠数据传输的理论协议有 等-停协议 和 滑动窗口协议;

 2.停-等协议(自动重传请求协议ARQ)
   *1.工作流程:
      ┌────────┐─────────①发送数据,等待确认───────>┌────────┐
      │ 发送方 │<─────────②肯定确认/否定确认────────│ 接收方 │
      └────────┘──────────③后续数据/重传数据──────>└────────┘

      #1.发送方发送经过差错编码的报文段,等待接收方的确认;
      #2.接收方如果正确接收报文段,即差错检测无误且序号正确,
         则接收报文段,并向发送方发送ACK,否则丢弃报文段,并向发送方发送NAK;
      #3.发送方如果收到ACK,则继续发送后续报文段,否则重发刚刚发送的报文段;

   *2.特点:所需缓冲空间小,但信道利用率低

 3.滑动窗口协议
  1>流水线协议(管道协议)
    允许发送方在没有收到确认前,连续发送 多个 分组;
    最典型的流水线协议: 滑动窗口协议;

  2>流水线协议实现可靠传输需要:
    *1.增加分组序号;
    *2.协议的发送方和接收方可以缓存多个分组

  3>滑动窗口协议
    *1.分组连续编号;
    *2.以流水线方式依次发送分组;
    *3.接收方接收分组,按分组序号向上有序提交;
    *4.通过确认,向发送方通告正确接收的分组序号;
       确认只采用ACK,例如,正确接收分组01, 则返回ACK01;
    *5.发送方根据收到的ACK的序号以及计时器,重发或继续发送新的分组;

    滑动窗口协议的窗口大小与接收窗口大小之和 小于等于 分组序号空间大小;
    即:Ws+Wr≤2^k; 报文段的序号采用k位二进制位串进行编号,其编号空间为:0~2^K-1,共2^k个编号;

  4>滑动窗口协议工作流程图
                    发送窗口
    发送方 ① ② ③ ④ |5|6|7|8|9| 10 11 12
                   已发送 ↓ ↘
                        已用 下一个可用序号;
    1)发送窗口Ws=5;
    2)1,2,3,4(发送窗口左侧)收到ACK;
    3)5,6,7,8,9(发送窗口中)当前可以发送的;
    4)10,11,12(发送窗口右侧)当前不可以发送的;

                      接收窗口
    接收方 ① ② ③ ④ ⑤ ⑥ |7|8|9| 10 11 12
    1)1,2,3,4,5,6(接收窗口左侧)正确接收,并提交给协议用户的序号;
    2)7,8,9期望接收但未收到;
    3)10,11,12 暂时不能接收的;

    注意事项:
    1)发送方的发送窗口(Ws):发送方可发送的 未被确认分组 的最大数量;
    2)接收方的接收窗口(Wr):接收方可缓存的 正确到达的分组 的最大数量;
    3)发送窗口内序号可能存在3种状态:
     *1.已用 未被确认序号, 如:5,6,7;
     *2.已用且已被确认序号,如:8
     *3.可用但尚未使用的序号,如:9;

  5>分类(根据接收窗口的大小)
   *1.GBN协议(GO-Back-N) 回退N步协议
     1)特点:
       #1.发送方(Ws≥1)缓存能力高,可以在没有得到确认前连续发送多个分组;

       #2.接收方(Wr=1)缓存能力很低,只接收1个按序到达的分组,不能缓存
          未按序到达 的分组,未按序到达 的分组丢弃,并让发送方重传;

       例如:要收0~7序号分组, 现在收到 0,1,4,7号分组,只接收0,1,再重发2~7;

     2)GBN发送方响应的3类事件:
      #1.上层调用,请求发送数据

      #2.收到1个ACKn,GBN采用 累积确认 方式,即当发送方收到ACKn时,
         表明接收方已正确接收 序号为n 以及 序号小于n的所有分组;

      #3.计时器超时时,发送方只使用一个计时器,且只对
         当前发送窗口的"基序号"指向的分组进行计时;


    *2.SR协议(Selective Repeat) 选择重传协议:
      1)特点
        发送方(Ws>1)缓存能力高,可以在未接到确认前连续发送多个分组;
        接收方(Wr>1)缓存能力高,对每个正确接收的分组进行 逐个确认,
        让发送方仅重传那些 未被确认接收 的分组;

      2)SR发送方响应事件:
       #1.上层调用,请求发送数据
       #2.定时器超时,SR协议在发送方对每个已发送的分组进行计时;
       #3.接收确认: 收到ACKn,SR协议采取 逐个确认 方式

       发送窗口Ws>1,接收窗口Wr>1,发送方重传未被接收方确认的分组;
       发送方:|1|2|3| 4 5 6  7 8 9 10
       接收方: ① ② ③ |4|5|6| 7 8 9 10 只接收 4 5 6 返回ACK4,ACK5,AKC6
       发送方: ① ② ③ |4|5|6| 7 8 9 10 向右滑动
       接收方: ① ② ③  ④ ⑤ ⑥ |7|8|9|10 直接收 7 8 9 返回ACK7,ACK8,ACK9

    无论是停-等协议,GBN协议, 还是SR协议,其信道利用率都与发送窗口大小有关:
    /**
     * 信道利用率:
     * Ws:    发送窗口的大小
     * t(Seg):发送方发送报文段的时间;
     * t(ACK):接收方发送ACK的时间;
     */
    U(sender)=(Ws•t(Seg))/(t(Seg)+RTT+t(ACK))

