org/计算机网络原理笔记.org
** UDP(用户数据报协议 User Datagram Protocol)
 0.是Internet传输层协议:提供无连接、不可靠、数据报尽力传输服务;
 1.UDP特点
   1>应用进程 容易控制 发送什么数据及何时发送,会出现分组的 丢失 和 重复;
   2>无需建立连接;
   3>无连接状态;
   4>首部开销小,只有8个字节;

 2.UDP数据报结构
                   0       15          31
                   |        |          |
   ----------------+-------------------+
                   |源端口号 |目的端口号 |
        UDP首部    +---------+----------+
                   |长度     | 校验和   |
   ----------------+-------------------+
      UDP数据字段   |   应用层数据占用   |
   ------------------------------------+

   UDP首部四个字段：每个字段长度都是2字节，共8个字节。
   源端口号和目的端口号：用于UDP实现复用和分解
   长度：指示UDP报文段中的字节数（首部和数据的总和）。首部(8个)+数据(应用数据长度);
   校验和：接收方使用来检测数据报是否出现差错,没有时全填0,求出校验和后替换;

 3.UDP校验和
  1>作用:提供差错检测功能,即检测UDP报文段从 源到目的地传送过程中,数据是否发生了改变;

  2>UDP校验和计算的内容包括3部分: UDP伪首部、UDP首部、应用数据
              0           7           15                        31
              |           |           |                          |
    +---------+--------------------------------------------------+
    |         |                    源IP地址                       |
    |UDP伪首部 |--------------------------------------------------+
    |只用校验和|                   目的IP地址                      |
    |不在报文段|--------------------------------------------------+
    |         |     全0   | 协议号(17) |        UDP长度           |
    +---------+--------------------------------------------------+
    |         |          源端口号      |      目的端口号           |
    | UDP首部  |--------------------------------------------------+
    |         |           长度        |        校验和              |
    +-------------------------------------------------------------+
    |UDP数据字段| 应用层数据,填充(没有全是0) 16位对齐                 |
    --------------------------------------------------------------+

    源IP地址、目的IP地址、协议号: 对应封装UDP数据报的IP分组的字段;
    UDP长度字段:是该UDP数据报的字段,该字段参与计算两次(伪首部和首部);
    UDP协议号:17;

  3>UDP校验和计算规则
   *1.所有参与运算的内容 按 16位 对齐求和;(求数值和)

   *2.求和过程中遇到 溢出(即进位)都被 回卷(即进位与和的最低位再相加),(溢出回卷)
      得到的和取反码(1,0互换),就是UDP的校验和,填入UDP数据报的校验和字段;(求反码)

   *3.UDP在生成校验和时,校验和字段全取0,待算出校验和后赋值给UDP首部校验和字段

  4>UDP计算校验和 示例
    数值1:0110 0110 0110 0000;
    数值2:0101 0101 0101 0101;
    数值3:1000 1111 0000 1100;

   *1.第一步: 求3个数的和(16位)
       0110 0110 0110 0000
     + 0101 0101 0101 0101
     = 1011 1011 1011 0101
     + 1000 1111 0000 1100
     =10100 1010 1100 0001

   *2.第二步: 溢出回卷
       0100 1010 1100 0001
      +                  1
      =0100 1010 1100 0010

   *3.求反码(0变1,1变0)
                0100 1010 1100 0010
      按位取反码:
      校验和:    1011 0101 0011 1101

