org/计算机网络原理笔记.org
** TCP(传输控制协议 Transfer Control Protocol)
 1.TCP报文结构(选择,填空)
  1>传输控制协议(TCP):Internet传输层协议,提供面向连接、可靠、有序、字节流传输服务;
    *1.应用进程先建立连接;(面向连接)
    *2.每一条TCP连接只有两个端点;
    *3.可靠交付: 无差错, 不丢失, 不重复, 按序到达;
    *4.全双工通信  (全双工:通信双方可 同时 传输及接收数据;半双工(对讲机),单工(广播))
    *5.面向字节流; 流:字节序列,应用程序和TCP的交互是一个个数据块,TCP把他们看做无结构字节流;

  2>TCP报文结构

              0                        15                        31
              |                        |                          | 每行 32位,4字节
    +---------+---------------------------------------------------+
    |         |       源端口号          │      目的端口号           | 分解复用
    |         |--------------------------------------------------+\
    |         |      序号(seq) (对每个应用层数据的每个字节进行编号)  |
    |         |---------------------------------------------------+
    |         |      确认序号(ack_seq)(接收方期望接收客户数据序号)   |   前5行
    | TCP首部 |---------------------------------------------------+  固定首部
    |         | 首部 | 保留  |U|A|P|R|S|F|                         |  20个字节
    |         | 长度 | 占6位 |R|C|S|S|Y|I|        接收窗口          |
    |         |单位4B| 全取0 |G|K|H|T|N|N|                         |
    |         |---------------------------------------------------+
    |         |          检验和          |        紧急指针         |/
    |         |---------------------------------------------------+
    |         |              选项(长度可变)                | 填充  | 可选首部
    +-------------------------------------------------------------+
    | TCP数据 |        应用层数据,填充(全是0) 16位对齐               |
    --------------------------------------------------------------+

   1)源端口号字段,目的端口号字段:各占16位,用于分解和复用来自或送到上层应用的数据
   2)序号字段: TCP的序号是对每个应用层数据的 每一个字节 进行编号;占32位,
   3)确认序号字段:接收方 期望 从对方 接收数据的字节,即该序号对应字节尚未收到;占32位,

   4)首部长度:占4位(1111->15: 5~15), 用于指出TCP段的首部长度,以 4字节 为计算单位;
     例:首部长度为15,则TCP首部长度为15×4=60字节,固定长度为20字节,数据长度为40字节

   5)保留字段:保留位今后使用,目前值为0; 占6位,

   6)标志位字段(各占1位,共6位,取值0或1)
     URG:紧急URG=1,紧急指针字段有效,优先传送;
     ACK:确认ACK=1,确认序号字段有效,ACK=0时,确认序号字段无效;
     PSH:推送PSH=1,尽快将报文段中的数据交付接收应用进程,不要等缓存满了在交付;
     RST:重置RST=1,TCP连接出现严重差错,释放连接,在重新建立TCP连接;
     SYN:同步SYN=1,建立新连接请求控制段 或 同意建立新连接的确认段;
     FIN:终止FIN=1,TCP报文段的发送端数据已经发送完毕,请求释放连接;

   7)接收窗口字段:向对方通告我方接收窗口的大小,占16位;
   8)校验和字段:计算方法与UDP相同,协议号是6,占16位;
   9)紧急指针:URG=1时,才有效,指出在本TCP报文段中紧急数据共有多少个字节;
   10)选项字段(长度可变):最短为0字节,最长为40个字节;
      例如:发送方告诉接收方其缓存能够接收的数据段的最大长度是MSS个字节;//不包括首部
      最长报文长度(Maximum Segment Size,MSS):报文段中封装的应用层数据的最大长度(1480);

   11)填充字段:取值全为0,目的是为了整个首部长度是4字节的整数倍;

 2.TCP连接管理(三次握手与四次挥手)
  以客户端的一个应用进程与服务器上的一个应用进程建立一条TCP连接为例;

  1>连接建立(三次握手)

     客户端                         服务器
                                  ┌───────────┐
                                  │  CLOSED   │
     ┌────────┐                   ├───────────┤
     │ CLOSED │  SYN=1, seq=x     │  LISTEN   │ 第一次握手(SYN段)
     └────────┘------------------>│(服务器独有)│
     ┌────────┐<------------------├───────────┤
     │SYN_SENT│  SYN=1,ACK=1      │           │ 第二次握手(SYNACK段)
     └────────┘•seq=y,ack_seq=x+1 │           │
                    •             │ SYN_RCVD  │
     ┌───────────┐         •      │           │
     │ESTABLISHED│ ACK=1,seq=x+1•>├───────────┤ 第三次握手(可携带数据)
     └───────────┘ ack_seq=y+1    │ESTABLISHED│
                                  └───────────┘

   *1.第一次握手 (发起连接请求):
      客户端向服务器发送连接请求报文:SYN报文段(SYN=1,seq=x);
      SYN=1:建立连接请求控制段,
      seq=x:表示传输的报文段的第1个数据字节的序号是x,
      并以此代表整个报文段的序号(sequence number,序号)
      客户端进度SYN_SEND(同步发送);
      此时服务器知道客户端能发

   *2.第二次握手 (返回确认,同意建立连接):
      服务器收到TCP连接请求后,如同意,则返回确认报文段:
      (SYN=1,ACK=1,seq=y,ack_seq=x+1)
      SYN=1：同意建立新连接的确认段
      ack_seq=x+1：表示已经收到了序列号为 x 的报文段，准备接收序列号为 x+1 的报文段。
      seq=y：服务器告诉客户确认报文段的第 1 个数据字节的序列号是 y。
      服务器由 LISTEN 进入 SYN_RCVD（同步收到）
      此时客户端知道服务器能发能收

   *3.第三次握手 (返回确认,建立连接):只有第三次握手可携带收据
      客户对服务器的 同意连接报文段 进行确认:
      (ACK=1,seq=x+1,ack_seq=y+1)
      seq=x+1：客户传输的报文段的第一个数据字节的序列号是 x+1
      ack_seq=y+1：客户期望接收服务器序列号为 y+1 的报文段。
      当客户端发送ACK时,客户端进入ESTABLISHED(已连接)状态;
      当服务器收到ACK时,也进入ESTABLISHED(已连接)状态;
      此时服务器知道客户端能收;

   *为什么需要三次握手？
    第一次握手：客户发送请求，此时服务器知道客户能发。
    第二次握手：服务器发送确认，此时客户知道服务器能发能收。
    第三次握手：客户发送确认，此时服务器知道客户能收

  2>连接拆除(四次挥手)

     客户端                                       服务器
   ┌───────────┐                              ┌───────────┐
   │ESTABLISHED│         FIN=1,seq=u          │           │
   ├───────────┤----------------------------->│ESTABLISHED│
   │FIN_WAIT_1 │  ACK=1,seq=v,ack_seq=u+1     │           │
   ├───────────┤<-----------------------------├───────────┤
   │FIN_WAIT_2 │ FIN=1,ACK=1,seq=w,ack_seq=u+1│CLOSE_WAIT │
   ├───────────┤<-----------------------------└───────────┘
   │ TIME_WAIT │•                             ┌───────────┐
   ├───────────┤     •                        │ LAST_ACK  │
   │  CLOSED   │ ACK=1,seq=u+1,ack_seq=w+1    └───────────┘
   └───────────┘                 •            ┌───────────┐
                                              │  CLOSED   │
                                            •>└───────────┘
  *1.第一次挥手 (客户端发送断开连接请求):
    客户端向服务器发送释放连接报文段:(FIN=1,seq=u)
    FIN=1:发送端数据发送完毕,请求释放连接;
    seq=u:传输的第一个数据字节的序号是u;
    客户端状态由ESTABLISHED进入FIN_WAIT_1(终止等待1状态)

  *2.第二次挥手 (服务器确认,数据还没传完,继续发送):
    服务器向客户端发送确认段:(ACK=1,seq=v,ack_seq=u+1);
    ACK=1:确认字号段有效;
    ack_seq=u+1:服务器期望收到数据序号u+1;
    seq=v:服务器传输的数据序号v;
    服务器状态由 ESTABLISHED状态 进入 CLOSE_WAIT(等待关闭)
    客户端状态由 FIN_WAIT_1 进入 FIN_WAIT_2;

  *3.第三次挥手 (服务器数据发送完毕,同意断连):
    服务器向客户端发送释放连接报文段:(FIN=1,ACK=1,seq=w,ack_seq=u+1);
    FIN=1:请求释放连接;
    ACK=1:确认字号段有效;
    ack_seq=u+1:服务器期望收到客户数据序号u+1;
    seq=w:表示服务器传输的第一个数据字节的序号是w;
    服务器状态由 CLOSE_WAIT(等待关闭) 进入 LAST_ACK(最后确认状态);

  *4.第四次挥手 (两端确认断开连接):
    客户端向服务器发送确认段:(ACK=1,seq=u+1,ack_seq=w+1);
    ACK=1:确认字号段有效;
    ack_seq=w+1：表示客户期望接收服务器数据序号为w+1。
    seq=u+1:表示客户传输的数据的序号是u+1;
    客户端状态由 FIN_WAIT_2 进入TIME_WAIT(等待2MSL时间),进入CLOSED;
    服务器在收到最后一次ACK后,由LAST_ACK 进入 CLOSED;

 3.TCP可靠数据传输
  1>TCP实现可靠数据传输服务的工作机制:
   1)应用层数据被 分割成 TCP认为最适合发送的数据块; (因为数据链路层只能接收1500字节)
   2)TCP发出一个段后,启动一个 计时器,等待目的端确认收到这个报文段;
   3)TCP首部中设有 校验和字段, 用于检测数据在传输过程中是否发生差错;
   4)TCP报文段到目的端可能会失序,TCP会 重新排序;
   5)接收端收到重复的报文段,接收端根据序号把重复的报文段 丢弃;
   6)TCP提供流量控制;

   文件:6  5  4 3 2 1
       12 11 10 9 8 7

   TCP缓存 6 5 4 3 2 1         TCP缓存| | | | |2|1|
          │     2|1|首部|                    ↑
          └─────────────────────────────────┘
       发送方                              接收方

   可靠:保证接收方应用进程从缓冲区读出的字节流与发送方发出的字节流是完全一样的;
   1)校验:与UDP一样; $1 序号字段指一个报文段第一个字节的序号(图中序号为1);
   2)序号:发送方对发送的数据包进行编号,1字节占用1序号,确保数据按序提交给接收方; $1
   3)确认:TCP采用累积确认,此时返回确认序号为3; $2
   4)差错检测:利用差错编码实现数据报传输过程中的比特差错检测(甚至纠正);
   5)快速重传:TCP发送方接收到对相同序号的3次重复ACK,即被重复确认的报文段已丢失,即使无超时,也需重发该报文段;
   6)计时器:计时器超时时间的调整,解决数据丢失问题;
     超时时间策略:
     //超时间隔=抽样RTT的加权移动平均值+4×偏差RTT
     TimeoutInterval=EstimatedRTT+4*DevRTT;
     //SampleRTT:抽样RTT,指数加权移动平均, α指数加权系数,典型值为0.125;
     EstimatedRTT=(1-α)•EstimatedRTT+α•SampleRTT;
     //DevRTT:偏差RTT,RTT变化剧烈,网络不稳定,反之稳定; 加权系数β:推荐值0.25;
     DevRTT=(1-β)•DevRTT+β•|SampleRTT-EstimatedRTT|
     TCP的发送方在规定时间内没有收到确认就要重传已发送的报文;
     TCP协议用于控制数据段是否重传的依据是设立重发定时器;

   $2.TCP生成ACK的策略
   *1.具有所期望序号的报文段按序到达,所有在期望序号以及之前的报文段都已被确认,TCP延迟500ms发送ACK;
      示例:接收方收到1,2,3,且返回对1,2,3的确认,此时4来了,则接收方等待500ms,再返回ACK5

   *2.具有所期望序号的报文段按序到达,且另一个按序报文段在等待ACK传输,TCP接收方立即发送单个累计ACK,
      确认以上两个按序到达报文段;
      示例:接收方刚刚接收到4,正准备返回ACK5,此时5来了,则接收方返回ACK6;

   *3.拥有序号大于期望序号的失序报文段到达,TCP接收方立即发送重复ACK(3次),指示下一个期望接收字节的序号;
      示例:接收方返回ACK5,但6到了,则接收方返回三次重复的ACK5;

   *4.接收一个报文段,部分或完全填充接收数据间隔;
      接收方收到1,2,且返回对1,2的确认,后来又收到4,5,6,此时3来了,则接收方返回ACK7;


