public/计算机网络原理笔记.html


<div id="outline-container-orgf98cd96" class="outline-3">
<h3 id="orgf98cd96">TCP流量控制(选择,填空)</h3>
<div class="outline-text-3" id="text-orgf98cd96">
<p>
流量控制:
~*1.协调发送方与接收方的 数据发送 与 接收速度;
*2.在通信过程中,接收方设置报文段的 接收窗口字段 来将窗口大小通知给发送方,实现流量控制;
</p>
</div>
</div>

<div id="outline-container-org7e34e11" class="outline-3">
<h3 id="org7e34e11">TCP拥塞控制(综合题)</h3>
<div class="outline-text-3" id="text-org7e34e11">
<p>
0&gt;网络拥塞:
  太多的主机以太快的速度向网络中发送太多的数据,超出了网络处理能力,
  导致大量数据分组拥挤在中间设备队列中等待转发,网络性能显著下降的现象;
</p>

<p>
1&gt;拥塞控制:
   通过合理调度,规范,调整向网络中发送数据的 主机数量、
   发送速率、数据量 以避免拥塞或消除已发生的拥塞;
   拥塞窗口:在连接建立时发送方一次可以发送几个分组,窗口大小随RTT的变化而变化;
</p>

<p>
2&gt;拥塞控制的算法:
  *1.慢启动
  *2.拥塞避免
  *3.快速重传
  *4.快速恢复
</p>

<p>
窗口大小(MSS)
   ↑                     窗口大小值
 24|                         •
 22|                   •
 20|               •      拥塞避免阶段
 18|           •  阈值之后的阶段称为 拥塞避免阶段,
 16|阈值     •    每经过一个RTT,拥塞窗口大小增加加1MSS;
 14|        •
 12|       •
 10|      •                          窗口机制
  8|     •   ↖                      阈值(Threshold):临界值;初始值一般为:16MSS
  6|    •   慢启动阶段                拥塞窗口(CongWin):初始值为1MSS; 1个最大报文段长度;
  4|  • 阈值之前的阶段称为 慢启动阶段,  |1|2 3 4 5 6 7 8 9 10 拥塞窗口,初始值为1;
  1•   每经过一个RTT,拥塞窗口大小加倍; 1|2|3|4 5 6 7 8 9 10 经过RTT时间,窗口增大一倍;
  0-------------------------&#x2013;&#x2014;&gt;时间(RTT)
    1  2  3  4 5 6 7 8 9 10 11 12
</p>


<p>
3&gt;拥塞判断与窗口调节
 1)三次重复确认(报文段丢失)
  *0.收到三次重复确认,可判定拥塞不严重;
  *1.快速重传:
    接收端收到3次重复确认,则推断被重复确认的报文段已丢失,则立即发送被重复确认的报文段;
</p>

<p>
*2.快速恢复:
  当发生3次重复确认时,不再重新从慢启动阶段开始,而是直接从新阈值开始,直接进入拥塞避免阶段;
  操作:
  新阈值(12)=当前窗口(24)的一半,
  新拥塞窗口=新阈值=12;
  从拥塞避免阶段开始增加窗口数量;
</p>

<p>
窗口大小
 (MSS)
   ↑
 24|                         •
 22|                   •
 20|               •          •
 18|           •   拥塞避免阶段   新阈值
 16|阈值     •                  •         •
 14|        •                        •
 12|新阈值 •                      • 拥塞避免阶段
 10|      •
  8|     •   慢启动阶段
  6|    •
  4|  •
  1•
  0-------------------------------------------------------&#x2013;&#x2014;&gt;时间(RTT)
    1  2  3  4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22
</p>

<p>
2)计时器超时(报文段丢失)
  计时器超时时,可判定发生拥塞,且拥塞严重;
  操作:
  发生计时器超时时,新阈值是当前拥塞窗口的一半;
  新拥塞窗口大小下降为1MSS;
  新阈值(12)=当前拥塞窗口(24)的一半,
  新拥塞窗口=1
  然后再从慢启动阶段、拥塞避免阶段增加窗口数量;
  慢启动:1~12:1,2,4,8,12;
  拥塞避免阶段:13,14,&#x2026;;
</p>

<p>
窗口大小
 (MSS)
   ↑
 24|                         •
 22|                   •
 20|               •          •
 18|           •   拥塞避免阶段
 16|阈值     •                •             •
 14|        •                •         •  拥塞避免阶段
 12|新阈值 •                  •     •
 10|      •                  •     •
  8|     •   慢启动阶段       •    •
  6|    •                    •   • 慢启动阶段
  4|  •                      • •
  1•                         • 1MSS
  0-------------------------------------------------------&#x2013;&#x2014;&gt;时间(RTT)
    1  2  3  4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22
</p>

<p>
3)窗口调整的基本策略AIMD(Additive Increase,Multiplicative Decrease)
  *1.网络未发生拥塞时,逐渐"加性"增大窗口;
  *2.网络拥塞时"乘性"减小窗口;
</p>

<p>
4)拥塞控制的分类
  *1.拥塞消除策略:先拥塞检测,再采取措施;
  *2.拥塞预防策略:流量整形技术,规范主机向网络发送数据的流量
</p>

<p>
示例:下图是某通信过程中拥塞窗口RTT的变化过程,请回答如下问题:
  窗口大小
   (MSS)                    1)在第一个慢启动阶段拥塞窗口的阈值是多少? 答:阈值为:16MSS;
     ↑                      2)说明该过程中哪些时间段为慢启动阶段? 0-4RTT和17-20RTT;
   22|                   •  3)第10个RTT时,发生了什么事件? 答:三次重复确认事件;
   21|                 •  • 4)第16个RTT时,发生了什么事件? 答:计时器超时事件;
   20|               •
   19|             •       •
   18|           •
   17|         •            •               •
   16|       •               •           •   •
   15|                       •        •       •
   14|      •                •     •          •
   13|      •                •  •             •
   12|      •                •                •                     •
   11|      •                                 •                  •
   10|      •                                 •               •
    9|      •                                 •            •
    8|     •                                  •         •
    7|                                        •         •
    6|    •                                   •        •
    5|                                        •       •
    4|   •                                    •      •
    3|  •                                     •    •
    2| •                                      •  •
    1•                                        •
    0---------------------------------------------------------------&#x2013;&#x2014;&gt; 时间(RTT)
       1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26
</p>

<p>
例2.图展示了TCP Reno 拥塞控制算法中拥塞窗口的变化情况,请参照该示意图回答一下问题;
</p>

<p>
cwnd
  ↑         A
</p>
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">•           C</td>
</tr>

<tr>
<td class="org-left">• ⊹          ⊹           E</td>
</tr>

<tr>
<td class="org-left">•  ⊹    ⊹     •        •  •               ⊹</td>
</tr>

<tr>
<td class="org-left">•  B⊹          •   •       ⊹    G    ⊹</td>
</tr>

<tr>
<td class="org-left">S   •             D •           ⊹    ⊹</td>
</tr>

<tr>
<td class="org-left">•                             ⊹   ⊹</td>
</tr>
</tbody>
</table>
<p>
•                                F⊹
└----------------------------------------&#x2013;&#x2014;&gt;time
</p>

<p>
1)图中SA、BC 和 FG分别是拥塞控制中的哪个阶段?
  答:SA:慢启动阶段, BC:拥塞避免阶段, FG:慢启动阶段;
</p>

<p>
2)结点A、C、E、G处引起cwnd变化的原因分别是什么?
  答:A和C:发生三次重复确认事件,分组丢失,执行快速恢复算法;
     E:发生计时器超时事件,未收到分组,执行慢启动算法;
     G:达到了拥塞窗口的阈值,改变阈值增大策略,即将开始执行拥塞避免算法;
</p>

<p>
3)若图中A和C处的高度是一样的,那么B和D两点的阈值有什么关系?
  答: B点与D点阈值相等
</p>

<p>
4)假设这个网络中只存在一个TCP连接,这个TCP连接的速度是否仍要不停地改变?
  答:需要不停改变,由于网络拥塞普遍存在,需要要实施拥塞控制,所以TCP连接的速度仍需视情况不断改变;
</p>
</div>
</div>
</div>

<div id="outline-container-org23a7128" class="outline-2">
<h2 id="org23a7128">第四章 网络层</h2>
<div class="outline-text-2" id="text-org23a7128">
</div>
<div id="outline-container-orgeafabd3" class="outline-3">
<h3 id="orgeafabd3">网络层服务</h3>
<div class="outline-text-3" id="text-orgeafabd3">
<p>
0.网络层是网络核心的最高层,是实现大型网络互连的关键,是网络体系结构中最重要的一层;
</p>

<p>
1.网络层 核心任务
  将数据从源主机送达目的主机;
</p>

<p>
2.网络层 主要功能(转路连)
  1&gt;转发
    路由器在收到IP数据报时,会利用IP数据报的目的IP地址检索匹配路由表,如果路由表中没有匹配成功的路由项
    则通过默认路由对应的接口转发该IP数据报,如果除默认路由外,有一条路由项匹配成功,则选择该路由项对应的
    接口转发该IP数据报,如果除默认路由外,有多条路由项匹配成功,则选择 网络前缀匹配成功位数最长 的路由项,
    通过该路由项指定接口转发该IP数据报;
</p>

<p>
2&gt;路由选择
  当分组从源主机流向目的主机时,必须通过某种方式决定分组经过的路由或路径;
</p>

<p>
3&gt;连接建立
  网络层连接是从源主机到目的主机经过的一条路径,这条路径所经过
  的每个路由器等网络设备都要参与网络层连接的建立;
</p>

<p>
                   路由选择
   输入端口            ↕           输入端口
-&gt; |1|2|3| -&gt;       转发表      -&gt; |1|2|3| -&gt;
               目的地址|输出链路
   &#x2026;&#x2026;        地址1    3
                 &#x2026;     &#x2026;
                 地址4    1
 -&gt; |4|5|6| -&gt;     路 由 器     -&gt; |4|5|6| -&gt;
                     转发
</p>
</div>
</div>
