public/计算机网络原理笔记.html

<div id="outline-container-orgdd01856" class="outline-3">
<h3 id="orgdd01856">数据报网络与虚电路网络</h3>
<div class="outline-text-3" id="text-orgdd01856">
<p>
0.根据是否在网络层提供连接服务,分组交换网络可分为:
  在网络层提供连接服务的 虚电路网络(Virtual-Circuit,VC);
  在网络层提供无连接服务的 数据报网络(datagram network);
</p>

<p>
1.数据报网络(无连接服务)
  1&gt;数据报网络是指 按照 目的主机地址 进行路由选择的网络;
    源主机每发送一个分组,就为该分组加上 目的主机地址, 然后将该
    分组推进网络,每个路由器使用分组的 目的主机地址 来转发该分组;
</p>

<p>
2.虚电路网络
  1&gt;虚电路(virtual circuit,VC):
    是指源主机到目的主机的一条路径上建立的一条网络层逻辑连接;
</p>

<p>
2&gt;虚电路网络:
  指在网络层提供面向连接的分组交换服务,双方通信前先虚电路建立连接,通信结束后在拆除连接;
</p>

<p>
3&gt;一条虚电路由3个要素构成:
  1)从源主机到目的主机之间的一条路径(一系列的链路和分组交换机)
  2)该路径上的每条链路的 虚电路标识(VCID)
  3)分组交换机的转发表中记录虚电路标识的 接续 关系;
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">输入接口</td>
<td class="org-left">输入VCID</td>
<td class="org-left">输出接口</td>
<td class="org-left">输出VCID</td>
</tr>
</tbody>
</table>

<p>
4&gt;数据报网络 与 虚电路网络 对比表
</p>
<p>
<del>-----------</del>-------------------------<del>---------------------------</del>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">项目</td>
<td class="org-left">虚电路网络</td>
<td class="org-left">数据报网络</td>
</tr>
</tbody>
</table>
<p>
<del>-----------</del>-------------------------<del>---------------------------</del>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">是否建立连接</td>
<td class="org-left">先建立连接</td>
<td class="org-left">不建立连接</td>
</tr>
</tbody>
</table>
<p>
<del>-----------</del>-------------------------<del>---------------------------</del>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">地址</td>
<td class="org-left">每个分组含有一个短的虚电路号</td>
<td class="org-left">每个分组包含源地址和目的端地址</td>
<td class="org-left">源IP地址, 目的IP地址</td>
</tr>
</tbody>
</table>
<p>
<del>-----------</del>-------------------------<del>---------------------------</del>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">分组顺序</td>
<td class="org-left">按序发送, 按序接收</td>
<td class="org-left">按序发送, 不一定按序接收</td>
</tr>
</tbody>
</table>
<p>
<del>-----------</del>-------------------------<del>---------------------------</del>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">路由选择</td>
<td class="org-left">建立VC时需路由选择,之后</td>
<td class="org-left">每个分组独立路由选择</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">所有分组均沿此路由转发;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<p>
<del>-----------</del>-------------------------<del>---------------------------</del>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">典型网络</td>
<td class="org-left">X.25、帧中继、ATM</td>
<td class="org-left">因特网(Internet)</td>
</tr>
</tbody>
</table>
<p>
<del>-----------</del>-------------------------<del>---------------------------</del>
*.ATM网络在信元交换前必须建立 虚拟 连接;
</p>
</div>
</div>

<div id="outline-container-org24257a3" class="outline-3">
<h3 id="org24257a3">网络互连与网络互连设备</h3>
<div class="outline-text-3" id="text-org24257a3">
<p>
1.异构网络互连
 1&gt;异构网络:
   主要是指两个网络的通信技术和运行的协议不同,例如:WiFi和网线;
</p>

<p>
2&gt;实现异构网络互连的基本策略(协议转换 和 构建虚拟互联网络)
 *1.协议转换:
    采用一类支持异构网络之间协议转换的网络中间设备,
    来实现异构网络数据分组的转换与转发;
    例如:交换机或 多协议路由器;
</p>

<p>
*2.构建虚拟互联网络
   在异构网络的基础上构建一个同构的虚拟互联网络;
</p>

<p>
3&gt;实现 同构网络 互连的典型技术: 隧道技术;
</p>

<p>
2.路由器
 1&gt;最典型的网络层设备
   具有多个输入端口 和 多个输出端口的专用计算机,
   主要任务就是 获取与维护 路由信息 以及 转发分组;
</p>

<p>
2&gt;路由器从功能体系结构角度(输入,输出,交换,处理):
  *1.输入端口:查找,转发,到达分组 缓存排队功能;
             线路端接收信号-&gt;数据链路处理(协议封装)-&gt;查找,转发排队-&gt;交换结构;
</p>

<p>
*2.交换结构:完成具体的转发工作,将输入端口的IP数据报交换到指定的输出端口;
           主要包括: 基于内存交换(性能低,价低),
                    基于总线交换(独占式),
                    基于网络交换(性能高,价高);
</p>

<p>
*3.输出端口:缓存排队,从队列中取出分组进行数据链路层数据帧的封装,发送;
           1.先到先服务(FCFS)调度策略;(通常)
           2.优先级调度,按IP数据报的服务类型调度;
           交换结构-&gt;排队,缓存管理-&gt;数据链路处理(协议封装)-&gt;线路端接-&gt;
</p>

<p>
*4.路由处理器: 1)执行命令, 2)路由协议运行, 3)路由计算以及路由表的更新和维护
</p>
</div>
</div>


<div id="outline-container-org9cbef3e" class="outline-3">
<h3 id="org9cbef3e">网络层拥塞控制</h3>
<div class="outline-text-3" id="text-org9cbef3e">
<p>
1.网络拥塞(选择,填空)
 1&gt;拥塞:
   一种持续过载的网络状态,用户对网络资源(包括链路带宽、
   存储空间和处理器处理能力等)的总需求 超过了网络固有的容量;
</p>

<p>
吞吐量吞吐量
  ↑                     |               响应时间
Q2|----------------&#x2013;&#x2014;•                   ↑                     •
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">•</td>
<td class="org-left">•</td>
<td class="org-left">•</td>
</tr>

<tr>
<td class="org-left">•</td>
<td class="org-left">•</td>
<td class="org-left">•</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">•</td>
<td class="org-left">•</td>
<td class="org-left">•</td>
</tr>
</tbody>
</table>
<p>
Q1|--&#x2013;&#x2014;•             |   •               |         |       |  •
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">•</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">•</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">•</td>
</tr>

<tr>
<td class="org-left">•</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">•           t2</td>
<td class="org-left">------------&#x2013;&#x2014;•</td>
</tr>

<tr>
<td class="org-left">•</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">•</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">•</td>
</tr>

<tr>
<td class="org-left">•</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">•</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">•</td>
</tr>

<tr>
<td class="org-left">•</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">•        t1</td>
<td class="org-left">----&#x2013;&#x2014;•</td>
</tr>

<tr>
<td class="org-left">•</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">•</td>
<td class="org-left">•</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">•</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">•</td>
<td class="org-left">•</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<p>
0--&#x2013;&#x2014;┴--------&#x2013;&#x2014;┴------&#x2013;&#x2014;•&#x2013;&gt;    0----&#x2013;&#x2014;┴--&#x2013;&#x2014;┴-----&#x2013;&#x2014;&gt;
       膝点          崖点            负载           膝点    崖点        负载
</p>

<p>
2&gt;网络负载在 膝点 附近时,吞吐量 和 分组平均延迟达到理想的平衡,网络的使用率最高;(t1=t2, Q1(膝点)&gt;Q2(崖点))
</p>

<p>
3&gt;发生拥塞的原因(三有限,一故障)
  *1.缓冲区容量有限;
  *2.传输线路的带宽有限;
  *3.网络结点的处理能力有限;
  *4.网络中某些部分发生了故障;
</p>

<p>
4&gt;网络层拥塞控制措施(4条)(选择填空)
  *1.流量感知路由:
     网络抽象为一张带权无向图,路由器抽象为图的结点,链路抽象为图的边,每一条链路有自己的链路费用
     权值根据网络负载动态调整,则可将网络流量引导到不同的链路上,均衡网络负载,从而延缓或避免拥塞的发生;
                       区域一             区域二
                       ┌───────────┐  ┌─────────┐
                       │      B.   │  │         │
                       │     / |  .│10│         │
                       │    /  |   │  .         │  带权无向图
                       │   A   |   │  │   .E    │ 时延小=权值小
                       │     \ |   │  │   /  \  │
                       │       C---<del>--</del>&#x2013;D   F  │
                       └───────────┘20└─────────┘
</p>

<p>
*2.准入控制: 是对新建虚电路审核,如果新建立的虚电路会导致网络变得拥塞,那么网络拒绝建立新虚电路;
</p>

<p>
*3.流量调节: 在网络拥塞时,可以通过调整发送方的发送数据的速率来消除拥塞; ICMP报文↓
            抑制分组:感知到拥塞的路由选择一个被拥塞的数据报,给该数据报的源主机返回一个抑制分组;
            背压: 抑制分组在从拥塞结点到源结点的路径上的每一跳(结点间直接链路),都发挥抑制作用;
</p>

<p>
  *4.负载脱落: 通过有选择地主动 丢弃一些数据报,来减轻网络负载,从而缓解或消除拥塞;
              从最大的开始丢,例如 |6|5|4|3|2|1| 先丢6;
简述网络拥塞解决的两个方面
</p>
<p>
<del>--------------------</del>------------------------------------------------------------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">增加网络资源(拥塞预防)</td>
<td class="org-left">在网络出现拥塞前为网络中的各个结点分配更多可用的资源,从而降低拥塞出现的可能性</td>
</tr>
</tbody>
</table>
<p>
<del>--------------------</del>------------------------------------------------------------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">减小网络负载(拥塞消除)</td>
<td class="org-left">指在网络中已出现负载大于资源的情况下,通过减小当前网络的负载劳实现对拥塞的消除</td>
</tr>
</tbody>
</table>
<p>
<del>--------------------</del>------------------------------------------------------------------&#x2013;&#x2014;+
</p>

<p>
流量控制和拥塞控制的区别
</p>
<p>
<del>-------</del>----------------------------------------------<del>--------------------------------------</del>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">拥塞控制</td>
<td class="org-left">考虑系统间的网络环境,使网络负载不超过网络传送能力</td>
<td class="org-left">确保网络能够承载所到达的流量</td>
</tr>
</tbody>
</table>
<p>
<del>-------</del>----------------------------------------------<del>--------------------------------------</del>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">流量控制</td>
<td class="org-left">考虑接收端数据接收处理能力,使发送速率不超过接收能力</td>
<td class="org-left">只与特定的发送方和接收方间的点到点流量有关</td>
</tr>
</tbody>
</table>
<p>
<del>-------</del>----------------------------------------------<del>--------------------------------------</del>
</p>
</div>
</div>
