org/计算机网络原理笔记.org
** Internet网络层
 0.Internet网络层主要协议
   1>网际协议(Internet Protocol,IP)
   2>路由协议
   3>互联网控制报文协议(Internet Control Message Protocol,ICMP)

 1.IPv4协议(网络层最核心的协议)
   1>定义了如何封装上层协议(如UDP、TCP)的报文段;
     定义了Internet网络层寻址(IP地址)以及如何转发IP数据报等内容;
     IP目前前两个版本:IPv4(32位) 和 IPv6(128位);

     IP对输入数据报的处理分为主机对数据报的处理和网关对数据报的处理;

   2>IPv4数据报格式
    ┌-----------------------------32位----------------------------┐
    |-------------------------------------------------------------+
    |版本(4位)|首部长度(4位)|区分服务(8)|      数据报长度(16位)      |4B\
    |-------------------------------------------------------------+   |
    |          标识(16位)           |标志(3位)|    片偏移量(13位)   |4B |
    |-------------------------------------------------------------+   |
    | 生存时间(8位)  | 上层协议(8位) |        首部检验和(16位)       |4B  >固定首部20字节
    |-------------------------------------------------------------+   |
    |                        源IP地址(32位)                        |4B |
    |-------------------------------------------------------------+   |
    |                        目的IP地址(32位)                      |4B/
    |-------------------------------------------------------------+
    |                       选项(可选,长度可变)                     |40B 可选首部
    +-------------------------------------------------------------+
    |                              数据                            | 传输层报文段
    +-------------------------------------------------------------+
    *1.版本号(4位):IPv4(32位)、IPv6(128位);
    *2.首部长度(4位):20B-60B(字节), 单位 4字节
    *3.分区服务(8位):在旧标准中成服务类型(Type of Service,TOS) 用来指示期望获取那种类型服务;
    *4.数据报长度(16位):指出IP数据报的总字节数;(首部+数据)
    *5.生存时间(8位):表示IP数据报在网络中可以通过的路由器数(跳步数);TTL
    *6.上层协议(8位):指示该IP数据报封装的是哪个上层协议: TCP:6, UDP:17;
    *7.首部校验和(16位):利用校验和对IP数据报 首部 进行差错检测; (求和,溢出回卷,取反码)
    *8.源IP地址(32位):发出IP数据报源主机的IP地址,
    *9.目的主机地址(32位):IP数据报需送达的主机IP地址;
    *10.选项:长度可变;
    *11.数据:存放IP数据报所封装的传输层报文段;

    *12.标识(16位):
        标识一个IP数据报,每产生一个IP数据报,IP协议的计数器加1; 1号IP数据报  分片1 分片2
        在IP数据报 分片 和 重组 过程中用于标识属于同一IP数据报,2号IP数据报  分片1 分片2
        该字段不可唯一标识一个IP数据报; 要(主机IP+目的主机IP+标识位)
    *13.标志(3位):其结构如下:
         1 2 3
        ┌-┬-┬-┐ DF(Don't Fragment):禁止分片标志: DF=0,MF=0:是一个分片,且是最后一片,
        | |D|M| DF=0,允许分片, DF=1,禁止分片;    DF=0,MF=1;表示是一个分片,且不是最后一片;
        | |F|F| MF(More Fragment):更多分片标志; DF=1,MF=0;没有分片
        └-┴-┴-┘ MF=0,未被分片 或 分片的最后一片, MF=1,一定是分片,且不是最后一个;

    *14.片偏移量:
        以8B(8字节)为单位,表示一个IP数据报分片与原IP数据报数据的相对偏移量;
        该字段值为0时,且MF=1,则表示这是一个IP分片,且是第一个分片;

 3>IP数据报分片
   *1.最大传输单元(Maximum Transmission Unit,MTU):
      数据链路层帧能承载的最大数据量;(网络层要将传输层的数据报 先分组 再分片);

   *2.IP数据报分片的原则
      #1.尽可能少分片;
      #2.一个最大分片可封装的数据字节数是8的倍数;
         每个分片的标识字段复制原IP数据报的标识字段
         MF标志位,除了最后一个分片为0外,其余分片全为1;

   *3.IP数据报分片的相关计算
      原数据IP报总长度为 L字节,待转发链路的MTU为 M字节;
      最大分片封装的数据长度: d=⌊(M-20)/8⌋×8
      分片总数: n=⌈(L-20)/d⌉
      每个分片片偏移字段取值: Fi=d/8×(i-1),1≤i<n;
                           ╭d+20,1≤i<n
      每个分片的总长度: Li=<
                           ╰L-d×(n-1),i=n

                           ╭1,1≤i<n
      每个分片的MF字段: MFi=<
                           ╰0,i=n

      通过PingPlotter 工具发送一个总长度为3400字节的IP数据报,
      通过MTU=1500字节的链路转发,试求以下内容:
      第1步:每片最多可以封装多少字节的数据;
            分片包括两个部分内容(首部+数据):首部:20,数据:1500-20=1480字节
      第2步:分片数
            一片可封装的数据字节数为:1500-20=1480字节   |首部|  1  |  2  | 3 |
            IP数据报的总长度:3400字节(首部+数据)              /      |     \
            IP数据报的数据长度:3400-20=3380字节        |首部|1|  |首部|2|  |首部|3|
            分片数: 3380/1480=2.28向上取正,取 3

      第3步:标志位: DF:0 分片, MF=0(最后一片) 其余为1;

      第4步:片偏移量(单位为8字节)
            第1片:0/8=0; 第2片:1480/8=185; 第3片:2960/8=370
     +-------+------------+-----+--------+-------------------------+
     |  片   | 总长度/字节 |偏移量| MF标志 |封装原IP数据报中数据的字节流|
     +-------+------------+-----+--------+-------------------------+
     | 第1片 |    1500    |  0   |   1   |    1480字节(0-1479)      |
     +-------+------------+------+-------+-------------------------+
     | 第2片 |    1500    | 185  |   1   |    1480字节(1480-2959)   |
     +-------+------------+------+-------+-------------------------+
     | 第3片 |    440     | 370  |   0   |     420字节(2960-3379)   |
     +-------+------------+------+-------+-------------------------+
              3440=3个首部(20字节)+数据;          3380

   例2:发送一个总长度为5000字节的IP数据报,通过MTU=1500字节的链路转发,
       求:分片;每片总长度; DF、MF标志;封装原数据报中的字节数;片偏移量;
      1) 一个分片可装的最大字节数: MTU-首部=1500-20=1480字节;
         IP数据报的数据总长度: 5000-20=4980字节
         分片数:n=⌈4980/1480⌉=4;

      2)每片总长度分别为:
        第1片:1500字节;   第2片:1500字节;
        第3片:1500字节;   第4片:560字节;

      3)DF1=0,MF1=1;  DF2=0;MF2=1;  DF3=0,MF3=1;  DF4=0,MF4=0;

      4)每片封装原数据报中的字节数分别为:
        第1片:1480字节;   第2片:1480字节;
        第3片:1480字节;   第4片:540字节;

      5)第1片偏移量:0/8=0;      第2片偏移量:1480/8=185;
        第3片偏移量:2960/8=370; 第4片:偏移量:4440/8=555;
     +-------+------------+-----+------+------+--------------------------+
     |  片   | 总长度/字节 |偏移量|DF标志|MF标志 |封装原IP数据报中数据的字节流|
     +-------+------------+-----+------+------+--------------------------+
     | 第1片 |    1500    |  0  |   0  |   1   |    1480字节(0-1479)      |
     +-------+------------+-----+------+-------+-------------------------+
     | 第2片 |    1500    | 185 |   0  |   1   |    1480字节(1480-2959)   |
     +-------+------------+-----+------+-------+-------------------------+
     | 第3片 |    1500    | 370 |   0  |   1   |    1480字节(2960-4439)   |
     +-------+------------+-----+------+-------+-------------------------+
     | 第4片 |    560     | 555 |   0  |   0   |     540字节(4440-4979)   |
     +-------+------------+-----+------+-------+-------------------------+

   *路由器进行IP数据报分片后,目的主机在重组分片时,用到的字段不包括 首部长度字段
   *4.IP数据报分片在目的主机重组:
     1)根据各片首部的标识字段来判断这些分片是否属于同个IP数据报,同个IP数据报分出来的IP分片具有相同的标识字段;
     2)目的主机通过各分片首部的标志字段,可以判断某个分片是否是最后一个分片;
     3)目的主机根据各分片的片偏移字段,判断IP分片的先后顺序,综合每个IP分片首部的数据报长度字段,判断是否缺少分片;

 例题:已知IPv4数据报第1个字节和数据报长度字段内容分别为16进制数 45H 和 3FCH,求该数据报封装的数据长度;
      封装数据长度=数据报总长度-首部长度(20字节)=(3×16²+15×16+12)-20
                 =768+240+12-20=1200-20=1000字节
                 
 2.IPv4编址
  1>IPv4地址的长度为32位,共有2^32个不同的IP地址,约为43亿个;

  2>IPv4地址192.168.1.101的三种标记方式:
    +-------------------+-------------------------------------+
    |        方法       |             表示方式                 |
    +-------------------+-------------------------------------+
    |    二进制标记法    | 11000000 10101000 00000001 01100101 |
    +-------------------+-------------------------------------+
    |  点分十进制标记法  |          192.168.1.101              |
    +-------------------+-------------------------------------+
    |    十六进制标记法  |         0xC0A80165                  |
    +-------------------+-------------------------------------+

  3>IP地址分配
    具有3个接口的路由器,通过两台交换机,互连了6台主机;
    IP子网:三台主机+路由器左侧接口;               子网地址:203.1.1.0
    主机A: 203.1.1.2───────────┐     203.1.1.1  路由器接口地址:203.1.1.1
    主机B: 203.1.1.3──────────交换机─── 路由器   主机地址: 203.1.1.2
    主机C: 203.1.1.4───────────┘                         203.1.1.3
          |IP前缀|                                       203.1.1.4

    主机划分为两个部分
    1)前缀(prefix):即网络部分(NetID) 用于描述主机所归属的网络范围;
       分类地址: 定长前缀,
       无类地址:前缀长度可变    网络位(前缀) 主机位(后缀)
    2)后缀(Postfix),即主机部分(HostID)用于表示主机在网络中的唯一地址;

    3)分类地址(定长前缀)
       +----+----------+-------------------------------------+----------+-----------+
       | 类 |  前缀长度 |                 前缀                 |  首字节  |  分类寻址  |
       +----+----------+--------------------------------------+---------+-----------+
       |  A |   8位    |               0xxxxxxx               |  0-127  |主机或路由器|
       +----+----------+--------------------------------------+---------+-----------+
       |  B |   16位   |          10xxxxxx xxxxxxxxx          | 128-191 |主机或路由器|
       +----+----------+--------------------------------------+---------+-----------+
       |  C |   24位   |     110xxxxx xxxxxxxxx xxxxxxxxx     | 192-223 |主机或路由器|
       +----+----------+--------------------------------------+---------+-----------+
       |  D |  不可用  | 1111xxxx xxxxxxxxx xxxxxxxxx xxxxxxxxx| 224-239| 组广播地址 |
       +----+----------+--------------------------------------+---------+-----------+
       |  E |  不可用  | 1111xxxx xxxxxxxxx xxxxxxxxx xxxxxxxxx| 240-255 |    保留   |
       |    |          |              xxxxxxxxx               |         |           |
       +----+----------+--------------------------------------+---------+-----------+

       *1.IP地址中:
         前缀中的后几位:表示网络地址个数;   (网络范围)
         后缀位数:表示这类网络中的IP地址总数 (主机数)
         +--+-----+----+-------+--------+--------------------+
         |类| 前缀| 固定|前缀中后| 网络地址|  每个类网IP地址总数 |
         +--+-----+----+-------+--------+--------------------+
         |A |  8  | 0  |  7位  |2^7=128个|   2^24个(主机数)   |
         +--+-----+----+-------+--------+--------------------+
         |B | 16  |10  | 14位  | 2^14个  |   2^16个(主机数)   |
         +--+-----+----+-------+--------+--------------------+
         |C | 24  |110 | 21位  | 2^21个  |   2^8个(主机数)    |
         +--+-----+----+-------+--------+--------------------+

       *2.特殊地址(用途特殊的IP地址)
         +------+---------+---------+---------+-----------------------------+
         |Net ID| Host ID | 作为IP数|作为IP数据|           用途               |
         |      |         |据报源地址|报目的地址|                             |
         +------+---------+---------+--------+------------------------------+
         | 全0  |   全0   |  可以    | 不可以 |在本网范围表示主机,在路由表是路由 |
         +------+---------+---------+--------+------------------------------+
         | 全0  |  特定值  |  可以    | 不可以 |     表示本网内某个特定主机     |
         +------+---------+---------+--------+------------------------------+
         | 全1  |   全1   |  不可以  |  可以  |         本网广播地址          |
         +------+---------+---------+--------+------------------------------+
         |特定值|   全0   |  不可以  | 不可以  |        表示一个网络           |
         +------+---------+---------+--------+------------------------------+
         |特定值|   全1   |  不可以  |  可以   |  对特定网络上的所有主机进行广播 |
         +------+---------+---------+--------+------------------------------+
         | 127  |非全0或非全1| 可以  |  可以   |用于本地软件环回测试，称为环回地址|
         +------+---------+---------+--------+------------------------------+

       *3.私有地址:除特殊地址外,还有部分分类地址用于内部网络使用,但不能在公网上使用;
         +-------------+------------------------------------------------+
         | 私有地址类别 |                    范围                         |
         +-------------+------------------------------------------------+
         |     A类     |     10.0.0.0——10.255.255.255（或10.0.0.0/8）    |
         +-------------+------------------------------------------------+
         |     B类     |   172.16.0.0——172.31.255.255（或172.16.0.0/12） |
         +-------------+------------------------------------------------+
         |     C类     | 192.168.0.0——192.168.255.255（或192.168.0.0/16）|
         +-------------+------------------------------------------------+

    4)无类地址(前缀长度可变)
      在无类寻址方案中,不存在如分类寻址中的网络类别,网络前缀不再被设计为定长的
      8位、16位、24位,而是变为可以是0-32位的任意值; 网络书写形式:a.b.c.d/x;
      例如:203.1.1.0/24, (/24后缀)主机位有24个,这种地址形式称为无类域间路由(CIDR);
      例如: 10.0.0.0/8 表示的IP地址范围是 10.0.0.0~10.255.255.255
    5)子网划分
      *1.子网化:将一个较大的子网划分为多个较小子网的过程;(大变小)大子网表示主机位(后缀)多
      *2.超网化:将具有较长前缀的相对较小的子网合并为一个具有稍短前缀的相对较大的子网;(小变大)
      *3.子网掩码:32位; 对应网络前缀,全是1, 其余位(主机部分),全是0;   (超网化是子网化的逆过程)
         例如:子网213.111.0.0/24的子网掩码为:255.255.255.0;(子网掩码中1的个数,确定子网前缀是几位);

      *4.综合题:
         已知子网中某主机地址和子网掩码,就可以计算出子网地址,子网广播地址,IP地址总数和可分配IP数
         #1.子网掩码和主机地址 按位与 运算可得出 子网地址;
            与运算: 0&0=0 0&1=0; 1&0=0; 1&1=1;

         #2.子网掩码的反码 与 主机地址 按位或 运算可得出 直接广播地址;
            反码: 1────0;0────1;
            或运算: 0|0=0; 0|1=1; 1|0=1; 1|1=1;

         #3.IP地址总数
            IPv4地址共32位, 分为网络位(前缀)+主机位(后缀);
            通过子网掩码可以确定网络位(子网掩码中1的个数),
            则主机位 = 32-网络位,IP地址总数:2^(主机位);

         #4.可分配IP地址总数                                    ┌────IP地址总数─────┐
            在IP地址总数中分配 一个子网地址 和 一个直接广播地址    |        |         |
            所有可分配地址总数: IP地址总数-2;                    头    可分配IP     尾
            可分配地址范围: (子网地址+1)  ~ (直接广播地址-1)   子网地址 (主机数-2) 广播地址

         例题:
         假设某子网中的一个主机的IP地址是 203.123.1.135, 子网掩码是:255.255.255.192
         1)求该子网的子网地址;(写出计算过程)
           子网掩码:11111111 11111111 11111111 11000000 (子网掩码中1的个数,确定子网前缀是几位)
         IP主机地址:11001011 01111011 00000001 10000111
          进行&运算:11001011 01111011 00000001 10000000
           子网地址:    203  . 123    .  1     . 128 /26 (子网掩码有26个1,代表子网前缀为26位)

         2)求直接广播地址;
           子网掩码:11111111 11111111 11111111 11000000
           取反结果:00000000 00000000 00000000 00111111
         IP主机地址:11001011 01111011 00000001 10000111
          进行|运算:11001011 01111011 00000001 10111111
           直接广播地址: 203  . 123    .  1     . 191

         3)求子网IP的地址总数;
           主机位有32-26=6位,即2^6=64个;

         4)求该子网的可分配IP地址数;
           64-2=62个 (子网地址占1个,广播地址占1个,所以64-2=62);

         5)求可分配地址范围;
           可分配IP地址范围: 203.123.1.129~203.123.1.190(去掉头和尾)

   题1.已知IP地址172.32.1.113对应的子网掩码为255.255.254.0;
     1)求该IP地址所在网络的网络地址;(子网地址)(写出计算过程)
         子网掩码:11111111 11111111 11111110 00000000
       IP主机地址:10101100 00100000 00000001 01110001
        进行&运算:10101100 00100000 00000000 00000000
         子网地址:   172  .   32   .    0   .  0/23

     2)求该网段的IP地址范围;
       IP地址范围:172.32.0.0~172.32.1.255;

     3)求该网段可分配的IP地址范围(掐头去尾)
       IP地址可分配范围:172.32.0.1~172.32.1.254;

     4)求该网段的广播地址
         子网掩码:11111111 11111111 11111110 00000000
         取反结果:00000000 00000000 00000001 11111111
       IP主机地址:10101100 00100000 00000001 01110001
        进行|运算:10101100 00100000 00000001 11111111
        直接广播地址: 172  .  32   .  1     . 255

   题2.某公司总部与其子公司A,B,C分别位于四个不同的地区,假设公司拥有子网地址是 202.119.110.0/24,
       总部与子公司A、B、C联网的主机数分别是53、26、12、12、要求子公司B和子公司C的主机位于相邻
       的子网,请写出下表中序号处的IP地址和子网掩码;
       +---------+----------------------+-----------------+
       |         |  主机IP地址范围       |    子网掩码      |
       +---------+----------------------+-----------------+
       |   总部  | 202.119.110.129 ~(1) | 255.255.255.192 |   子网地址:主机位全是0;
       +---------+----------------------+-----------------+   广播地址:主机位全是1;
       | 子公司A |  (2)~202.119.110.94  |       (3)        |  起始地址:主机位最后1位为1;(子网后)
       +---------+----------------------+-----------------+  终止地址:主机位最后1位为0;(广播前)
       | 子公司B |  202.119.110.97~(4)  | 255.255.255.240  |  起始与最终地址 网络位相同,主机位不同;
       +---------+----------------------+-----------------+
       | 子公司C |       (5)~(6)        | 255.255.255.240  |
       +---------+----------------------+-----------------+

       1) 由 总子网掩码 255.255.255.192 得出
          网络位 26位, 主机位:6位
          主机IP起始地址: 202.119.110.129
          起始地址后6位主机位 10|000001
          终止地址后6位主机位 10|111110  255-65=190;
          所以总部广播地址是:202.119.110.190; (1)

       2)由子公司A主机的主机数量为26台,2^4=16<26;(不够)
         可得:子公司A的主机位为 5 即 2^5=32>26;(可用)
         可得:子公司A的网络位为 27, 11111111 11111111 11100000
         可得:子网掩码为255.255.224;(3)  主机位: 5位
         由 终止地址 202.119.110.94 得   终止后8位为:010|11110
         可得:起始地址为:202.119.110.65; 起始后8位为:010|00001 (2)

       3)由255.255.255.240 可知 主机位为: 4位
         由 起始地址 202.119.110.97 得  起始后8位为:0110|0001 可得:
         终止地址为: 202.119.110.110;   终止后8位为:0110|1110 (4)

       4)B的广播地址:202.119.110.111,因为BC相邻,故子公司C的子网地址为202.119.110.112
         的IP起始地址为:202.119.110.113; 起始后8位 0111|0001; (5) 主机位4位(由子网掩码得)
         的IP终止地址为:202.119.110.126; 终止后8位 0111|1110; (6)



  4>路由聚合
    1)用途:减少路由表项数,提高路由效率,将可以聚集在一起的子网聚合成一个大的子网;
    +-------------------+---------+------+
    |      网络地址      |下一跳地址| 接口 |
    +-------------------+---------+------+  后两位是连续的四个数
    |  15.65.154.0/26   |    A    |  S1  |   00000000
    +-------------------+---------+------+   01000000
    |  15.65.154.64/26  |    A    |  S1  |   10000000
    +-------------------+---------+------+   11000000
    |  15.65.154.128/26 |    A    |  S1  |
    +-------------------+---------+------+
    |  15.65.154.192/26 |    A    |  S1  | 聚合->  网络地址     下一跳   接口
    +-------------------+---------+------+       15.65.154.0/24   A     S1
       前24位一样

 3.动态主机配置协议(Dynamic Host Configuration Protocol, DHCP)
  1>当组织分配到一个网络地址块后,就可以为该组织内的主机和路由器接口分配IP地址;
    静态分配:手动配置;              DHCP客户端          DHCP服务器
    动态分配:动态主机配置协议来分配;    |    DHCP Discover   | DHCP服务器发现:广播方式
                                     |------------------->|
  2>动态主机配置协议(DHCP)端口号       |      DHCP Offer    | DHCP服务器提供:广播方式
    DHCP服务器端口号: 67;             |<-------------------|
    DHCP客户端口号: 68;               |     DHCP Request   | DHCP请求: 广播方式
                                     |------------------->|
                                     |      DHCP ACK      | DHCP确认
                                     |<-------------------|

 4.NAT(网络地址转换,Notwork Address Translation)(解答题)
  1>NAT用途:使私有地址的主机能在公共Internet上进行正常通信的技术;
  2>网络地址转换(NAT)工作原理
    1)从内网出去的IP数据报,将其 IP地址 替换为 NAT服务器拥有的
      合法的公共IP地址,同时替换源端口号,并将替换关系记录到NAT转换表中;

    2)从公共互联网返回的IP数据,依据其目的IP地址与目的端口号检索 NAT转换表,并利用检索到的
      内部私有IP地址 和 对应的端口号 替换 目的IP地址 和 目的端口号,将IP数据报转发到内部网络;
      
  3>基于UPnP(Universal Plug and Play,即插即用)协议可通过动态配置的方法事先建立NAT映射实现NAT穿透技术;
 
 5.ICMP(互联网控制报文协议,Internet Control Message Protocol)
  1>ICMP用途:在主机或路由器间实现网络层 差错报告 与 信息探测; ping 域名 

  2>ICMP结构:
    0           7          15                       31
    |           |           |                       |
    +-----------+-----------------------------------+
    |   类型    |   代码     |        校验和         |
    +-----------------------------------------------+
    |             由ICMP报文的类型决定                |
    +-----------------------------------------------+
    |                ICMP的数据部分                  |
    +-----------------------------------------------+

  3>ICMP报文类型:(差错报文和询问报文)
   1)差错报告报文:
     *1.终点不可达;  TTL(生存时间 跳步数)不够, 返回ICMP报文
     *2.源点抑制;    处理报文超载
     *3.时间超时;
     *4.参数问题;    例如:DF=1, 不分片,驳回;
     *5.路由重定向;  路由选择;

   2)询问报文(信息探测)
     *1.回声请求/应答; ping 域名 例如 ping baidu.com; //向特定主机发送ICMP请求报文,测试是否可达;
     *2.时间戳请求/应答; 回复时间;

 6.IPv6(128位)
  0>IPv6地址长度为128位
  1>IPv6数据报格式(基本首部)[选择、填空]
    ┌-----------------------------32位----------------------------┐
    |------------------------------┴------------------------------+
    |版本(4位)|  流量类型(8位)  |           流标签(20位)            |
    |-------------------------------------------------------------+
    |      有效荷载长度(16位)       |下一个首部(8位) | 跳数限制(8位) |
    |-------------------------------------------------------------+
    |                        源IP地址(128位)                       |
    |-------------------------------------------------------------+
    |                        目的IP地址(128位)                     |
    |-------------------------------------------------------------+
    |                             数据                            |
    +-------------------------------------------------------------+
    IPv6与IPv4数据报首部对比
    IPv6删除字段:
    *1.分片相关字段
    *2.首部校验和
    *3.选项字段不是IPv6基本首部字段

  2>IPv6地址表示方法:
    1)8组冒号分隔的十六进制数：
      8000:0000:0000:0000:4321:0501:AB96:56CD
      0000:0000:0000==>:: (::只能出现一次)
      8000::4321:0501:AB96:56CD (字母最大为F)

    2)在IPv6地址中嵌入IPv4的点分十进制:
      6700:89A1:0321:206.36.45.19;

  3>IPv6地址分类(单任组)
   *1.单播地址(源地址和目的地址)(可标识一个主机或路由器接口)
   *2.任播地址(目的地址)(某)(该任播地址标识的 某个主机 可收到该IP数据报)
   *3.组播地址(目的地址)(都)(该组播地址标识的 所有主机 都能收到该IP数据报)

  4>IPv4到IPv6的迁移方法(选择、填空)
    1)双协议栈: 网络结点同时具备发送IPv4 与 IPv6 数据报的能力;
             IPv4 \
             IPv6--路由器1---DNS--->路由器2(使用DNS判断是IPv4还是IPv6)

    2)隧道: 很好的解决IPv6通信中经过IPv4路由器的问题,同时也不会出现信息丢失的问题
           给IPV6加一层IPv4的封装,
                 IPv6         IPv4(v6)         IPv6
          源主机-------路由器1---------->路由2--------->目的主机

