org/计算机网络原理笔记.org
** 路由算法与路由协议
 1.路由选择算法分类
  0>路由选择:选择转发IP分组的通路的过程称为"路由选择"
    路由选择的核心是 路由选择算法;

  1>带权无向图
    将网络抽象为一个带权无向图G(N,E),N表示结点集合,E是边的集合;
    网络中的路由器抽象为图G的结点,连接两个路由器的网络链路抽象为G的边;
    例如:X,Y  网络链路的费用(比如延时)抽象为G中的权值;
             ( X )        若两个结点间有边,例如从结点X到结点Y,
         10 / \   \ 100   则从结点X到结点Y耗费的费用记作C(X,Y)=10;
           /   \30 \      若两个结点间没有边,例如结点x到结点U,
         (Y)    \ (W)     则结点X到结点U耗费的费用记作C(X,U)=∞;
        50  \  10╳ /60
             (U)--(V)
                 20
  2>路由选择算法分类
   ┌-----------+------+-----------------+---------------------------┐
   | 分类标准   |子分类|     适用算法     |         典型算法           |
   |-----------+------+-----------------+---------------------------+
   |  是否需要  | 需要 | 全局式路由选择算法| 链路状态路由选择算法(LS算法) | 全状
   |   网络的   |------+-----------------+---------------------------+
   |  完整信息  |不需要| 分布式路由选择算法| 距离向量路由选择算法(DV算法) | 分离
   |-----------+------+-----------------+---------------------------+
   |           | 静态 |     人工配置     |                           |
   |  静动状态  |------+-----------------+---------------------------+
   |           | 动态 | 变化时自动计算路径|     LS算法      DV算法     |
   |-----------+------+-----------------+---------------------------+
   |           | 敏感 |         负载敏感的路由选择算法                 |
   |  是否敏感  |------+---------------------------------------------+
   │           | 迟钝 |         负载迟钝的路由选择算法                 |
   +-----------+------+---------------------------------------------+

 2.链路状态路由选择算法(LS算法)
   链路状态路由选择算法是一种全局式路由选择算法,每个路由器在计算路由时,
   需构建整个网络拓扑图(利用Dijkstra(迪杰斯特拉算法)求最短路径)
   ┌--------+-----------------------------------------------------------+
   |  D(v)  |    到本次迭代为止,源结点(计算结点)到目的结点v的当前路径距离    |
   +--------+-----------------------------------------------------------+
   |  P(v)  | 到本次迭代为止,在源结点到目的结点v的当前路径上,结点v的 前序结点 |
   +--------+-----------------------------------------------------------+
   | C(x.y) |结点x与结点y之间直接链路的费用,若x和y之间没有链路相连,则c(x,y)=∞|
   +--------+-----------------------------------------------------------+
   |   S    |是存储从源结点到该结点已求出的最短路径的 结点集合,初值:源结点本身|
   +--------+-----------------------------------------------------------+

   例题:如下图从X结点出发,分别求 到达Y,U,V,W的最短路径;

                        结点X上的路由转发表
         ( X )       +--------+-------------+
    10  / \  \100    |  目的  |    链路      | 链路: (源结点, 目的结点(可直达)),
       /   \   W     +--------+-------------+       (源结点, 目的前驱(不直达))
     Y    30\ /|     |   y    |    (x,y)    |
       \     ╳ |60   +--------+-------------+ 路由器X上的转发表只存放 下一跳 路由器,而不是 最终路由器;
      50\ 10/ \|     |   v    |    (x,v)    |
          U----V     +--------+-------------+
            20       |   u    |    (x,v)    |
                     +--------+-------------+
                     |   w    |    (x,v)    |
                     +--------+-------------+
   +-------+-----------+------------+----------+----------+-----------+----------+
   |  循环 |      S    | 每轮选择结点 |D[y],P[y]| D[u],P[u] | D[v],P[v] |D[w],P[w] |
   +-------+-----------+------------+----------+----------+-----------+----------+
   |   0   | {x}       |     -      |  10,y    |    ∞     |   30,v    |  100,w   |
   +-------+-----------+------------+----------+----------+-----------+----------+
   |   1   | {x,y}     |     y      |          |   60,y   |   30,v    |  100,w   |
   +-------+-----------+------------+----------+----------+-----------+----------+
   |   2   | {x,v}     |     v      |          |   50,v   |           |   90,v   |
   +-------+-----------+------------+----------+----------+-----------+----------+
   |   4   | {x,v,u}   |     u      |          |          |           |   60,u   |
   +-------+-----------+------------+----------+----------+-----------+----------+
   |   5   |{x,v,u,w}  |     w      |          |          |           |          |
   +-------+-----------+------------+----------+----------+-----------+----------+
   2>如果某个结点在选择下一跳结点时，有多个结点的最短路径相同，则选择结点编号小的结点作为下一跳节点。
   3>适用情景:需要全网网络链路状态分组;
   例:结点x到 结点y和结点z的路径代价相同，且都是x到所有下一跳结点中的最短路径,则选择y为x的下一跳结点。
                          下一跳: 只关心 起点 的下一跳
               Z         +-------+-------------+------------+  利用Dijkstra最短路径算法计算
            10/ \2       |  目的 |    下一跳    |    代价    |  结点x 到网络中所有结点的最短路径,
             /   \       +-------+-------------+------------+  填写表中序号处的内容。
            y--4--t      |   s   |     w       |      6     |
         7 / \1 8/ \1    +-------+-------------+------------+            x
          /   \ / | \    |   t   |     w       |      5     |             \1
         x--3--v  2  s   +-------+-------------+------------+              w
          \   / \ | /    |   u   |     w       |      3     |               \1
          1\ /1 1\ /6    +-------+-------------+------------+                v
            w--5--u      |   v   |     w       |      2     |              1/ \1
                         +-------+-------------+------------+              y   u
                         |   w   |     w       |      1     |                   \2
                         +-------+-------------+------------+                    t
                         |   y   |     w       |      3     |                  2/ \1
                         +-------+-------------+------------+                  z   s
                         |   z   |     w       |      7     |
                         +-------+-------------+------------+
   +---------------+---------+---------+---------+---------+---------+---------+---------+
   |      S        |D[y],P[y]|D[w],P[w]|D[v],P[v]|D[u],P[u]|D[s],P[s]|D[t],P[t]|D[z],P[z]|
   +---------------+---------+---------+---------+---------+---------+---------+---------+
   |{x}            |   7,y   |   1,w   |   3,v   |    ∞    |    ∞    |    ∞    |    ∞    |
   +---------------+---------+---------+---------+---------+---------+---------+---------+
   |{x,w}          |         |    ─    |   2,w   |   6,w   |         |         |         |
   +---------------+---------+---------+---------+---------+---------+---------+---------+
   |{x,w,v}        |   3,v   |    ─    |    ─    |   3,v   |         |  10,v   |         |
   +---------------+---------+---------+---------+---------+---------+---------+---------+
   |{x,w,v,u}      |   ─     |    ─    |    ─    |    ─    |   9,u   |   5,u   |         |
   +---------------+---------+---------+---------+---------+---------+---------+---------+
   |{x,w,v,u,t}    |   ─     |    ─    |    ─    |    ─    |   6,t   |    ─    |   7,t   |
   +---------------+---------+---------+---------+---------+---------+---------+---------+
   |{x,w,v,u,t  }  |   ─     |    ─    |    ─    |    ─    |    ─    |    ─    |   7,t   |
   +---------------+---------+---------+---------+---------+---------+---------+---------+
   |{x,w,v,u,t,z}  |   ─     |    ─    |    ─    |    ─    |    ─    |    ─    |    ─    |
   +---------------+---------+---------+---------+---------+---------+---------+---------+

 3.距离向量路由选择算法(DV算法)
  1>距离向量路由选择算法的基础是Bellman-Ford方程(简称B-F方程);
    令dx(y)表示结点x到结点y的路径的最低费用,根据B-F方程,有以下公式:
    dx(y)=min{c(x,v)+dv(y)} v∈{x的邻居}
    Y---3---Z             x到z, z到z     x到Y  Y到Z
     \     /   dx(z)=min{c(x,z)+dz(z), C(x,y)+dy(z)}
      2   7         =min(7+0, 2+3)
       \ /          =min(7, 5)
        X           =5
    所以得到结点x到结点y的最短路径是{x,y,z}

  2>网络中每个结点x,估计自己到网络中结点y的最短距离,记为Dx(y)称为结点x的距离向量;

  3>适用网络规模范围:需要在邻居路由器之间交换距离向量;
    *1.路由器分别维护自己的转发表(Dv),并收到邻居的通告;
    *2.收到通告会进行对比更新;

 4.层次化路由选择
   1>作用:实现大规模路由选择最有效、可行的解决方案

   2>自治系统(autonomous system, AS)
     互联网按组织边界、管理边界、网络技术边界或功能划分为多个自治系统,
     每个自治系统由运行 相同 路由协议和路由选择算法的路由器组成;

   3>网关路由器:每个AS存在至少一个与其他AS互连的路由器(例如:3C, 2C 1A );
     3B----3A 2B--3A   网关路由器过滤路由的规则:
       \AS3/  \AS2/    1)本地偏好值属性,这个属性由AS网络管理员来设定,具有最高偏好值的路由被选择
        3C     2c      2)若多条路由具有相同的本地偏好值,那么具有最短AS-PATH的路由将被选择;
         \     /       3)若多条路由具有相同的本地偏好值即相同长度的AS-PATH,那么具有最近NEXT-HOP的路由将被选择;
         1B---1A
          \AS1/
           1C

   4>层次化路由选择原理
     将大规模互联网的路由划分为两层:
     1.自治系统 内 路由选择: 计算到达自治系统内目的网络的路由;
     2.自治系统 间 路由选择:负责其他自治系统网络的可达性信息;(通过网关路由器转发表)
                                 ↓
   5>路由器转发表:
     由自治系统内路由选择协议和自治系统间路由选择协议 共同设置
     转发表包含的主要信息有网络地址、子网掩码、下一跳地址以及路由器接口;

 5.层次化路由选择相关协议
  1>Internet自治系统内路由选择协议称为:内部网关协议(IGP,Interior Gateway Protocol);
   1)路由信息协议(RIP,Routing Information Protocol)
     RIP:广泛使用,基于距离向量路由选择算法的IGP
     RIP报文:封装进UDP数据报
     RIP特性:
     *1.在度量路径时采用的是跳数;
     *2.RIP的费用定义在源路由和目的子网之间;
     *3.RIP被限制的网络直径不超过 15跳 的自治系统内使用;
        路由器间能收到通告,之间距离为1跳;

   2)例题
     设网络中路由器使用RIP协议,路由器B的当前路由表如表1所示,
     B收到从路由器C发来的路由信息,如表2所示,试给出路由器B更新后的路由表;

               B的路由表                       C的路由信息
     +---------+------+-----------+       +---------+------+
     | 目的网络 | 距离 | 下一跳路由 |       | 目的网络 | 距离 |
     +---------+------+-----------+       +---------+------+
     |    N1   |  7   |     A     |       |    N2   |  4   |
     +---------+------+-----------+       +---------+------+
     |    N2   |  2   |     C     |       |    N3   |  8   |
     +---------+------+-----------+       +---------+------+
     |    N6   |  8   |     F     |       |    N6   |  4   |
     +---------+------+-----------+       +---------+------+
     |    N8   |  4   |     E     |       |    N8   |  3   |
     +---------+------+-----------+       +---------+------+
     |    N9   |  4   |     F     |       |    N9   |  5   |
     +---------+------+-----------+       +---------+------+

     路由B更新后的路由表(相邻代表隔1跳)
     +---------+------+-----------+
     | 目的网络 | 距离 | 下一跳路由 |
     +---------+------+-----------+
     |    N1   |  7   |     A     |  表C中没有达到N1的信息,所以不变
     +---------+------+-----------+
     |    N2   |  5   |     C     |  B-1->C C-4->N2  =>B->N2=4+1=5
     +---------+------+-----------+
     |    N3   |  9   |     C     |  B-1->C C-8->N3  =>B->N3=1+8=9
     +---------+------+-----------+
     |    N6   |  5   |     C     |  B-1-C  C-4->N6  =>B->N6=1+4=5
     +---------+------+-----------+
     |    N8   |  4   |     E     |  B->C->N8 等于 B->E->N8 不变
     +---------+------+-----------+
     |    N9   |  4   |     F     |  B->F->N9 小于 B-C->N9  不变
     +---------+------+-----------+

   2)开放最短路径优先协议(OSPF,Open Shortest Path First)
     *1.OSPF的优点:
       #1.安全
       #2.支持多条 相同 费用路径;
       #3.支持区别化费用度量;
       #4.支持单播路由与多播路由;
       #5.分层路由;

     *2.OSPF分类
                       |
                  AS边界路由器
                    /      \ 主干区
              主干路由器     \
                /          区域边界路由器1 区域3
       区域1 区域边界路由器1    \
              /            区域边界路由器2
       区域边界路由器2
  2>Internet自治系统间路由选择协议称为:外部网关协议(EGP,Exterior Gateway Protocol);
   1)边界网关协议(BGP,Border Gateway Protocol)
     实现跨自治系统的路由信息交换,典型版本是BGP4
     BGP应用进程实现的,传输层使用TCP;
     每个AS可以通过BGP实现如下功能:
     *1.从相邻AS获取某子网的可达性信息;
     *2.向本AS内部的所有路由传播跨AS的某子网可达性信息;
     *3.基于某子网可达信息和AS路由策略,决定到达该子网的最佳路由;

   2)BGP主要有4种报文
     *1.OPEN(打开)报文: 用于与BGP对等方建立BGP会话;
     *2.UPDATE(更新)报文: 用于通告某一路由可达性信息,或撤销已有路由;
     *3.KEEPALIVE(保活)报文: 用于打开报文的确认,或周期性地证实会话的有效;
     *4.NOTIFICATION(通知)报文: 用来通告差错;
  
   3)比较重要的路由属性
     *1.AS-PATH 即AS路径,是到达前缀需要经过的AS路径,该属性包含一条路由已经通知过的AS,可预防重复通告;
     *2.NEXT-HOP 一个开始AS-PATH的路由器接口
     
  3>Internet路由选择协议
    +-----------+----------------+-----------------+
    |  协议名称  |      封装      |    适用范围      |
    +-----------+----------------+-----------------+ IGP
    |    RIP    |    UDP数据报    |   较小规模AS内  |
    +-----------+----------------+-----------------+
    |   OSPF    |    IP数据报     |   大规模AS内    |
    +-----------+----------------+-----------------+
    |    BGP    |      TCP       |      跨AS       | EGP
    +-----------+----------------+-----------------+
