public/计算机网络原理笔记.html
<div id="outline-container-orgb8ed8d0" class="outline-2">
<h2 id="orgb8ed8d0">第五章 数据链路层与局域网</h2>
<div class="outline-text-2" id="text-orgb8ed8d0">
</div>
<div id="outline-container-org286e299" class="outline-3">
<h3 id="org286e299">数据链路层服务</h3>
<div class="outline-text-3" id="text-org286e299">
<p>
1.数据链路层提供的服务内容
 1)结点: 主机、路由器;
 2)链路: 网络中两个结点之间的物理通道;
 3)数据链路:网络中两个结点之间的逻辑通道,把实现控制数据传输协议
           (TCP协议)的硬件和软件加到链路上就构成数据链路;
 4)数据链路层: 负责通过一条链路,从一个结点向另一个物理链路直接相连
              的相邻结点,传送网络数据报,中间不经过任何其他交换结点;
</p>

<p>
5)数据链路在物理链路之上,基于通信协议来控制数据帧传输的逻辑数据通路,
</p>

<p>
6)实现数据链路层协议的典型硬件实体是: 网络适配器(NIC,网卡);
</p>

<p>
7)数据链路层的传输单元是: 帧;
</p>

<p>
8)数据链路层提供的服务(4条): 组帧、链路接入、可靠交付、差错控制
 *1.组帧(成帧)
    帧头(帧首):发送结点和接收结点的地址信息、定界字符(区分帧头);
    帧尾:用于差错检测的差错编码,定界字符(区分帧尾);01111110
</p>

<p>
发送结点                    接收结点
│数据报│                    │数据报│
   ↓                           ↑
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">帧头(帧首)</td>
<td class="org-left">数据报</td>
<td class="org-left">帧尾</td>
<td class="org-left">&#x2013;&#x2014;&gt;</td>
<td class="org-left">帧头(帧首)</td>
<td class="org-left">数据报</td>
<td class="org-left">帧尾</td>
</tr>
</tbody>
</table>
<p>
加             加            减             减
</p>

<p>
*2.链路接入
   物理链路可分为 点对点链路 和 广播链路 两大类;
   点对点链路:发送结点和接收结点独占信道;
   广播链路:通信链路多被多个结点共享;
   采用 分组存储转发 和 路由选择机制 是点对点式链路和广播式链路的重要区别之一;
</p>

<p>
*3.可靠交付
   无线链路(出错率高):支持可靠数据传输;(电磁波)
   光纤,双绞线(出错率低): 不提供可靠数据传输服务;
</p>

<p>
*4.差错控制
   数据链路层帧在物理媒介上的传播过程,可能会出现比特翻转的差错;
   误比特率:出现差错的比特数/传输比特总数;
</p>
</div>
</div>
