public/计算机网络原理笔记.html

<div id="outline-container-org218dadf" class="outline-3">
<h3 id="org218dadf">差错控制</h3>
<div class="outline-text-3" id="text-org218dadf">
<p>
1.差错控制的基本方式
 1&gt;噪声导致的传输差错
  1)随机噪声: 随机差错 或 独立差错;
  2)冲击噪声: 突发差错, 通常是连续成片的信息差错,差错之间具有相关性,差错通常集中发生
   (物理信道) 在某段信息,突发错误发生在第一位错误与最后一位错误之间的长度称为 突发长度;
</p>

<p>
2&gt;差错控制(4种)
  通过差错编码技术,实现对信息传输差错的检验,并基于某种机制运行差错纠正和处理;
  具体措施:(检错重发, 前向纠错, 反馈校验, 检错丢弃)
 *1.检错重发(利用差错编码)
    发送端: 待发送数据进行差错编码,然后发送;
    接收端: 利用差错编码检测数据是否出错,若出错,接收端请求发送端重发数据加以纠正;
</p>

<p>
*2.前向纠错(FEC,Forward Error Correction)(利用纠错编码)
   发送端: 对数据进行纠错编码,然后发送;
   接收端: 收到数据,利用纠错编码进行差错检测,且纠错;
   适用: 单工链路 或 对实时性要求比较高的应用;
</p>

<p>
*3.反馈校验
   接收端:将收到的数据 原封不动 发回发送端;
   发送端:通过 对比 接收端反馈的收据与发送的数据确认
         接收端是否正确接收已发送数据,若有不同,立即重传数据;
</p>

<p>
优点:原理简单,易于实现,无须差错编码
缺点: 需要相同传输能力的反向信道,传输效率低,实时性差;
</p>

<p>
*4.检错丢弃:
   网络应用对可靠性要求不高,可采用不纠正出错数据,直接丢弃错误数据,
   适用于实时性较高的系统;
</p>

<p>
<del>-------------------</del>------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">差错控制基本方法</td>
<td class="org-left">特点</td>
</tr>
</tbody>
</table>
<p>
<del>-------------------</del>------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">检错重发</td>
<td class="org-left">重发数据加以纠正</td>
</tr>
</tbody>
</table>
<p>
<del>-------------------</del>------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">前向纠正</td>
<td class="org-left">检错、定位、纠正</td>
</tr>
</tbody>
</table>
<p>
<del>-------------------</del>------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">反馈校验</td>
<td class="org-left">数据返回</td>
</tr>
</tbody>
</table>
<p>
<del>-------------------</del>------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">检错丢弃</td>
<td class="org-left">实时性较高的系统</td>
</tr>
</tbody>
</table>
<p>
<del>-------------------</del>------------&#x2013;&#x2014;+
</p>


<p>
2.差错编码的基本原理
  香农信道编码定理指出:对于一个给定的有干扰信道,只要发送端以低于信道容量C
  的数据速率R发送信息,则一定存在一种编码方法,使得编码错误概率P随着码长n的
  增加而按指数下降至任意小的值;
</p>

<p>
在待传输(或待保护)数据信息基础上,附加一定的冗余信息,该冗余信息与数据信息
建立某种关联关系(复制一次等);将数据信息以及附加的冗余信息一同发送到接收端,
接收端可以检测冗余信息表征的数据信息的关联关系是否存在,如果存在则没有错误,
否则有错误;
例如:发送端向接收端发送2位数据信息,如果不进行差错编码,则接收端可能收到:
00、01、10、11、如果进行差错编码:增加两位冗余信息:对数据进行一次复制,
经过差错编码后,4个码字分别为:0000,0101,1010,1111;接收端收到码字后,如果
发生了1位差错,比如收到1011,10和11不满足复制关系,则断定出现差错,
</p>



<p>
3.差错编码的检错与纠错能力
 1&gt;不同差错编码的检错和纠错能力不同;
   差错编码的检错或纠错能力与 编码集 的 汉明距离 有关;
  *1.编码集: 差错编码的所有有效码字的集合;
  *2.编码集的汉明距离:编码集中任意两个码字之间汉明距离的最小值;记为ds;
     编码集{1010,0101,1111,0000}
     汉明距离:
     表示两个(相同长度)字对应位不同的数量,我们以d(x,y)表示两个字x,y之间的
     汉明距离,对两个字符串进行异或运算(同假异真),其结果为1的个数即汉明距离;
     就是两个等长码字之间,对应位数不同的位数;
     例如:01011101⊕01001001 汉明距离dc=2
     编码集{1010，0101，1111，0000}
     1010⊕0101=4; 1010⊕1111=2; 1010⊕0000=2;
     0101⊕1111=2; 0101⊕0000=2; 1111⊕0000=4;
     编码集的汉明距离：ds=min{4，2，2，2，2，4}
     编码集的汉明距离: ds=2;//最小汉明距离越大,码组越具有抗干扰能力;
</p>

<p>
2&gt;检错编码
  对于检错编码,若编码集的汉明距离ds=r+1,则该差错编码可以检测r位的差错;
  例:发送2位数据信息,冗余信息是数据的一次复制
     编码集{0000，0101，1010，1111}
     ds=r+1=2=1+1,r=1, 因此可以检测出1位差错
</p>

<p>
3&gt;纠错编码
  对于纠错编码,若编码集的汉明距离ds=2r+1,则该差错编码可以纠正r为差错;
  例如:发送2位数据信息,冗余信息是数据的两次复制;
       编码集{000000，010101，101010，111111}
       ds=3=2*1+1,因此可以纠正出1位差错;
</p>

<p>
若发生1位差错,则错码距离发生错误的有效码字的汉明距离最近,可恢复为有效码字;
若收到码字为100010,下列码字那个为有效码字;
100010与000000，010101，101010，111111的汉明距离分别为:
          2       5       1      4
则有效码字为101010 , 用有效码字替换收到码字;
</p>

<p>
4.典型的差错编码
  典型的差错编码: 奇偶校验码、循环冗余码;
  异或逻辑运算;符号:⊕ , 1⊕1=0;1⊕0=1;0⊕0=0;0⊕1=1;(同假异真)
</p>

<p>
1&gt;奇偶校验码
 *0.最简单的检验码,利用1位冗余信息实现差错检测,分为 奇校验码、偶校验码;
 *1.奇校验码
   1位冗余位的取值为0或1,使得编码后的码字中 1的个数 为 奇数;
   例如:数据10110111,采用奇校验码编码后的码字为:10110111|1  7个1 ;
        数据10110110,采用奇校验码编码后的码字为:10110110|0  5个1 ;
</p>

<p>
*2.偶校验码
  1位冗余位的取值为0或1,使得编码后的码字中 1的个数 为 偶数数;
  例如:数据10110111,采用偶校验码编码后的码字为:10110111|0  6个1 ;
       数据10110110,采用偶校验码编码后的码字为:10110110|1  6个1 ;
</p>

<p>
*3.优点:编码简单、编码效率高、开销最小的检错编码;
*4.缺点:检错率不高;
</p>

<p>
2&gt;循环冗余码( CRC码,Cyclic Redundancy Check)
 *0.地位:在 数据链路层 广泛应用的差错编码;(检错码)
 *1.基本思想
    将二进制位串看成是系数为0或1的多项式的系数;
    例如: 100101有6位,写一个多项式,位串的数字就是每个多项式的系数
</p>
<p>
<del>-----------</del>------<del>--------</del>------<del>-------</del>--------<del>------</del>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">多项式拆解</td>
<td class="org-left">X<sup>5</sup></td>
<td class="org-left">X<sup>4</sup></td>
<td class="org-left">X<sup>3</sup></td>
<td class="org-left">X<sup>2</sup></td>
<td class="org-left">X<sup>1</sup></td>
<td class="org-left">X<sup>0</sup></td>
</tr>
</tbody>
</table>
<p>
<del>-----------</del>------<del>--------</del>------<del>-------</del>--------<del>------</del>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<tbody>
<tr>
<td class="org-left">位串</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>
<p>
<del>-----------</del>------<del>--------</del>------<del>-------</del>--------<del>------</del>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">相乘</td>
<td class="org-left">1*X<sup>5</sup></td>
<td class="org-left">0*X<sup>4</sup></td>
<td class="org-left">0*X<sup>3</sup></td>
<td class="org-left">1*X<sup>2</sup></td>
<td class="org-left">0*X<sup>1</sup></td>
<td class="org-left">1*X<sup>0</sup></td>
</tr>
</tbody>
</table>
<p>
<del>-----------</del>------<del>--------</del>------<del>-------</del>--------<del>------</del>
多项式:X<sup>5</sup>+X<sup>2</sup>+1;//任何数的0次方都为1; 第0位, 第2位 第5位为1;
</p>

<p>
*3.编码过程:
  1)在帧的低位端加上r个0位,使该帧扩展为m+r位(相当于左移r位).对应多项式为X<sup>rM</sup>(x);
  2)用G(x)系数对应的位串,去除(模2除法) X<sup>rM</sup>(x)系数对应的位串,求的r为余数R;
  3)用XrM(x)系数对应的位串,减(模2减法)去余数R,结果就是完成CRC编码的帧;
</p>

<p>
*4.方法总结:用编码多项式G(x),对为串进行CRC编码;
   第1步: 写出多项式对应的位串,并确定有r位 (r=多项式x的最高指数幂+1, x<sup>r</sup>);
   第2步: r-1的值是需要在待编码为串后面添加0的个数:添加(r-1)个0;
   第3步: 用得到的新的待编码位串除以多项式对应的比特串;
   第4步: 求得的 余数 添加在待编码位串后,即为CRC编码后的码;
</p>

<p>
例:假设CRC编码采用的生成多项式G(x)=x<sup>4</sup>+x+1,请为位串10111001进行CRC编码;
   第1步:写出多项式对应的位串
</p>
<p>
<del>-----------</del>--------<del>------</del>-------<del>--------</del>-&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">多项式拆解</td>
<td class="org-left">X<sup>4</sup></td>
<td class="org-left">X<sup>3</sup></td>
<td class="org-left">X<sup>2</sup></td>
<td class="org-left">X<sup>1</sup></td>
<td class="org-left">X<sup>0</sup></td>
</tr>
</tbody>
</table>
<p>
<del>-----------</del>--------<del>------</del>-------<del>--------</del>-&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">位串</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-left">(5位)</td>
</tr>
</tbody>
</table>
<p>
<del>-----------</del>--------<del>------</del>-------<del>--------</del>-&#x2013;&#x2014;+
第2步:5-1的值是需要在待编码为串后面添加0的个数:添加4个0, r=4;//x<sup>4</sup>
      待编码位串: 10111001-&#x2013;&#x2014;101110010000
</p>

<p>
第3步：用得到的新的待编码位串(101110010000)除以多项式对应的比特串(10011);
                10100111
      10011√101110010000
            10011
              10000    模2减法运算为：1-1=0，0-1=1，1-0=1，0-0=0//无进位，无借位
              10011    相当于异或运算;同0异1;同假异真;
                 11100
                 10011
                  11110
                  10011
                   11010
                   10011
                    1001 (最终余数)
第4步:求得的余数(1001)添加在待编码位串后,即为CRC编码后的码: 10111001|1001
</p>

<p>
题1.设生产多项式G(X)=X<sup>4</sup>+X<sup>2</sup>+X+1,求对位串100111011101进行CRC编码后的结果;
    1&gt;将多项式转换成对应的位串:
</p>
<p>
<del>-----------</del>--------<del>------</del>-------<del>--------</del>-&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">多项式拆解</td>
<td class="org-left">X<sup>4</sup></td>
<td class="org-left">X<sup>3</sup></td>
<td class="org-left">X<sup>2</sup></td>
<td class="org-left">X<sup>1</sup></td>
<td class="org-left">X<sup>0</sup></td>
</tr>
</tbody>
</table>
<p>
<del>-----------</del>--------<del>------</del>-------<del>--------</del>-&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">位串</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-left">(5位)</td>
</tr>
</tbody>
</table>
<p>
<del>-----------</del>--------<del>------</del>-------<del>--------</del>-&#x2013;&#x2014;+
2&gt;待编码位串:100111011101 补4位0得新待编码位串 1001110111010000
3&gt;新待编码位串/以多项式对应的比特串得余数为1100;(过程如下)
            1010000000
  10111√1001110111010000
        10111          模2减法运算为：1-1=0，0-1=1，1-0=1，0-0=0
          10010        相当于异或运算;同0异1;同假异真; //无进位，无借位
          10111
            10111
            10111
                 10100
                 10111
                    1100
4&gt;待编码位串+上步余数=100111011101|1100
</p>

<p>
*5.接收方在收到带校验和的帧后,怎样判断是否有错?
   收到的串除以多项式对应的比特串;
   余数为0,无错, 余数不为0,有错,丢弃;
</p>

<p>
*6.优选的典型G(x)
</p>
<p>
<del>----------------</del>-----------------------------------------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">名称</td>
<td class="org-left">生成多项式</td>
</tr>
</tbody>
</table>
<p>
<del>----------------</del>-----------------------------------------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">CRC-12</td>
<td class="org-left">x12+x11+x3+x2+x+1</td>
</tr>
</tbody>
</table>
<p>
<del>----------------</del>-----------------------------------------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">CRC-16</td>
<td class="org-left">x16+x15+x2+1</td>
</tr>
</tbody>
</table>
<p>
<del>----------------</del>-----------------------------------------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">CRC-CCITT</td>
<td class="org-left">x16+x12+x5+1</td>
</tr>
</tbody>
</table>
<p>
<del>----------------</del>-----------------------------------------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">CRC-32-IEEE802.3</td>
<td class="org-left">x32+x26+x23+x22+x16+x12+x11+x10+x8+x7+x5+x4+x2+x+1</td>
</tr>
</tbody>
</table>
<p>
<del>----------------</del>-----------------------------------------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">CRC-64-ISO</td>
<td class="org-left">x64+x4+x3+x+1</td>
</tr>
</tbody>
</table>
<p>
<del>----------------</del>-----------------------------------------------&#x2013;&#x2014;+
</p>
</div>
</div>
