org/计算机网络原理笔记.org
** 多路访问控制协议
 0.数据链路层使用的信道
   1> 点对点信道,一对一通信方式,信道被双方独享;如拨号上网;
   2> 广播信道(共享介质),一对多通信方式,信道上连接的点很多,信道被结点共享; 如总线以太网, WIFI
                 ↓
      两个或两个以上结点同时传输数据: 冲突->接收失败;
                 ↓
      多路访问控制(Multiple Access Control,MAC)协议;
                 ↓
      MAC协议的根本任务: 解决信道的共享问题(填空选择);

 1.信道划分MAC协议
  0>信道划分MAC协议:利用多路复用技术实现信道共享的MAC;
     多路复用的基本思想: 将信道资源划分后,分配给不同的结点,
     各结点通信时只使用其分配到的资源,避免多结点通信时的相互干扰;

  1>频分多路复用(FDM,Frequency-division multiplexing)
     在频域内将信道带宽划分为多个子信道,将原始信号调制到对应的某个子信道的载波信号上,
     使同时传输的多路信号在整个物理信道带宽的允许范围内 波谱不重叠, 从而共用一个信道;

     信号1->
              | 信号1
              └-------------------  \
     信号2->
              |       信号2                信号1  信号2  信号3
              └-------------------   ->  └------------------- ->
     信号3->
              |              信号3
              └------------------- /
      频率/HZ       频率/HZ                   频分多路复用后
       调制前       调制后

    *1.优点:分路简单,目前模拟通信中常采用,特别是有线和微波通信;
    *2.缺点:信号之间相互干扰,即串扰;
            所需设备输入路数增大而增多;
            不提供差错检测,不便于性能监测;


  2>时分多路复用(TDM,Time-Division Multiplexing)
    在时域内将通信信道的传输信号划分为多个等长的 时隙, 每路信号占用不同的时隙,
    使多路信号合用单一的通信信道在时域上不重叠,从而实现信道共享;

   *1.同步时分多路复用(STDM,Synchronism Time-Division Multiplexing)
      按照固定顺序把时隙分配给各路信号;

   *2.异步时分多路复用(ATDM,Asynchronism Time-Division Multiplexing)
      统计时分多路复用(STDM,Statistic Time-Division Multiplexing)
      时隙和用户间没有固定的对应关系; ATM采用的就是异步时分复用方式


  3>波分多路复用(WDM,Wave Division Multiplexing)
     广泛用于光纤通信,在光纤通信中,光载波频率很高,通常用光的波长代替频率讨论;
     在光纤通信中,为了实现长距离的高速传输,通常采用 波分多路复用 和 光纤放大器;


  4>码分多路复用(CDM,Code Division Multiplexing)
     通过利用更长的 相互正交的码组 分别 编码各路原始信息 的每个码元(比如1位),
     使得编码后的信号(已调信号)在同一信道中混合传输,接收端利用码组的正交特性分离各路信号,
     从而实现信道的共享, 是一种 扩频 的通信形式;
     相互正交: 码组1:{1,0,1}
              码组2:{0,1,0}
              1×0+0×1+1×0=0

 2.随机访问MAC协议
   所有用户都可以根据自己的意愿随机地向信道发送信息,
   没有其他用户: 发送成功;
   有两个及以上用户:
   产生 冲突或碰撞,用户发送信息失败,每个用户随机退让一段时间后,再次尝试,直至成功;

  1>ALOHA协议(只说不听):
    最早的, 最基本的 无线数据通信协议;
                 ╭纯ALOHA
    ALOHA协议分类<
                 ╰时隙ALOHA
    1)纯ALOHA
     *1.工作原理:
        任何一个站点有数据发送时就可以直接发送至信道;发送数据后对信道进行侦听:
        如果收到应答信号,说明发送成功;否则说明发生冲突,等待一个随机时间重新发送,直至成功;

      *2.性能:
         G网络负载:表示在一帧的发送时间内发送的平均帧数;
         S吞吐率: 在一帧的发送时间内成功发送的平均帧数;
         网络负载率不能大于0.5;//G≤0.5

    2)时隙ALOHA
     *1.工作原理:
        把信道时间划分为离散的时隙,每个时隙为发送一帧所需的时间,每个通信站点
        只能在每个时隙开始的时刻发送帧,如果在一个时隙内发送帧出现冲突,下一个
        时隙以 概率P 重发该帧,指导帧发送成功, P不能为1 ,否则会出现 死锁;

     *2.性能:网络负载不能大于1;//G≤1

  2>载波监听多路访问协议(CSMA,Carrier Sense Multiple Access)
   *1.工作原理(先听后说)
      通过硬件装置(载波监听装置),在通信站发送数据之前,
      先监听信道上其他站点是否在发送数据,如果在发送,则暂时不发送;

   *2.分类:根据监听策略不同:非坚持CSMA; 1-坚持CSMA; P-坚持CSMA;
      1)非坚持CSMA:
        若通信站有数据发送,先侦听信道,若发现信道空闲,则立即发送数据,若发现信道忙,
        则等待一个随机时间,然后重新开始侦听信道,尝试发送数据,若发送数据时产生冲突,
        则等待一个随机时间,然后重新开始侦听信道,尝试发送数据;

      2)1-坚持CSMA:
        若信道站有数据发送,先侦听信道,若发现信道空闲,则立即发送数据,若发现信道忙,
        则继续侦听信道直至发现信道空闲,然后立即发送数据;

      3)P-坚持CSMA(适用于时隙信道(即同步划分时隙)):
        若通信站有数据发送,先侦听信道,若发现信道空闲,则以概率P在最近时隙开始时刻
        发送数据,以概率Q=1-P延迟至下一个时隙发送, 若下一个时隙仍空闲,重复此过程,
        直至数据发出或时隙被其他通信站占用,若信道忙,则等待下一个时隙,重新开始发送过程,
        若发送数据时发生冲突,则等待一个随机时间,然后重新开始发送过程;

  3>带冲突检测的载波监听多路访问协议(CSMA/CD ,CSMA/Collision Detection)(选择,综合)
    *1.工作原理(先听后说,边听边说)
       通信站点使用CSMA协议进行数据发送,在发送期间如果能检测到碰撞,立即终止发送,并发出
       一个 冲突强化信号,使所有通信站点都知道冲突的发生,发出冲突强化信号后,等待一个
       随机时间,在重复上述过程;

    *2.CSMA/CD的工作状态分为: 传输周期、竞争周期、空闲周期;
               信道有3中状态: 传输状态、竞争状态、空闲状态;

    *3.使用CSMA/CD协议实现多路访问时，通过共享信道通信的两个通信站之间相距的最远距离D，
       信号的传播速度V，数据帧长度L，以及信道信息传输速率R之间满足以下约束:
       数据帧最小长度      两通信站之间的最远距离
          ↓             ↗
        Lmin/R    ≥  2Dmax/V      => 信息传输时延≥2个信息传播时延
             ↑             ↑         (最大冲突检测时间:一个往返传播时延=>1个信号传播+1个冲突信号返回传播)
     信息传输速率  ≥ 2倍的信号传播速率

  例1:在一个采用CSMA/CD协议的网络中,传输介质是一根完整的电缆,数据传输速率为1Gbit/s,
     电缆中的信号传播速度是200000Km/s,若最小数据帧长度减少800bit,
     则最远的两个站点之间的距离至少需要减少多少;
     L=800bit
     V=200000Km/s
     R=1Gbit/s
     D=[(L/R)•V]/2=(800×200000000/1000000000)/2=160/2=80m

  例2.设有长度为1km,数据传输速率为10Mbps的以太网,信号传播速度为200m/μs,
      求MAC帧的最小帧长度;
      D=1×10^3 m   R=1×10^7 bit/s;
      V=200×10^6=2×10^8 m/s
      由 L/R=2D/V
      得:L/1×10^7=2×10^3/2×10^8;
         L=1×10^(-5)×10^7=100bit


 3.受控接入MAC协议
   各个用户不能随意的接入信道而必须服从一定的控制;
   分类: 集中式控制、分散式控制;

  1>集中式控制:
    系统有一个主机负责调度其他通信站接入信道.从而避免冲突;
    方法:轮询(轮叫轮询 和 传递轮询)
                  1        2  ... N-1       N
            ↙   ███  ←  ███  ←  ███   ←   ███ 传递轮询
        收       ↓↑↑      ↓↑↑     ↓↑↑       ↓↑↑
    ██<----------┘┘↑------┘┘↑-----┘┘↑-------┘↑↑轮叫轮询
    〓  -----------┘--------┘-------┘--------┘↑
   主机---------------------------------------┘
        发

  2>分散式控制(令牌技术)
    令牌是一种特殊的帧,代表了通信站使用信道的许可,在信道空闲时
    一直在信道上传输,一个通信站想要发送数据就必须首先获得 令牌;
                            ██
                         ↗  | ↖ 令牌
                       ↗    |    ↖
                     ██─────◎─────██
                       ↘环形|信道 ↗
                         ↘  | ↗
                            ██

  3>令牌环的操作过程:
    *1.网络空闲时,只有一个令牌在环路上绕行;

    *2.当一个站点要发送数据时,必须等待并获取一个令牌,将令牌的标志位置为"1",
       随后便可发送数据;(空令牌:标志位置为"0",被占用:标志位置为"1");

    *3.环路中的每个站点边转发数据,边检测数据帧中的目的地址,
       若为本站点的地址,便读取其中所携带的数据;

    *4.数据帧环绕一周返回时,发送站将其从环路撤销, 即"自生自灭";

    *5.发送站点完成数据发送后,重新产生一个令牌传至下一个站点,
       以使其它站点获得发送数据帧的许可;

  4>令牌丢失 和 数据帧无法撤销 是环网上最严重的两种错误;

