public/计算机网络原理笔记.html

<div id="outline-container-orga4424eb" class="outline-3">
<h3 id="orga4424eb">局域网(LAN)</h3>
<div class="outline-text-3" id="text-orga4424eb">
<p>
1.数据链路层 与 ARP寻址
 1&gt;局域网(LAN):一般采用 广播 的方式,局部区域网络,覆盖面积小,网络传输 速率高,传输的 误码率低;
 2&gt;为了使数据链路层更好的适应多种局域网标准,IEEE802委员会将局域网的数据链路层拆分为两个子层:
   *1.逻辑链路控制(Logical Link Control,LLC)子层(面向网络层, 名存实亡)
   *2.介质访问控制MAC子层;//在数据链路层子层中,与介质访问控制有关的子层;
</p>

<p>
3&gt;MAC地址(物理地址、局域网地址)
  MAC地址具有 唯一性,每个接口(网络适配器,NIC)对应一个MAC地址;
  *1.以太网和IEEE 802.11无线局域网,使用的MAC地址长度为 6字节,共2<sup>48个可能的MAC地址</sup>;
     48位 的MAC地址通常采用 十六进制 表示法,每个字节表示一个十六进制,用-或:连接起来;
     例如: 00-2A-E1-76-8C-39 或 00:2A:E1:76:8C:39
     补充:十六进制:0,1,2,3,4,5,6,7,8,9,A,B,C,D,E,F;
</p>

<p>
*2.MAC地址空间的分配由电器和电子工程协会(IEEE,Institute of Electrical and Electronics
   Engineers)统一管理;MAC共48位,IEEE负责分配MAC地址前24位的MAC地址块,厂商自己分配后24位;
</p>

<p>
*3.MAC广播地址: FF-FF-FF-FF-FF-FF ;
</p>

<p>
4&gt;地址解析协议(ARP,Address Resolution Protocol)
  ARP是根据本网内目的主机或默认网关的 IP地址 获取其 MAC地址;(IP地址到MAC地址的映射)
  *1.ARP的基本思想:
     在每一台主机中设置专用内存区域,称为ARP高速缓存(也称为ARP表),
     存储该主机所在局域网中,其他主机和路由器的 IP地址 与 MAC地址 的映射关系;
  *2.ARP协议内容
    1)ARP查询分组是通过一个 广播帧 发送的,而ARP响应分组是通过一个标准的 单播帧 发送的;
    2)ARP是 即插即用的 , 一个ARP表是自动建立的, 他不需要系统管理员来配置; 一般存放20min;
    3)即可认为是网络层协议(IP) 也可认为是数据链路层协议(MAC);
</p>

<p>
<del>--------------</del>-------------------<del>----------</del>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">IP地址</td>
<td class="org-left">MAC地址</td>
<td class="org-left">TTL</td>
</tr>
</tbody>
</table>
<p>
<del>--------------</del>-------------------<del>----------</del>
</p>
<table>


<colgroup>
<col  class="org-right">

<col  class="org-left">

<col  class="org-right">
</colgroup>
<tbody>
<tr>
<td class="org-right">178.169.1.96</td>
<td class="org-left">00-53-2B-49-1A-1F</td>
<td class="org-right">13:45:00</td>
</tr>
</tbody>
</table>
<p>
<del>--------------</del>-------------------<del>----------</del>
</p>
<table>


<colgroup>
<col  class="org-right">

<col  class="org-left">

<col  class="org-right">
</colgroup>
<tbody>
<tr>
<td class="org-right">178.169.1.94</td>
<td class="org-left">00-BD-2A-90-17-C2</td>
<td class="org-right">13:52:00</td>
</tr>
</tbody>
</table>
<p>
<del>--------------</del>-------------------<del>----------</del>
</p>

<p>
2.以太网
 1&gt;以太网(IEEE802.3):目前最流行的 有线局域网 技术,无连接不可靠服务;
   IEEE802.3MAC帧的起始定界符SFD字段的比特模式为:10101011
</p>

<p>
2&gt;以太网成功的原因(物美价廉)(4条)
 *1.以太网是 第一个 广泛部署的高速局域网;
 *2.令牌环网、FDDI(光纤分布式数据接口)、ATM(异步传输模式)比以太网更加复杂、昂贵;
 *3.以太网在 数据速率 方面比 FDDI、ATM(只参加第一层功能)毫不逊色;
 *4.以太网硬件价格极其便宜,网络造价成本低;
 *5.以太网在发送数据时,若发生冲突采用 截断二进制指数退避 算法计算推迟的随机时间;
</p>

<p>
3&gt;经典的以太网是采用 粗同轴电缆 连接的总线型 以太网(10Base-5)
 *1.数据传输速率为10Mbit/s,无连接不可靠;
 *2.相距最远主机信号往返的传播时延为51.2μs,所以以太网最短帧长为 64字节;
 *3.网段和网段之间用中继器连接,最多有4个中继器;
 *4.MAC协议采用CSMA/CD协议(带冲突检测的载波监听多路访问协议);
 *5.Base是采用的基带传输,5是可连接5个网段;
  数据传输速率为10Mbit/s, 信号往返的传播时延为51.2μs,所以以太网最短帧长为64字节;
  R=10Mbit/s, 2dp=51.2μs;
  Lmin/R=2D/V=2dp
  L=51.2•10=512bit=512/8=64字节;
</p>

<p>
4&gt;以太网帧结构
     6字节     6字节   2字节  46-1500字节  4字节
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">目的地址</td>
<td class="org-left">源地址</td>
<td class="org-left">类型</td>
<td class="org-left">数据</td>
<td class="org-left">CRC</td>
</tr>
</tbody>
</table>
<p>
   MAC地址  MAC地址
*1.目的地址和源地址: MAC地址;
*2.类型:标识上层协议,例如:0x0800=IP数据报
*3.数据:封装的上层协议的分组;
*4.CRC:校验采用循环冗余校验;
*5.以太网最短帧长64字节(首部+数据),18字节(首部长度),46字节(数据字段长度) ;
</p>

<p>
5&gt;以太网技术
</p>
<p>
<del>-----------</del>----------------------<del>---------</del>--------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">分类</td>
<td class="org-left">传输介质</td>
<td class="org-left">传输速率</td>
<td class="org-left">标准</td>
</tr>
</tbody>
</table>
<p>
<del>-----------</del>----------------------<del>---------</del>--------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">10Base-5</td>
<td class="org-left">粗同轴电缆</td>
<td class="org-left">10Mbit/s</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<p>
<del>-----------</del>----------------------<del>---------</del>--------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">10Base-T</td>
<td class="org-left">非屏蔽双绞线(UTP)</td>
<td class="org-left">10Mbit/s</td>
<td class="org-left">IEEE 802.3</td>
</tr>
</tbody>
</table>
<p>
<del>-----------</del>----------------------<del>---------</del>--------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">100Base-T</td>
<td class="org-left">UTP</td>
<td class="org-left">100Mbit/s</td>
<td class="org-left">IEEE 802.3u</td>
</tr>

<tr>
<td class="org-left">(快速以太网)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<p>
<del>-----------</del>----------------------<del>---------</del>--------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">千兆位以太网</td>
<td class="org-left">光纤,UTP,屏蔽双绞线(STP)</td>
<td class="org-left">1000Mb/s</td>
<td class="org-left">IEEE 802.3标准的扩展</td>
</tr>
</tbody>
</table>
<p>
<del>-----------</del>----------------------<del>---------</del>--------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">万兆位以太网</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">10Gbit/s</td>
<td class="org-left">IEEE 802.3ae</td>
</tr>
</tbody>
</table>
<p>
<del>-----------</del>----------------------<del>---------</del>--------------&#x2013;&#x2014;+
</p>


<p>
3.交换机
 1&gt;交换机:应用最广泛的数据链路层设备; 实现帧的转发;(实现存储-转发)
</p>

<p>
网桥:和交换机功能类似,对数据帧实现存储-转发,
     交换机可以认为是多端口的网桥
</p>

<p>
集线器(Hub):物理层:转发数据;
</p>

<p>
2&gt;以太网交换机转发和过滤
 *1.交换机的基本工作原理
    当一帧达到时,交换机首先需要决策将该帧丢弃还是转发,
    如果是转发,还必须进一步决策应该将 该帧 转发到哪个/些
    端口去,决策依据是,以 目的MAC为主键 查询内部转发表;
    转发表:通过自学算法建立起来;
</p>

<p>
*2.以太网交换机的自学习(建立转发表)
  1)以太网交换机有4个端口,各连接一台计算机,其MAC地址分别是A,B,C,D;
  2)一开始,以太网交换机里面的转发表是空白的;
  3)A向B发送一个帧,从端口1进入交换机;
  4)交换机查询转发表,没找到往哪里转发该帧;
  5)交换机把这个帧的源MAC地址A和端口1写入交换表,完成第一次学习;
  6)除向端口1以外所有端口泛洪(广播)这个帧;
  7)C和D丢失该帧,B收下该帧;
</p>

<p>
3&gt;以太网交换机的优点
  1)消除冲突(*1)     //交换机可以隔离冲突域,但不能隔离广播域
  2)支持异质链路;
  3)易于进行网络管理;
</p>

<p>
*1.冲突域:早期所有主机共享总线的一个网络范围,现在在以太网中,CSMA/CD 能检测到冲突的网络范围;
</p>


<p>
4.虚拟局域网(VLAN,Virtual Local Area Network)
 1)虚拟局域网:是一种基于交换机(必须支持VLAN功能) 逻辑分割(或限制)
   广播域的局域网应用形式,以 软件 的方式划分和管理 局域网中的工作组,
   限制接收广播信息的主机数,不会因传播过多的广播信号而引起性能的恶化;
   端口交换(Port Switch) 帧交换(Frame Switch), 信元交换(Cell Switch)
</p>

<p>
2)划分虚拟局域网的方法(3种)
 *1.基于 交换机端口 划分;
 *2.基于 MAC地址 划分;
 *3.基于 上层协议类型或地址 划分;
</p>
</div>
</div>
