public/计算机网络原理笔记.html


<div id="outline-container-orgd7d8b95" class="outline-3">
<h3 id="orgd7d8b95">点对点链路协议</h3>
<div class="outline-text-3" id="text-orgd7d8b95">
<p>
1.点对点协议(PPP协议,Point to Point Protocol)
 1&gt;是全世界使用得最多的点对点链路协议,适合单个发送方和单个接收方的点对点链路;
</p>

<p>
2&gt;PPP主要提供3类功能
  1)成帧:确定一帧的开始和结束, 支持错误检测
        开始标志字节：01111110
        结束标志字节：01111110
</p>

<p>
1字节       1字节      1字节    1或2字节  可变长度 2和4字节  1字节
</p>
<table>


<colgroup>
<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-right">
</colgroup>
<tbody>
<tr>
<td class="org-right">标志</td>
<td class="org-right">地址</td>
<td class="org-right">控制</td>
<td class="org-left">协议</td>
<td class="org-left">信息</td>
<td class="org-left">校验和</td>
<td class="org-right">标志</td>
</tr>

<tr>
<td class="org-right">01111110</td>
<td class="org-right">11111111</td>
<td class="org-right">00000011</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">01111110</td>
</tr>
</tbody>
</table>

<p>
2)链路控制协议(LCP,Link Control Protocol)
   启动线路、检测线路、协商参数、关闭线路;
</p>

<p>
3)网络控制协议(NCP,NetWork Control Protocol)
   协商网络层选项; 初始网络参数;
</p>

<p>
3&gt;PPP是面向字节的
  PPP帧的长度都是整数字节;
  遇到数据中有标志位 01111110时,使用字节填充技术
  在01111110标志位后,插入特殊的控制转义字节01111101;
  传输数据为 Byte1 01111110 Byte2
  PPP帧: Byte1 01111110  01111101 Byte2;
  控制字段是00000011     字节填充技术
</p>

<p>
2.高级数据链路控制协议(HDLC协议,High-level Data Link Control)
 1&gt;应用于点对点链路和点对多点链路;无站地址不分配给任何站,仅做测试;
</p>

<p>
2&gt;HDLC帧格式(6字节)
</p>

<p>
1字节     1字节  1字节  ≥0字节  2字节     1字节
</p>
<table>


<colgroup>
<col  class="org-right">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-right">
</colgroup>
<tbody>
<tr>
<td class="org-right">01111110</td>
<td class="org-left">地址</td>
<td class="org-left">控制</td>
<td class="org-left">数据</td>
<td class="org-left">校验和</td>
<td class="org-right">01111110</td>
</tr>
</tbody>
</table>

<p>
3&gt;根据控制位的不同,HDLC有3种类型的帧
  1)信息帧(I格式):传送数据;
  2)管理帧(监控帧)(S格式):差错控制,流量控制
  3)无序号帧(U格式):链路的建立,拆除
  S帧第1,2位为"10"来标志,第3,4字段为S帧类型编码 00(接收就绪),01(拒绝),10(接收未就绪),11(选择拒绝);
</p>

<p>
4&gt;HDLC协议是面向位的
  使用位填充技术;
  数据字段出现与标志字段相同的比特流   1 0 0|0 1 1 1 1 1 1 0|0 1 0 0 1 0
</p>

<p>
发送端: 发现5个连续的1后插入0       1 0 0 0 1 1 1 1 1 0 1 0 0 1 0 0 1 0
                                                    ↑
                                 发送数据只要连续出现5个1发送端插入0
接收端: 发现5个连续的1后删除其后的0  1 0 0 0 1 1 1 1 1   1 0 0 1 0 0 1 0
                                                    ↑
                                  接收数据只要连续出现5个1,接收端删除0
</p>

<p>
5&gt;HDLC中常用的操作方式:(3种)
 1)正常响应方式(Normal Responses Mode,NRM)
 2)异步响应方式(Asynchronous Response Mode,ARM)
 3)异步平衡方式(Asynchronous Balanced Mod, ABM)
</p>
</div>
</div>
</div>
<div id="outline-container-orgc60fd72" class="outline-2">
<h2 id="orgc60fd72">第六章 物理层</h2>
<div class="outline-text-2" id="text-orgc60fd72">
</div>
<div id="outline-container-orge3ea4e5" class="outline-3">
<h3 id="orge3ea4e5">数据通信基础</h3>
<div class="outline-text-3" id="text-orge3ea4e5">
<p>
1.数据通信基本概念
 1)信息与消息
  *1.消息: 人类能够感知的描述; 文字/图像/声音/气味, 消息是信息的载体;
  *2.信息: 对事物状态或存在方式的不确定性表述; 消息中包含的有意义的内容;
</p>

<p>
2)通信:在一点精确或近似地再生另一点的信息;
3)通信系统:能够实现通信功能的各种技术、设备和方法的总体;
4)信号:在通信系统中,传递信息需要合适的载体在传输道中传播,这个载体就是信号;
5)数据:对客观事物的性质状态以及相互关系等进行记录的符号及其组合,(数字、文字、图像/抽象符号)
6)信道: 信息传输的介质
</p>

<p>
2.数据通信系统模型
 1&gt;数据通信系统的构成(通信系统的一般模型):6个部分
   1.信源&#x2013;&gt;2.发送设备&#x2013;&gt;3.信道&#x2013;&gt;4.接收设备&#x2013;&gt;5.信宿
                           ↓
                       6.噪声源
                                   1  0  1  0  1  0 1  0
  1)信源:将消息转换为信号的设备;   ▁|▔|▁|▔|▁|▔|▁|▔|▁ 信源
                                             ↓
                                ▁╱╲  ╱╲  ▁╱╲   ╱╲   ▁ 发送设备
  2)发送设备(进行编码和调制)          ╲╱  ╲╱    ╲╱   ╲╱
    将信源产生的信号进行适当变换的装置;      | ↓ |
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">↓</td>
<td class="org-left">信道</td>
</tr>
</tbody>
</table>
<p>
3)信道:传输信号的媒介;                    | ↓ |           噪声源
</p>
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">↓</td>
</tr>
</tbody>
</table>
<p>
4)接收设备(进行译码和解调)       ▁|▔|▁|▔|▁|▔|▁|▔|▁ 接收设备
  完成发送设备的反变换                      ↓
                                 1  0  1  0  1  0 1  0   信宿
5)信宿:信号的终点,将信号转换为功人们识别的消息;
</p>

<p>
6)噪声源:自然界和通信设备所固有的,对通信信号产生干扰和影响的各种信号;
</p>

<p>
2&gt;模拟通信和数字通信
 1)模拟信号
   信号的因变量完全随连续消息的变化而变化的信号;
   ①自变量:可以是连续的,可以是离散的;
   ②因变量:一定是连续的(不可列举);
</p>

<p>
y(t)↑
</p>
<table>


<tbody>
<tr>
</tr>
</tbody>

<tr>
<td class="org-left">•     •         •        •</td>
</tr>

<tr>
<td class="org-left">•   •  •  •     •   •    •    •</td>
</tr>

<tr>
<td class="org-left">•      •      •  •      •</td>
</tr>
</tbody>
</table>
<p>
•   •                •
</p>
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">•</td>
</tr>
</tbody>
</table>
<p>
 └-----------------------------------&#x2013;&#x2014;&gt;
0               模拟信号                  t
</p>

<p>
2)数字信号
  ①自变量:离散的(可列举);
  ②因变量:离散的;
  ③离散数据是连续数据的采样;
</p>

<p>
y(t)↑
</p>
<table>


<tbody>
<tr>
</tr>
</tbody>

<tr>
<td class="org-left">1  0    1 1 0 0 1</td>
</tr>
</tbody>
</table>
<p>
├──┐     ┌─────┐     ┌───┐
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<p>
 └&#x2013;┘&#x2013;&#x2014;└&#x2013;&#x2014;┘&#x2013;&#x2014;└&#x2014;┘-----&#x2013;&#x2014;&gt;
0             数字信号                t
</p>

<p>
3&gt;数据通信方式
 1)数据传输方向:单向通信(单工)、双向交替通信(半双工)和双向同时通信(全双工);
 2)数据传输时空顺序:并行通信和串行通信;
                    1
           并行通信  0
                    0
</p>
<table>


<colgroup>
<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>

<p>
串行通信 1001
</p>

<p>
3)数据同步技术
  异步通信:发送 字符, 不需建立同步时钟,实现简单,适用低速网络;
  同步通信:发送 数据块, 双方建立同步时钟,实现复杂,适用高速网络;
</p>

<p>
4)数据通信系统的功能
 *1.信道的利用;
 *2.接口及信号产生;
 *3.同步;
 *4.差错检测与纠正;
 *5.寻址与路由;
 *6.网络管理;
 *7.安全保证;
</p>

<p>
5)对于数字电话、数字电视等数字通信系统,与模拟系统相比
  其传输具有 保密性好 和 抗干扰性强 两个显著的优点;
</p>
</div>
</div>
