org/计算机网络原理笔记.org
** 物理介质
 1.导引型传输介质(有线信道)
   以导线为传输介质,信号沿导线进行传输,信号的能量集中在导线附近,
   因此传输效率高,但部署不够灵活;(架空明线, 双绞线, 同轴电缆, 光纤)

  1>架空明线
    优点:传输损耗较低;
    缺点:易受天气和外界电磁干扰;
         对外界噪声敏感;
         带宽有限;

  2>双绞线
    将两根相互绝缘的铜线并排绞合在一起,可以减少对相邻导线的电磁干扰,
    这样的一对线称为 双绞线; (STP屏蔽双绞线 和 UTP非屏蔽双绞线)

    1)屏蔽双绞线(STP):(性能好,价格高,安装工艺复杂)
      (聚氯乙烯套层(屏蔽层(绝缘体(铜线))))

    2)非屏蔽双绞线(UTP)(适用更普遍)
      (聚氯乙烯套层(绝缘体(铜线)))

    3)美国电子工业协会规定了 5种 非屏蔽双绞线(UTP)标准
      +-----------+----------+----------------------------------------+
      |  UTP分类  |  带宽/MHz |               典型应用                 |
      +-----------+----------+----------------------------------------+
      |     3	  |    16    | 低速网络,电话网络;                       |
      +-----------+----------+----------------------------------------+
      |     4	  |    20    | 10Base-T以太网                          |
      +-----------+----------+----------------------------------------+
      |     5     |   100    | 10Base-T以太网,100Base-T快速以太网       |
      +-----------+----------+----------------------------------------+
      | 5E(超5类) |   100    | 100Base-T快速以太网, 1000Base-T千兆以太网 |
      +-----------+----------+----------------------------------------+
      |     6     |   250    | 100Base-T千兆以太网, ATM网络             |
      +-----------+----------+----------------------------------------+


  3>同轴电缆
    对外界干扰具有较好的屏蔽作用,具有较好的抗电磁干扰性能,目前多用于 有线电视 网络;
    (绝缘保护外套(绝缘保护套层(绝缘层(内导体))))

  4>光纤
   1)基本原理是利用了光的 全反射 现象;
     (包层(纤芯[入射角,折射角])
       ↓           ↘
    低折射率的媒体   高折射率的媒体

   2)按光纤内光波传输模式的不同: 单模光纤;  多模光纤;

   3)光纤优点
    *1.光纤通信容量非常大,最高可达100Gbit/s
    *2.传输损耗小,中继距离长,对远距离传输特别经济;
    *3.抗雷电和电磁干扰性好;
    *4.无串音干扰,保密性好,也不易被窃听或截取数据;
    *5.体积小,重量轻;

   4)缺点: 易脆断;

 2.非导引型传输介质(无线信道)
   电磁波在自由空间的传播;
   频率越高,波长越小;
  1>根据电磁波频率、通信距离与位置的不同，电磁波的传播可以分为
  +----------------------+---------+-------------------+
  | 电磁波传播方式 		 |传输速率  |   距离地表高度     |
  +----------------------+---------+-------------------+
  | 地波传播          	 |2MHz以下 |    沿地表(WIFI)    |
  +----------------------+---------+-------------------+
  | 天波传播(电离层反射波) | 2-30MHz |  距离地表60-400Km  |
  +----------------------+---------+-------------------+
  | 视线传播(两点间无障碍) |高于30MHz|   电离层之上(卫星)  |
  +----------------------+---------+-------------------+

** 信道与信道容量
 1.信道分类与模型
  1>信道:通信系统中连接发送端与接收端的通信设备,实现从发送端到接收端的信号传送。
   1)狭义信道:仅指信号的传输介质;
   2)广义信道:包括传输介质和通信系统中的一些变换装置;(调制信道(连续信道) 和 编码信道(离散信道))
   3)广义信道的分类与组成
   
     信源->编码器->调制器->发射设备->传输介质->接收设备->解调器->译码器->信宿;
                 |      |----------调制信道---------|       |
                 |-----------------编码信道-----------------|

    *1.编码信道:数字信号由 编码器输出端 传输到 译码器输入端 经过的部分;  输入/出信号离散  离散信道
    *2.调制信道:从 调制器的输出端 传输到 解调器的输入端 经过的部分;      输入/出信号连续  连续信道

 2.信道传输特性
   不同类型的信道对信号的影响差异较大：随参信道 和 恒参信道
   1)随机参数信道(随参信道)：信号通过信道发生畸变是 时变的。
     传输特性: 大部分无线信道(依靠地波和天波传播的无线电信道)
     *1.信号的传输衰变随时间随机变化;
     *2.信号的传输时延随时间随机变化;
     *3.存在 多径 传播现象;

   2)恒定参数信道(恒参信道)：信号通过信道发生畸变和 时间无关。
     传输特性: 各种有线信道和部分无线信道(微波视线传播链路、卫星链路)
     *1.对信号幅值产生 固定的 衰减;
     *2.对信号输出产生 固定的 时延;

 3.信道容量
  1>信道容量概念
   0)信道容量:信道无差错传输信息的最大平均信息速率,是用来描述或衡量 信道的传输能力;
   1)信道的宽带:指能够有效通过该信道的信号的 最大频带宽度,用码元速率(或符号速率)描述, 单位:Baud;
   2)传输速率是信道 单位时间 内传输的码元(或符号)或信息的能力用传信率(或信息速率)描述,单位bit/s;

  2>连续信道容量(调制信道)
   1)奈奎斯特理想的,无噪音的信道容量
     /**
      * C:信道容量 单位bit/s;
      * B:信道带宽,单位Hz;
      * M:进制数,信号状态数;
      */
      C=2Blog₂M; //信道容量=2(信道带宽)log₂信号状态数
      最大信号传输速率=2B;//2倍带宽(最大频带利用率)
      
     示例.利用带宽为4000Hz的无噪声信道传输二进制基带信号,求最大的数据传输速率(信道容量);
     C=2×4000log₂2=8000bps; (M=2;//二进制)

   2)香农有噪声连续信道容量
     /**
      * C:信道容量 单位bit/s;
      * B:信道带宽,单位Hz;
      * S:输入信号功率
      * N:高斯白噪音的功率
      * S/N: 信噪比;
      */
       C=Blog₂(1+S/N);// 信道容量=带宽log₂(1+信噪比)

     信噪比的单位为功率,但题目中一般给到的是分贝(dB)
     分贝和功率的换算公式:
     (S/N)dB=10log10(S/N)功率 <=>(S/N)功率=10^(dB/10)

     示例:
     已知某信道带宽为8kHz,信噪比为30dB,试求该信道的信道容量C;
     解(S/N)dB=10log10(S/N)功率;
     30=10log10(S/N)功率 简化得 3=log10(S/N)功率
     可得: S/N=1000;
     C=Blog₂(1+S/N)
      =8×10³log₂(1+1000)
      =8×10³×log₂(1001)
      ≈80kbit/s

