org/计算机网络原理笔记.org
** 基带传输
 1.基带传输基本概念
   1>基带信号: 信源发出的没有经过调制的原始信号;
     模拟信源: 发出的原始信号是 模拟基带信号;(电话)
     数字信源: 发出的原始信号是 数字基带信号;(计算机)
     基带传输: 直接在信道传送基带信号;
     基带传输系统: 在信道中传输数字基带信号,相应的系统成为数字基带传输系统;
     数字基带传输系统结构:

     数字基带信号                                      再生数字基带信号
     ----------->信号形成器->信道->接收过滤器->抽样判决器--------------->
                              ↓           ↓    ↑
                             噪声      同步提取-┘

 2.数字基带传输编码
  1>将数据映射为脉冲信号的 信息码(5种);
   1)单极不归零码(Not Return to Zero,NRZ)
     *1.脉冲幅值要么是正电平,要么是零电平,只有一个极性; 单极
     *2.整个脉冲持续时间内,电平保持不平,且脉冲持续期结束也不要求回归零电平; 不归零
     二进制 0:零电平表示, 1:正电平表示;
     例如: 1100100111
     y(t)↑
         |
         | 1 | 1 | 0 | 0 | 1 | 0 | 0 | 1 | 1 | 1 |
         ├───┼───┐   |   ├───┤   |   ├───┼───┼───┤
         |   |   |   |   |   |   |   |   |   |   |
         |   |   |   |   |   |   |   |   |   |   |
         └---|---|---|---└---|---|---|---|---|---|--->
        0              单极不归零码信号波形          t

   2)单极归零码(Return to Zero , RZ)
     每个正脉冲持续期的 中间时刻, 电平要由正电平回到零电平;
     二进制 0:零电平表示, 1:正电平表示;
     例如: 1100100111
     y(t)↑
         |
         |  1  |  1  |  0  |  0  |  1  |  0  |  0  |  1  |  1  |  1  |
       +E├──┐  ├──┐  |     |     ├──┐  |     |     ├──┐  ├──┐  |──┐  |
         |  |  |  |  |     |     |  |  |     |     |  |  |  |  |  |  |
         |  |  |  |  |     |     |  |  |     |     |  |  |  |  |  |  |
         └--┴--├--┴--|-----├-----├--┴--|-----|-----├--┴--├--┴--├--┴--|-->
        0                    单极归零码信号波形                        t


   3)双极不归零码
     每个正、负脉冲持续期的中间时刻,电平都要回到零电平;
     二进制 0:负电平表示, 1:正电平表示;
     例如: 1100100111
     y(t)↑
         |
         | 1 | 1 | 0 | 0 | 1 | 0 | 0 | 1 | 1 | 1 |
       +E├───┼───┐   |   ├───┐   |   ├───┼───┼───┤
         |   |   |   |   |   |   |   |   |   |   |
         |   |   |   |   |   |   |   |   |   |   |
        0|---┴---┼---┼---┼---┼---|---┼---|---|---|---->
         |       |   |   |   |   |   |   |   |   |   t
         |       |   |   |   |   |   |   |   |   |
       -E|       └───┼───┘   └───┼───┘   |   |   |

                  双极不归零码信号波形
   4)双极归零码
     每个正、负脉冲持续期的中间时刻,电平都要回到零电平;
     二进制 0:负电平表示, 1:正电平表示;
     例如: 1100100111
     y(t)↑
         |
         |  1  |  1  |  0  |  0  |  1  |  0  |  0  |  1  |  1  |  1  |
       +E├──┐  ├──┐  |     |     ├──┐  |     |     ├──┐  ├──┐  |──┐  |
         |  |  |  |  |     |     |  |  |     |     |  |  |  |  |  |  |
         |  |  |  |  |     |     |  |  |     |     |  |  |  |  |  |  |
        0|--┴--|--┴--┼--┐--┼--┐--|--┴--┼--┐--┼--┐--┼--┴--|--┴--|--┴--|-->
         |     |     |  |  |  |  |     |  |  |  |  |     |     |     | t
         |     |     |  |  |  |  |     |  |  |  |  |     |     |     |
       -E|     |     └──┘  └──┘  |     └──┘  └──┘  |     |     |     |

                              双极不归零码信号波形


   5)差分码(相对码)
     利用电平的变化与否来表示信息;
     和前一个脉冲时间的电平比, 当前脉冲时间表示0 波形无跳变 , 表示1时, 波形有跳变
     二进制 0:相邻电平无跳变, 1:相邻电平有跳变;*.这个也要看题目给出的限制,有时候相反;
     例如:1100100111(默认初始为零电平)
     y(t)↑
         |
         | 1 | 1 | 0 | 0 | 1 | 0 | 0 | 1 | 1 | 1 |
         ├───┤   |   |   ├───┼───┼───┤   ├───┤   |
         |   |   |   |   |   |   |   |   |   |   |
         |   |   |   |   |   |   |   |   |   |   |
         └---|---|---|---└---|---|---|---|---|---|--->
        0              差分码信号波长                t

  2>将数字基带信号的 基本码型 变换为合适传输的数字传输基带 传输码型
    AMI码; 双相码; 米勒码; CMI码; nBmB码; nBmT码;
   1)信号交替反转码(Alternative Mark Inversion , AMI码)
     用3中电平(正电平、负电平、零电平)进行编码;
     0:零电平表示;
     1与-1:交替用正电平和负电平表示;
     例如:1100100111(默认初始为零电平)
     | 1 | 1 | 0 | 0 | 1 | 0 | 0 | 1 | 1 | 1 |
     |+1 |-1 | 0 | 0 |+1 | 0 | 0 |-1 |+1 |-1 |
     y(t)↑
         |
         |1 |1 |0 |0 |1 |0 |0 |1 |1 |1 |
       +E├──┤  |  |  ├──┐  |  |  ├──┐  |
         |  |  |  |  |  |  |  |  |  |  |
         |  |  |  |  |  |  |  |  |  |  |
        0|--|--┼--┴--└--┴--┴--┼--┼--┼--|----->
         |  |  |              |  |  |  |    t
         |  |  |              |  |  |  |
       -E|  └──┘              └──┘  └──┘
               AMI(RZ)码信号波

   2)双相码(Biphase Code),又叫曼彻斯特(Manchester)码
     只有正负电平,脉冲持续时间的中间时刻都要进行 电平跳变
     1:正电平跳到负电平(1:正负);
     0:负电平跳到正电平(0:负正);
    例如:11001001(默认初始为零电平)
     y(t)↑
         |
         |  1  |  1  |  0  |  0  |  1  |  0  |  0  |  1
       +E├──┐  |──┐  |  ┌──┐  ┌──┼──┐  |  ┌──┤  ┌──┼──┐  |
         |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |
         |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |
        0|--|--|--|--|--|--|--|--|--|--|--|--|--|--|--|--|----->
         |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |    t
         |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |
       -E|  └──┘  └──┼──┘  └──┘  |  └──┼──┘  └──┘  |  └──┘
                            曼彻斯特信号波形

   2-1)差分双相码(差分曼彻斯特码)
     1:相邻电平有跳变 (和前一个电平的落脚点不同,前一个落脚到负,当前从正开始, 反之从负开始)
     0:相邻电平无跳变 (和前一个电平的落脚点相同,前一个落脚到负,当前从负开始, 反之从正开始)
     例如:11001001(默认初始为零电平)

     y(t)↑
         |
         |  1  |  1  |  0  |  0  |  1  |  0  |  0  |  1
       +E├──┐  ├──┐  |  ┌──┼──┐  ├──┐  |  ┌──┼──┐  ├──┐  |
         |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |
         |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |
        0|--|--|--|--|--|--|--|--|--|--|--|--|--|--|--|--|----->
         |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |    t
         |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |
       -E|  └──┘  └──┼──┘  |  └──┘  └──┼──┘  |  └──┘  └──┘
                            差分双相码信号波形

   3)米勒码(Miller Code): 延迟调制码
     1：正负或负正。
     11：交替编码。前面正，后面负；前面负，后面正;
     0：延续前面1的电平，正或负。脉冲期间不跳变。
     00：交替编码, 前面正，后面负；前面负，后面正;
     01：延续0的电平，正负或负正
     10: 延续前面1的电平,脉冲期间不跳变;

     1 1 00 10110 1

     y(t)↑
         |
         |  1  |  1  |  0  |  0  |  1  |  0  |  1  |  1  |  0  |  1  |
       +E├──┐  |  ┌──┼─────┤     |  ┌──┼─────┼──┐  |  ┌──┼─────┼──┐  |
         |  |  |  |  |     |     |  |  |     |  |  |  |  |     |  |  |
         |  |  |  |  |     |     |  |  |     |  |  |  |  |     |  |  |
        0|--|--|--|--|-- --|-----|--|--|-----|--|--|--|--|-----|--|--|->
         |  |  |  |  |     |     |  |  |     |  |  |  |  |     |  |  |     t
         |  |  |  |  |     |     |  |  |     |  |  |  |  |     |  |  |
       -E|  └──┼──┘  |     └─────┼──┘  |     |  └──┼──┘  |     |  └──┤
                            CMI码信号波形

   4)传号反转码(Coded Mak Inversion,CMI码)
     1：正、负，交替编码。
     0：负正。
     y(t)↑
         |  正   负   负正
         |  1 |  1 |  0  |   0 |  1 |  0  |   0 |  1 |
       +E├────┤    |  ┌──┤  ┌──┼────┤  ┌──┤  ┌──┤    |
         |    |    |  |  |  |  |    |  |  |  |  |    |
         |    |    |  |  |  |  |    |  |  |  |  |    |
        0|----|----|--|--|--|--|----|--|--|--|--|----|-------->
         |    |    |  |  |  |  |    |  |  |  |  |    |       t
         |    |    |  |  |  |  |    |  |  |  |  |    |
       -E|    └────┼──┘  └──┘  |    └──┘  └──┘  └────┘
                            CMI码信号波形

  例题:下图为曼彻斯特编码和差分曼城斯特编码的脉冲波形,试给出对应的比特串
       (假定差分曼彻斯特编码的初始信号为高电平) //表示初始值 停在 +E
       
     y(t)↑  1:正电平跳到负电平(1:正负);  0:负电平跳到正电平(0:负正);
         |
         |  0  |  1  |  1  |  0  |  0  |  0  |  1  |  1  |
       +E|  ┌──┼──┐  ┌──┐  |  ┌──┐  ┌──┐  ┌──┼──┐  ┌──┐  |
         |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |
         |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |
        0|--|--|--|--|--|--|--|--|--|--|--|--|--|--|--|--|-->
         |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | t
         |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |
       -E└──┘  |  └──┘  └──┼──┘  └──┘  └──┘  |  └──┘  └──┘
                            曼彻斯特信号波形

     y(t)↑ 当前电平起点和前一个电平的落脚点相比,不同电平为1, 相同为0;
         |
         |  1  |  0  |  1  |  0  |  0  |  1  |  0  |  1  |
       +E|  ┌──┼──┐  ┌──┐  |  ┌──┼──┐  ┌──┐  |  ┌──┐  ┌──┐
         |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |
         |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |
        0|--|--|--|--|--|--|--|--|--|--|--|--|--|--|--|--|--->
         |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  | t
         |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |
       -E└──┘  |  └──┘  └──┼──┘  |  └──┘  └──┼──┘  └──┘  |
  初始信号为高电平,        差分曼彻斯特信号波形

