public/计算机网络原理笔记.html

<div id="outline-container-org690bf1e" class="outline-3">
<h3 id="org690bf1e">频带传输</h3>
<div class="outline-text-3" id="text-org690bf1e">
<p>
1.频带传输基本概念
 1&gt;基带信号,具有低通特性(低频信号可通过),可用在低通特性的信道(有线信道)
   中进行传输;无线信道,是带通特性(对频率有要求),因此只能利用基带信号去
   调制与对应信道传输特性相匹配的载波信号;
</p>

<p>
2&gt;数字调制
  利用数字基带信号控制载波信号的特征参量,使载波信号的这些参量的变化
  反映数字基带信号的信息,进而将数字基带信号转为数字通带信号的过程;
</p>

<p>
3&gt;数字解调
  是指在 接收数据端 需将调制到载波信号中的数字基带信号卸载下来,还原为数字基带信号的过程;
</p>

<p>
4&gt;数字频带传输系统:实现 调制、传输 与 解调 的传输系统 ;//将慢波载到快波上
</p>

<p>
5&gt;数字调制系统基本结构
                        噪音                               幅值      相位
  数字基带信号             ↓          数字基带信号            ↑         ↑
  -------&#x2013;&#x2014;&gt;调制器&#x2014;&gt;信道&#x2013;&gt;解调器-------&#x2013;&#x2014;&gt;     y(t)=acos(2πft+φ)
                 ↑                                                ↑
                载波                                             频率
</p>

<p>
幅值: 最高点到x的距离; 频率:快1; 慢0;    相位:左右平移;
</p>

<p>
6&gt;数字调制的基本方法:
  利用数字基带信号控制载波信号的某个(或某些)参数的变化,
  (利用0或1控制 或选择 载波的不同幅值、频率或相位);
  1)如果调制载波的幅值: 幅移键控(ASK);
  2)如果调制载波的频率: 频移键控(FSK);
  3)如果调制载波的相位: 相移键控(PSK);
</p>

<p>
2.频带传输中三种调制方式;
 1&gt;二进制数字调制 :数字通信系统频带传输的基本方式
  1)数字基带信号:   <span class="underline">|﹋|_|﹋|_|﹋|_|﹋|_|﹋|_|﹋|_|﹋|</span>
</p>

<p>
2)二进制数字调制方式:
  通过数字调制将慢波的信号特征表现在载它的快波上(3种+1个变种);
  二进制幅移键控  二进制频移键控  二进制相移键控   二进制差分相移键控
     (2ASK)        (2FSK)        (2PSK)            (2DPSK)
      福啊           频发          橡皮              2D橡皮
   高(1)矮(0)     疏(0)密(1)    x下(1) x上(0)   重叠(0)    不重叠(1)
     101001       111  0 1       <i>\   /\  /    /\   /\     /\  /\  /
     W<sub>W</sub>_<sub>W</sub>       WWW\</i>\/W     \/  \    \/   \/  \\/  \  \/  \   \/
</p>

<p>
<del>-----------------------</del>-------------<del>--------------</del>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">调制方式</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-left">_</td>
<td class="org-left">﹋</td>
<td class="org-left">_</td>
<td class="org-left">﹋</td>
<td class="org-left">_ 数字信号</td>
</tr>
</tbody>
</table>
<p>
<del>-----------------------</del>-------------<del>--------------</del>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">二进制幅移键控(2ASK)</td>
<td class="org-left">有波形</td>
<td class="org-left">无波形</td>
<td class="org-left">_/\  /\   _</td>
</tr>
</tbody>
</table>
<p>
<del>------------------------</del>-------------<del>--------------</del>    \/  \/
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">二进制频移键控(2FSK)</td>
<td class="org-left">频率不同</td>
<td class="org-left">WW\/\/W</td>
</tr>
</tbody>
</table>
<p>
<del>------------------------</del>-----------------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">二进制相移键控(2PSK)</td>
<td class="org-left">1和0相位不同</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">/\  /\</td>
<td class="org-left">/\  /\</td>
</tr>
</tbody>
</table>
<p>
<del>------------------------</del>-----------------------&#x2013;&#x2014;+|\/  \/  |  \/  \/
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">二进制差分相移键控(2DPSK)</td>
<td class="org-left">看前一个周期波形</td>
<td class="org-left">/\     /\     /\  /\   /</td>
</tr>
</tbody>
</table>
<p>
<del>------------------------</del>-----------------------&#x2013;&#x2014;+ \/   \ \/   \ \/  \    \/
</p>

<p>
3)二进制数字调制性能主要体现
 *1.频带利用率: 2FSK(二进制频移键控)最低;
 *2.误码率: 2ASK(二进制幅移键控)最高; 2PSK(二进制相移键控)最低;
 *3.对信道特性的敏感性: 2ASK(二进制幅移键控)变化敏感;
</p>


<p>
2&gt;多进制数字调制
    <span class="underline">|﹋|_|﹋|_|﹋|_|﹋|_|﹋|_|﹋|_|﹋|</span>
 1)码元: 一个固定时长的信号波形;
      一个脉冲时间(二进制码元):2¹
      两个脉冲时间(四进制码元):2²
      三个脉冲时间(八进制码元):2³
</p>

<p>
2)码元的传输速率:单位时间内数字通信系统所传输的码元个数;
</p>

<p>
3)数据传输速率Rb(bit/s) 与 码元传输速率RB(Baud) 以及 进制数M 间的关系为:
       Rb=RBlog₂M
  示例:若采用4进制数字调制方式使数据传输速率达到4800bit/s,求码元速率;
  4800=RBlog₂4; =&gt; 4800=2RB; 可得 RB=4800/2=2400Baud;
</p>


<p>
3&gt;正交幅值调制 QAM, 也称为幅值相位联合键控(APK)
 1)基本思想:二维调制技术,对载波信号的 幅值和相位 同时进行调制的联合调制技术;
 2)优点: 频带利用率高; 抗噪声能力强; 调制解调系统简单;
</p>
</div>
</div>


<div id="outline-container-orgcee1a03" class="outline-3">
<h3 id="orgcee1a03">物理层接口规程</h3>
<div class="outline-text-3" id="text-orgcee1a03">
<p>
1.物理层主要任务
 1)在传输介质上实现 无结构比特流 的传输;
 2)规定 数据终端设备(DTE) 和 数据通信设备(DCE)之间接口的相关特性;
   DTE:Data Terminal Equipment      数据终端设备
   DCE:Data Communication Equipment 数据通信设备
</p>

<p>
2.物理层接口特性(4个)
 1)机械特性: 指明通信实体间硬件连接口的机械特点:例如:常用的电源插头的尺寸有严格规定;
 2)电气特性: 规定了物理连接上,导线的电气连接及有关电路特性; 例如:接收器和发送器电路特性的说明;
 3)功能特性: 指明物理接口各条 信号线 的用途等; 例如:数据信号线、控制信号线;
 4)规程特性: 通信协议,指明利用接口传输比特流的全过程; 例如:事件执行顺序;
</p>
</div>
</div>
</div>
<div id="outline-container-org98bff00" class="outline-2">
<h2 id="org98bff00">第七章 无线与移动网络</h2>
<div class="outline-text-2" id="text-org98bff00">
</div>
<div id="outline-container-org2cba24e" class="outline-3">
<h3 id="org2cba24e">无线网络</h3>
<div class="outline-text-3" id="text-org2cba24e">
<p>
1.无线网络基本结构
 1)无线主机
 2)无线链路
 3)基站(base station)
   蜂窝网络中的蜂窝塔(cell tower)
   IEEE 802.11无线局域网中的接入点(Access Point,AP)
 4)网络基础设施
</p>

<p>
2.无线网络模式
 1)基础设施模式: 无线主机与基站关联;
 2)自组织网络(AD Hoc网络,特定网络):无线主机不通过基站而直接与其他无线主机通信;
   自组织网络: 由一组用户群构成,不需要基站、没有固定的路由器的移动通信模式;
   自组织网络中的每个结点都 兼有 路由器 和 主机 两种功能;
</p>

<p>
3.无线链路与无线网络特性
 1&gt;无线链路的特点(3条):
  1)信号强度的衰减:路径损耗(大多数无线链路为随参信道);
  2)干扰;
  3)多径传播;(出现信号反射)
</p>

<p>
2&gt;隐藏站现象
 1)站点A、C都向站点B发送数据;
 2)站点A、C之间有物理阻挡,双方都无法检测出对方发送的信号;
 3)站点A、C都向站点B发送数据时,发生碰撞,站点B无法正确接收任何一方的数据;
</p>
</div>
</div>

<div id="outline-container-orgda492a5" class="outline-3">
<h3 id="orgda492a5">移动网络</h3>
<div class="outline-text-3" id="text-orgda492a5">
<p>
1.移动网络基本原理
 1&gt;原理内容(3条)
  1)从网络层的角度分析用户的移动性;
  2)移动结点的地址始终保持不变的重要性;
  3)可用的有线基础设施的支持;
</p>

<p>
2&gt;移动网络的术语
 1)移动结点的永久居所: 归属网络,家网;
 2)在归属网络中代表移动结点执行移动管理功能的实体: 归属管理, 家代理;
 3)移动结点当前所在非归属网络: 外部网络, 被访网络;
 4)在外部网络中帮助移动结点做移动管理功能的实体: 外部代理;
 5)通信者: 与该移动结点通信的实体;
</p>

<p>
2.寻址
 1&gt;移动寻址:
   当某移动结点位于一个外部网络时,所有指向此结点永久地址的流量需要导向外部网络;
</p>

<p>
2&gt;保持地址不变的解决办法
 1)外部网络通过向所有其他网络发通告,告诉它们盖移动结点正在它的网络中(不适用于大规模网络);
 2)将移动性功能从网络核心搬到网络边缘,由该移动结点的归属网络来实现(实际上移动网络采取的做法);
  *1.将外部代理放置在外部网络路由器上,外部代理为        归属网络               被访网络
     移动结点创造一个转交地址(Care-Of Address,COA);   永久地址:        永久地址  ▆ 转交地址:
  *2.移动结点与永久地址和COA都连接;                   127.198.6.7   127.198.6.7╱ 79.168.14.2
  *3.外部代理告诉归属代理该移动结点的COA;              ▆----&#x2013;&#x2014;●            ●
                                                      归属代理   ╲         ╱
3&gt;移动结点的路由选择                                               |-互联网-|
  数据报寻址并转发的方法: 间接路由选择 和直接路由选择                      ╲
 1)移动结点的 间接 路由选择:通信者将数据报寻址到移动结点的 永久地址          ■通信者
   网络层新功能:
   *1.移动结点到外部代理的协议:注册,取消;
   *2.外部代理到归属代理的注册协议:外部代理告诉归属代理COA;
   *3.归属代理数据报封装协议: 归属代理封装原始数据报,转发;
   *4.外部代理拆封协议:从封装好的数据宝报中提取原始数据报转发;
   三角路由问题
   通信者和移动结点之间存在一条更有效的路由,发往移动结点的数据也要先发给归属代理,然后再发送到被访网络;
</p>

<p>
2)移动结点的直接路由选择
  通信者所在网络中的通信者代理先获取移动结点的COA,通信者代理将数据报发往移动结点的COA;
  引入的两个问题
  *1.需要一个移动用户定位协议,以便通信者代理向归属代理查询获得移动结点的COA;
  *2.归属代理仅在会话开始时被通信代理询问一次COA;
</p>
</div>
</div>
