public/计算机网络原理笔记.html
<div id="outline-container-orgacc1e35" class="outline-3">
<h3 id="orgacc1e35">无线局域网 IEEE 802.11</h3>
<div class="outline-text-3" id="text-orgacc1e35">
<p>
1.IEEE 802家族由一系列局域网(LAN)技术规范组成
  IEEE 802.11发表于1997年,是原始标准,频率:2.4GHz,支持速率2Mbit/s;
</p>
<p>
<del>--------------</del>-------------<del>-------------------</del>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">标准</td>
<td class="org-left">频率范围/GHz</td>
<td class="org-left">数据率</td>
</tr>
</tbody>
</table>
<p>
<del>--------------</del>-------------<del>-------------------</del>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">IEEE 802.11b</td>
<td class="org-right">2.4</td>
<td class="org-left">最高为 11 Mbit/s</td>
<td class="org-left">b11</td>
</tr>
</tbody>
</table>
<p>
<del>--------------</del>-------------<del>-------------------</del>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">IEEE 802.11a</td>
<td class="org-right">5</td>
<td class="org-left">最高为 54 Mbit/s</td>
<td class="org-left">a54</td>
</tr>
</tbody>
</table>
<p>
<del>--------------</del>-------------<del>-------------------</del>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">IEEE 802.11g</td>
<td class="org-right">2.4</td>
<td class="org-left">最高为 54 Mbit/s</td>
<td class="org-left">g54</td>
</tr>
</tbody>
</table>
<p>
<del>--------------</del>-------------<del>-------------------</del>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">IEEE 802.11n</td>
<td class="org-left">2.4/5</td>
<td class="org-left">最高为 600Mbit/s</td>
<td class="org-left">n600</td>
</tr>
</tbody>
</table>
<p>
<del>--------------</del>-------------<del>-------------------</del>
</p>

<p>
2.共同点:
 1)都是使用相同的介质访问控制协议CSMA/CA(冲突避免)
 2)链路层帧使用相同的帧格式;
 3)都具有降低传输速率以传输更远距离的能力;
 4)都支持"基础设施模式" 和 "自组织模式" 两种模式;
</p>

<p>
3.IEEE 802.11体系结构的基本构建:
 1)基站:接入点(Access Point,AP)
 2)基本服务集(Basic Service Set,BSS)
   BSS包含: 一个接入点,一个或多个无线站点;
</p>

<p>
4.AP发现(无线主机怎么找到AP)
 1)被动扫描:无线主机扫描信道 和 监听信标帧;
 2)主动扫描:无线主机向其范围内的所有AP广播 探测帧;
</p>

<p>
5.IEEE 802.11的MAC协议
 1&gt;IEEE 802.11的MAC协议采用CSMA/CA协议
   Carrier Sense Multiple Access with Collision Avoidance
   带碰撞避免的载波监听多路访问协议;
</p>

<p>
2&gt;CSMA/CA协议工作原理(简答题)
  通过 请求发送(RTS)帧 和 允许发送(CTS)帧 的交换,
  实现信道预约占用,避免数据帧传送过程中的冲突;
</p>

<p>
3&gt;CSMA/CA协议工作步骤
 1)源站发送数据之前,先监听,若空闲,等待一个分布式帧间间隔(Distributed Inter-Frame
   Space, DIFS)的短时间后,发送一个很短的请求发送(Request To Send,RTS) 控制针;
   RTS控制帧: 源地址 目的地址, 本次通信所需的 持续时间;
</p>

<p>
2)若目的站正确收到源站发来的RTS帧,且无力介质空闲,等待一个短帧间间隔(Short Inter-Frame
  Spacing,SIFS)时间后,发送一个很短的允许发送(Clear To Send, TCS)控制帧作为响应;
  CTS控制帧: 本次通信持续时间等;
</p>

<p>
3)源站和目的站周围的其他站点可以监听到两者要通信,其他站点在其持续通信时间内不会发送,
  这个时间被称为网络分配向量(Network Allocation Vector, NAV);
  NAV是其他站根据监听到的RTS或CTS帧中的持续时间来确定数据帧传输的时间;
</p>

<p>
4)源站收到CTS帧后,在等待一段时间SIFS时间后,即可发送数据帧,
  若目的站正确接收到数据帧,在等待时间SIFS后,就向源站发送确认帧(ACK);
</p>

<p>
6.IEEE 802.11 帧类型(3种:控制帧; 数据帧; 管理帧)
</p>

<p>
7.IEEE 802.11 数据帧结构
 1&gt;MAC首部:共30字节
  1)帧控制:包含多个子字段:如 类型和子类型字段:用于区分RTS帧、CTS帧、ACK帧 和 数据帧;
  2)持续期:IEEE 802.11的MAC协议允许传输结点 预约信道一段时间,包括传输其
          数据帧的时间 和 传输确认帧的时间,该持续值在该帧的 持续期字段中;
  3)有4个地址字段:最特殊;
  4)序号控制: 在IEEE 802.11网络中,站点正确收到其他站点的帧后,都会发一个确认帧,确认帧可能丢失,
             发送站点会发送一个帧等多个副本,使用序号可以区分新传输的帧和以前帧的重传;
</p>

<p>
2&gt;帧主体:帧的数据部分,不超过2312字节;通常IEEE 802.11帧长都小于1500字节;
3&gt;尾部: 帧检验序列FCS,共4字节;
                            MAC首部(30字节)
      ╭-------------------&#x2013;&#x2014;^---------------------&#x2013;&#x2014;╮         MAC尾部
 字节 2       2       6      6      6        2          6    0-2312    4
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">帧控制</td>
<td class="org-left">持续期</td>
<td class="org-left">地址1</td>
<td class="org-left">地址2</td>
<td class="org-left">地址3</td>
<td class="org-left">序号控制</td>
<td class="org-left">地址4</td>
<td class="org-left">帧主体</td>
<td class="org-left">FCS</td>
</tr>
</tbody>
</table>
<p>
 ╭-&#x2014;^-----------------------------------------&#x2013;&#x2014;╮
位| 2 | 2 |   4   | 1 |  1 | 1 |  1  | 1 | 1 | 1 | 1 |
  协议 类型 子类型  去往 来自 更多 重试 功率 更多    顺序
  版本  ↘  ↙      AP  AP  分片      管理 数据
          ↓用于
  区分RTS帧、CTS帧、ACK帧 和 数据帧;
</p>

<p>
<del>--------</del>-------<del>--------</del>--------<del>-------</del>-&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">去往AP</td>
<td class="org-left">来自AP</td>
<td class="org-left">地址1</td>
<td class="org-left">地址2</td>
<td class="org-left">地址3</td>
<td class="org-left">地址4</td>
</tr>
</tbody>
</table>
<p>
<del>--------</del>-------<del>--------</del>--------<del>-------</del>-&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-right">

<col  class="org-right">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-left">目的地址</td>
<td class="org-left">AP地址</td>
<td class="org-left">源地址</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<p>
<del>--------</del>-------<del>--------</del>--------<del>-------</del>-&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-right">

<col  class="org-right">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-left">AP地址</td>
<td class="org-left">源地址</td>
<td class="org-left">目的地址</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<p>
<del>--------</del>-------<del>--------</del>--------<del>-------</del>-&#x2013;&#x2014;+
</p>
</div>
</div>

<div id="outline-container-org97966a2" class="outline-3">
<h3 id="org97966a2">蜂窝网络</h3>
<div class="outline-text-3" id="text-org97966a2">
<p>
0.小区(cell): 蜂窝网覆盖的区域分成的六边形的区域;
1.蜂窝网络体系结构:
 0&gt;蜂窝:小区的地理覆盖区域;
 1&gt;基站系统(BSS,Base Station System)
  1)收发基站(BTS,Base Transceiver Station):负责小区内的移动站点 发送或接收信号;
  2)基站控制器(BSC):服务于收发基站,为用户分配BTS无线信道、执行寻呼,执行移动用户的切换;
  3)移动交换中心(MSC):管理5个基站控制器,在用户鉴别和账号管理以及呼叫建立和切换中起着决定作用;
</p>

<p>
2.间接路由选择方法管理移动性
 1)归属网络维护一个归属位置注册器(Home Location Register, HLR)的数据库:
   每个用户的永久蜂窝电话号码，用户个人信息，用户当前的位置信息;
 2)被访网络维护一个访问位置注册器(Visitor Location Register,VLR)的数据库:
   为每一位当前在其服务网络的移动用户提供一个表项;
</p>

<p>
3.通信过程
 1)通信者拨打移动用户的电话号码;
 2)归属移动交换中心收到该呼叫,查询归属位置注册器来确定 移动用户的位置及其漫游号码;
 3)漫游号码确定后,归属移动交换中心通过网络呼叫被访网络的移动交换中心,
   被访网络的移动交换中心呼叫移动用户;
</p>

<p>
4.移动通信2G/3G/4G/5G网络
 1&gt;第一代蜂窝移动通信(1G) 淘汰
</p>

<p>
2&gt;第二代蜂窝移动通信(2G)
 1)全球移动通信系统(GSM,Global System for Mobile Communication)
  *1.GSM系统是第二代移动电话系统的开端。
  *2.GSM业务可以分为承载业务、电信业务、附加业务三大类。
  *3.GSM系统采用的是FDMA(频分)和TDMA(时分)混合接入的方式。
 2)短信服务
 3)通用分组无线业务(GPRS,General Packet Radio Service)
 4)增强数据速率的 GSM 演迚技术 (EDGE,Enhanced Data Rate for GSM Evolution)
</p>

<p>
3&gt;第三代移动通信系统(3G)
 1)国际电信联盟(ITU)提出并研究 WCDMA(欧洲)、CDMA2000(美国)、TD-SCDMA(中国)三大技术标准;
 2)3G是采用CDMA(码分多路复用)技术的通信系统;
 3)关键技术:无线传输技术;
</p>

<p>
4&gt;4G/LTE
 1)3GPP组织在2004年开始长期演迚(LTE)标准化项目,在2008年9月开使LTE-Advanced项目。
 2)4G特点:高速率传输、智能化、业务多样化、无缝接入、后向兼容、经济;
 3)LTE系统:
  *1.核心网(EPC):
    #1.移动管理实体(MME):负责移动性控制;
    #2.服务网关(S-GW):负责数据分组的路由与转发;
  *2.接入网(E-UTRAN):基站(E-NodeB);
</p>

<p>
  *3.接入网中e-Node B 与 e-NodeB之间 X2的接口;
     LTE核心网与接入网之间是 S1的接口;
5&gt;5G
 1)5G技术目的: 构建网络社会
 2)5G特点: 超高速率传输, 超高容量、超可靠性、随时随地可接入性;
</p>
</div>
</div>

<div id="outline-container-org1cb32f1" class="outline-3">
<h3 id="org1cb32f1">移动IP网络</h3>
<div class="outline-text-3" id="text-org1cb32f1">
<p>
1.移动IP(Mobile IP)
  因特网工程任务组(IETF,the Internet Engineering Task Force)
  允许计算机移动到外地时,任然保持其原来的IP地址;
             ╭代理发现(代理通告, 代理请求);
   移动IP标准&lt; 向归属代理注册;
             ╰数据报的间接路由选择;
</p>

<p>
移动代理通告扩展包含了该移动结点所需的附加信息:
包括归属代理位(H), 注册要求为(R), 转交地址(COA)字段;
</p>

<p>
2.代理发现
  当移动IP站点到达一个新网络时,移动结点都必须知道相应的外部代理或归属代理身份;
  代理发现的实现方式:
  1)代理通告: 代理周期性的广播一个类型字段为9(路由器发现)的ICMP报文;
  2)代理请求: 移动结点广播ICMP报文;
</p>

<p>
3.向归属代理注册
  移动IP定义了外部代理向一个移动结点的归属代理注册或注销COA所使用的的协议;
  一旦某个移动IP结点收到一个COA,则该地址必须要向归属代理注册,这可通过
  外部代理来完成,共涉及4个步骤:
  1)当收到一个外部代理通告后,移动结点立即向外部代理发送一个移动IP注册报文;
  2)外部代理收到注册报文并记录移动结点的永久IP地址,分配一个COA;
  3)外部代理把注册请求发送给归属代理,归属代理接收注册请求并检查 真实性 和 正确性;
  4)外部代理接收注册应答,然后将其转发给移动结点;
</p>
</div>
</div>

<div id="outline-container-org52d29e7" class="outline-3">
<h3 id="org52d29e7">其他典型无线网络简介(WiMax 蓝牙 ZigBee)</h3>
<div class="outline-text-3" id="text-org52d29e7">
<p>
1.全球微波互联接入(WiMax,World Interoperability for Microwave Access)
  又名IEEE 802.16标准,宽带无线标准;
</p>

<p>
1&gt;WiMax优势:
 1)更远的传输距离(可达50Km),
 2)更高速的带宽接入(最高300Mbit/s);
</p>

<p>
2&gt;WiMax劣势:
 1)不支持用户在移动过程中无缝切换;
 2)产业基础薄弱;
 3)和传统的蜂窝网络无法完全兼容;
</p>

<p>
2.蓝牙(BlueTooth)
 1)IEEE 802.15.1标准, 无线个人区局域网(WPAN)标准;
 2)工作在全球通用的2.4GHz的频段;
 3)特点: 小范围, 低功率, 低速率, 低成本运行;(一小三低)
</p>

<p>
3.ZigBee
 1)IEEE 802.15.4标准, 第二个个人区域网络标准;
 2)特点: 低功率, 低数据速率, 低工作周期;(三低);
</p>
</div>
</div>
</div>
