public/计算机网络原理笔记.html
<div id="outline-container-orgee40c3e" class="outline-2">
<h2 id="orgee40c3e">第八章 网络安全</h2>
<div class="outline-text-2" id="text-orgee40c3e">
</div>
<div id="outline-container-org0b8a34a" class="outline-3">
<h3 id="org0b8a34a">网络安全概述</h3>
<div class="outline-text-3" id="text-org0b8a34a">
<p>
0&gt;网络安全概念
  网络安全是指网络系统的硬件、软件及其系统中的数据受到保护,不因偶然的 或
  恶意的原因而遭受到破坏、更改、泄漏, 系统连续可靠正常地运行,网络服务不中断;
</p>

<p>
*相对性是指网络永远只有相对的安全,没有绝对的安全;
</p>

<p>
1&gt;典型的网络安全威胁
 1)报文传输: 传输过程面临窃听、插入、假冒、劫持等安全威胁;
 2)拒绝服务DoS、分布式拒绝服务DDoS(利用多个源主机协同淹没接收方);
 3)映射: 先探路, 再攻击;
 4)分组 "嗅探";(Wireshark 是一个典型的分组嗅探软件);
 5)IP欺骗;
</p>

<p>
2&gt;网络安全通信需要的基本属性
 1)机密性: 只有发送方 和 接收方能理解报文内容;
 2)消息完整性: 消息未被篡改, 发生篡改一定会被检测到;
 3)可访问与可用性: 对授权用户提供有效服务;
 4)身份认证: 双方确认彼此的真实身份;
</p>
</div>
</div>

<div id="outline-container-orgac21b06" class="outline-3">
<h3 id="orgac21b06">数据加密</h3>
<div class="outline-text-3" id="text-orgac21b06">
<p>
1.通信加密模型
 0&gt;密码学包括: 密码编码学 和 密码分析学 两部分;
   密码技术是 保障信息安全的核心基础;
   密码分析学: 研究密码变化客观规律中的固有缺陷,并应用于破译密码以获取通信情报;
   密码编码学: 是指将密码变化的客观规律应用于编制密码来保守通信秘密;
</p>

<p>
1&gt;通信加密流程:
</p>

<p>
           密钥Ke          ━━━━━━━━━━━        密钥Kd
明文M-&gt;加密C=E(M Ke)-&gt;密文C    信道    &gt;密文-&gt;解密M=D(C Kd)-&gt;明文
                           ▔▔▔▔▔▔
</p>
<p>
<del>-------</del>-------<del>--------</del>--------<del>--------</del>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">M</td>
<td class="org-left">C</td>
<td class="org-left">K</td>
<td class="org-left">E</td>
<td class="org-left">D</td>
</tr>
</tbody>
</table>
<p>
<del>-------</del>-------<del>--------</del>--------<del>--------</del>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">明文空间</td>
<td class="org-left">密文空间</td>
<td class="org-left">密钥空间</td>
<td class="org-left">加密算法</td>
<td class="org-left">解密算法</td>
</tr>
</tbody>
</table>
<p>
<del>-------</del>-------<del>--------</del>--------<del>--------</del>
</p>

<p>
2&gt;密码分类
  分类标准:密码体制的特点、出现的先后时间;
  1)传统加密方式: 替代密码; 换位密码;
  2)对称密钥加密;
  3)非对称/公开密钥加密;
</p>

<p>
2.传统密码算法
 1&gt;替代密码
   包括:移位加密,乘数加密,仿射密码等;
   凯撒密码是替代密码的典型应用;
   例:对明文"bob, I love you Alice", 利用k=3的凯撒密码加密,得到密文;
      a b c d e f g h i g k l m n
      o p q r s t u v w x y z
      k=3的含义就是明文的每个字母表顺序推后3位;
      bob, I love you Alice
        加密后(字母后移3位)
      ere, L oryh brx Dolfh
</p>

<p>
2&gt;换位密码(置换密码):列置换密码
  包括列置换密码, 周期置换密码;
 1)加密原则:
   根据一定规则重新排列明文,以便打破明文的结构特性, 只改变明文结构,不改变内容;
</p>

<p>
2)列置换密码加密过程:
 *1.首先将明文P按密钥K的长度n进行分组,并每组一行安行排列, 即每行有n个字符;
 *2.若明文长度不是n的整数倍,则不足部分用双方约定的方式填充,如双方约定用字母"x"替代空缺处;
 *3.设最后得到的字符矩阵为Mmn,m为明文划分的行数,然后,按照密钥规定的次序将Mmn对应的列输出,即可得到密文序列C;
</p>

<p>
示例:假设采用密钥K=nice的列置换密码,对明文"bob i love you"进行加密;求得到的密文;
 1)密钥k=nice  密钥长度:n=4;  密钥字母顺序:n(4)i(3)c(1)e(2);
 2)将明文按密钥长度分组,每组一行,按行排列;
    4 3 1 2
    b o b i 密文按数字顺序,按列输出字母
    l o v e ========================&gt; bvu iex ooo bly
    y o u x(双方约定x为填充字母)
</p>

<p>
示例2 key=code,密钥长度n=4,故加密过程分 4列,每列24/6=6个字母,即把密文分为4段
      每段6个字母; 密文:cunorimetknlprwpceoterip;求明文;
                    c(1)o(4)d(2)e(3)    按行输出得到明文为:
      cunori 第一列   c   o   m   p    computer network principle;
      metknl 第二列   u   t   e   r
      prwpce 第三列   n   e   t   w
      oterip 第四列   o   r   k   p
                      r   i   n  c
                      i   p   l  e
</p>

<p>
3.对称密钥加密
                                              ╭DES
                                     ╭分组密码&lt; AES
</p>
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">╰IDEA</td>
</tr>
</tbody>
</table>
<p>
                 ╭相同(对称密钥加密)&lt;
加密密钥和解密密钥&lt;                  ╰序列密码(流密码),利用密钥产生密钥流对明文串分别加密的过程;
                 ╰不同(非对称密钥加密);
</p>

<p>
1&gt;DES加密算法(Data Encryption Standard)
 1)加密: 明文分为64位分组序列,使用56位的密钥,进行16轮加密;
 2)三重DES: 使用两个密钥,执行三次DES算法,密钥长度达到 112位;
 3)DES过时原因:密钥长度太短,利用高性能计算机可在短时间内蛮力攻击破解;
</p>

<p>
2&gt;AES加密算法(Advanced Encryption Standard)
 1)密钥长度:128/192/256位
 2)AES加密算法的特点
  *1.分组长度和密钥长度均可变;
  *2.循环次数允许在一定范围内根据安全要求进行修正;
  *3.安全、效率、易用、灵活;
  *4.抗线性攻击 和 抗差分攻击 的能力大大增强;
  *5.如果1秒暴力破解DES,则需要149万亿年破解AES;
</p>

<p>
3)AES加密过程涉及4种操作: 字节替代、行位移、列混淆、轮密钥加;
</p>

<p>
3&gt;IDEA加密算法(International Data Encryption Algorithm)
  密钥长度:128位;
</p>

<p>
4&gt;对称密钥加密算法面临的一个最大的问题是 密钥分发 问题;
</p>

<p>
4.非对称/公开密钥加密
 1&gt;非对称密钥加密(公开密钥加密)
  1)通信双方都有两个密钥: 公钥:任何人都可以得到; 私钥:只有自己知道;
  2)典型的公开密钥加密算法: Diffie-Hellman算法 和 RSA算法;
  3)Diffie=Hellman算法: 基于数学中素数理论;
    RSA算法: 基于数论设计,安全性建立在大数分解的难度上, 应用比较广泛,安全性高;
  4)利用公开密钥加密在报文传输中,分别用接收方的公钥和接收方的私钥来加密和解密报文;
</p>

<p>
2&gt;非对称密钥加密过程
 Alice给Bob写信:
 1)Alice用Bob的公钥加密明文,发送;
 2)Bob收到密文后,用自己的私钥解密得到明文;
 3)加密用私钥,解密用公钥也是可以的;
   公钥KB+  私钥KB-   KB-(KB+(m))=m=KB+(KB-(m));
</p>
</div>
</div>

<div id="outline-container-org1fa5ff1" class="outline-3">
<h3 id="org1fa5ff1">消息完整性与数字签名</h3>
<div class="outline-text-3" id="text-org1fa5ff1">
<p>
0.报文/消息完整性(message integrity),也称报文/消息认证
 1)证明报文确实来自声称的发送方;
 2)验证报文在传输过程中没有被篡改;
 3)预防报文的时间、顺序被篡改;
 4)预防报文持有期被篡改;
 5)预防抵赖;
</p>

<p>
1.消息完整性检测方法:用散列函数, 对报文m进行散列化;
 1&gt;典型的散列函数
  1)MD5(Message-Digest Algorithm 5):128位散列值;
  2)SHA-1:160位散列值;
</p>

<p>
2&gt;散列函数的特性
 1)一般的散列函数算法公开;
 2)能够快速计算;
 3)对任意长度报文进行散列产生定长输出; MD5:128位 SHA-1:160位;
 4)对任意报文无法预知其散列值;
 5)不同报文不产生相同的散列值;
 6)单向性,抗弱碰撞性,抗强碰撞性;
</p>

<p>
2.报文认证
 1&gt;消息完整性检测一个重要目的:完成 报文认证 的任务;
   报文认证: 消息的接受者能够检验收到的消息是否是真实的方法;
   报文认证要完成 消息源的认证 和 消息的认证;
</p>

<p>
2&gt;消息完整性检测重要目的:报文认证;
  对报文m应用散列函数H,得到固定长度的散列码,称为报文摘要,记为H(m);
  报文摘要可以作为报文m的数字指纹(fingerprint);
           报文m-&#x2014;&gt;H:散列函数&#x2014;&gt;H(m)
                    密码散列函数
</p>

<p>
3&gt;简单报文验证
  1)发送方对报文m应用散列函数H,得到固定长度的散列码,获得
    报文摘要h,将扩展报文(m,h)发送给接收方;|报文m|报文摘要h|
</p>

<p>
2)接收方收到扩展报文后,提取报文m 和 报文摘要h, 同样对报文m
  应用散列函数H,获得新的报文摘要H(m), 将H(m) 和 H进行比较;
</p>

<p>
3)若相同,报文认证成功,否则报文认证失败;
</p>

<p>
*简单报文认证不足: 无法达到对消息源认证;
</p>

<p>
4&gt;报文认证码MAC(Message Authentication Code)
  1)发送方和接收方共享一个认证密钥s,发送方对 报文m 和 认证密钥s
    应用散列函数H得到报文认证码h,将 扩展报文(m,h) 发送给接收方;
</p>

<p>
2)接收方收到扩展报文后,提取出报文m和报文认证码h, 对报文m 和 认证密钥s
  应用散列函数H获得新的报文认证码H(m+s),将H(m+s)与h进行比较;
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">密钥s</td>
<td class="org-left">报文m</td>
<td class="org-left">报文认证码h</td>
</tr>
</tbody>
</table>
<p>
3)若相同,报文认证成功,否则报文认证失败;             散列化↓
                                                新报文认证码H(m+s)
*报文认证码MAC不足:无法保证消息在接收方没有被篡改;
</p>

<p>
3.数字签名
 1&gt;数字签名原理:
  在非对称密码体制中,一个主体使用自己的私钥加密消息,得到密文,密文可使用
  该主体公钥解密来恢复成原来的消息,如此生成的"密文"对该消息提供认证服务;
</p>

<p>
应用广泛的数字签名方法主要有三种: RSA签名、DSS签名、 Hash签名等;
</p>

<p>
2&gt;数字签名应满足
 1)接收方能确认发送方的签名,但不能伪造;
 2)发送方发出签名的消息给接收方后,就不能再否认他所签发的消息;
 3)接收方对已收到的签名消息不能否认,即有收报认证;
 4)第三者可以确认收发双方之间的消息传送, 但不能伪造这一过程;
</p>

<p>
3&gt;简单的数字签名                                  私钥加密
 1)Bob利用自己的私钥对报文m加密,创建签名报文,  报文m----&#x2013;&#x2014;&gt;签名报文
   将扩展报文(报文、签名报文)发送给Alice;       |报文m|签名报文|
</p>

<p>
2)Alice收到扩展报文,利用Bob的公钥解密签名报文,  报文m    签名报文
  并检验解密后的签名报文和报文m是否一致;     是否一致 \     ↓公钥解密
                                                 解密后的报文
3)若一致,则签名报文m的一定是Bob的私钥;
</p>

<p>
4&gt;签名报文摘要
 1)Bob对报文m应用散列函数H生成报文摘要H(m),然后Bob通过其私钥 对 报文摘要
   进行加密生成加密的报文摘要,将扩展报文(报文,加密的报文摘要)发送给Alice;
</p>

<p>
2)Alice收到报文m及加密的报文摘要, Alice利用Bob的公钥解密加密的报文摘要,
  并对m应用散列函数生成新的报文摘要; 报文m            加密的报文摘要
                                   ↓ 散列化  比较       ↓公钥解密
                               新的报文摘要&lt;---&#x2013;&#x2014;&gt;报文摘要
3)若一致,则签名报文m的一定是Bob的私钥;
</p>
</div>
</div>

<div id="outline-container-org1cd4886" class="outline-3">
<h3 id="org1cd4886">身份认证</h3>
<div class="outline-text-3" id="text-org1cd4886">
<p>
0.作用:身份认证(身份鉴别)是一个实体经过计算机网络向另一个实体证明其身份的过程;
</p>

<p>
1.基于共享对称密钥的身份认证(使用一次随机数R进行身份认证)   Alice            Bob
 1)Alice向Bob发送报文"I'm Alice"                         |-&#x2014;I'm Alice-&gt;|
 2)Bob选择一个 一次性随机数R,然后把这个值发送给Alice;       |&lt;-&#x2013;&#x2014;R--&#x2013;&#x2014;|
 3)Alice使用她与Bob共享的 对称秘密密钥 加密这个一次性随机数  |-&#x2013;&#x2014;KA-B(R)-&gt;|
   (避免重放攻击),然后把加密的一次性随机数发回给Bob;         ↓              ↓
 4)Bob解密收到的报文;                                    时间           时间
</p>

<p>
2.基于公开密钥的身份认证
 1)Alice向Bob发送报文"I'm Alice";                           Alice            Bob
 2)Bob选择一个一次性随机数R,然后把这个值发送给Alice;            |-&#x2014;I'm Alice-&gt;|
 3)Alice使用她的私钥来加密R, 然后把加密的一次性随机数发回给Bob;  |&lt;-&#x2013;&#x2014;R--&#x2013;&#x2014;|
 4)Bob向Alice索要她的公钥;                                    |-&#x2013;&#x2014;KA-(R)&#x2013;&gt;|
 5)Alice向Bob发送自己的公钥;                                  |&lt;&#x2013;给我你的公钥-|
 6)Bob利用Alice的公钥解密收到的报文;                           ↓-&#x2013;&#x2014;KA+&#x2013;&#x2014;&gt;↓
                                                            时间            时间
</p>
</div>
</div>
