public/计算机网络原理笔记.html
<div id="outline-container-org3fc51b0" class="outline-3">
<h3 id="org3fc51b0">密钥分发中心与证书认证</h3>
<div class="outline-text-3" id="text-org3fc51b0">
<p>
1.密钥分发中心
  对称密钥分发的典型解决方案:通过各方建立一个大家都信赖的密钥分发中心
  (Key Distribution Center, KDC),解决 对称密钥 安全可靠的分发;
</p>

<p>
1&gt;通信发起方会生成会话密钥
 1)Alice 和 Bob进行保密通信, Alice随机选择一个会话密钥, Alice           KDC             Bob
   用Alice和KDC之间长期的共享密钥加密会话密钥,发送给KDC;  |-KA-KDC(Ks,B)-&gt;|               |
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">-KB-KDC(Ks,A)-&gt;</td>
</tr>
</tbody>
</table>
<p>
2)KDC得到后,解密获得会话密钥,以及所希望通信方Bob,       时间            时间            时间
  KDC利用其和Bob的长期共享密钥加密会话密钥,发送给Bob;           通发起方生成会话密钥
</p>

<p>
3)Bob解密,获得会话密钥,并得知期望和自己通信的是Alice;
</p>

<p>
2&gt;KDC为Alice、Bob生成通信的会话密钥
 1)Alice在希望和Bob通信时,首先向KDC发送请求消息,        Alice            KDC            Bob
 2)KDC收到消息后,随机选择一个会话密钥,并将会话密钥分别用   |-请求与Bob通信-&gt;|               |
   和Alice、Bob的长期共享密钥加密,再分别发送给ALice、Bob; |&lt;-KA-KDC(Ks,B)-|-KB-KDC(Ks,A)-&gt;|
 3)Alice、Bob收到KDC的密文后,分别解密,获得会话密钥;     时间            时间             时间
                                                              由KDC生成通信的会话密钥
</p>

<p>
2.证书认证机构
 1&gt;证书认证机构用途
   要使公钥密码有效,需要证实你拥有的公钥,实际上就是要与你通信的实体公钥;
   将公钥与特定的实体绑定,通常由认证中心(Certification Authority,CA)完成;
</p>

<p>
2&gt;认证中心(CA)的作用:
 1)CA可以证实一个实体的真实身份;
 2)一旦CA验证了某个实体的身份,CA会生成一个把其身份和实体的公钥绑定起来的证书,
   其中包含该实体的公钥及其全局唯一的身份识别信息等,并由CA对证书进行数字签名;
   Bob获取个人数字证书(如图)↓
</p>

<p>
Bob的公钥K+B-&#x2014;&gt;数字签名&#x2014;&gt;由CA签发的Bob的公钥证书
       ↖         (加密)
           ↖       ↑         _
               ↖   |CA的私钥KCA
Bob的识别信息-&#x2014;&gt;认证中心(CA)
</p>
</div>
</div>

<div id="outline-container-orgc5f4478" class="outline-3">
<h3 id="orgc5f4478">防火墙与入侵检测系统</h3>
<div class="outline-text-3" id="text-orgc5f4478">
<p>
1.防火墙基本概念
  防火墙是能够隔离组织内部网络与公共互联网,允许某些分组通过,
  而阻止其他分组进行或离开内部网络的软件、硬件或软件硬件结合的一种设施;
</p>

<p>
2.防火墙的分类
 1)无状态分组过滤器
   典型部署在内部网络和网络边缘路由器上的防火墙,路由器逐个检查数据报,
   根据访问控制表(Access Control List,ACL)实现防火墙规则;
</p>

<p>
2)有状态分组过滤器
  跟踪每个TCP连接建立、拆除、根据状态确定是否允许分组通过;
</p>

<p>
3)应用网关
  应用网关实现 授权 用户通过网关访问外部网络的服务;
</p>

<p>
3.入侵检测系统(IDS,Intrusion Detection System)
  是当观察到潜在的恶意流量时,能够产生警告的设备或系统;
</p>
</div>
</div>
<div id="outline-container-orgab24739" class="outline-3">
<h3 id="orgab24739">网络安全协议</h3>
<div class="outline-text-3" id="text-orgab24739">
<p>
自顶向下介绍各层解决安全性的实例协议
1.安全电子邮箱(应用层)
 1&gt;电子邮件对网络安全的需求
  1)机密性
  2)完整性
  3)身份认证性
  4)抗抵赖性
</p>

<p>
2&gt;安全电子邮件标准:PGP标准(Pretty Good Privacy)
</p>

<p>
3&gt;PGP提供的服务
 1)邮件加密; 报文完整性; 数字签名;
 2)加密算法: 公钥加密算法(如RSA)、对称加密算法(如3DES)、散列算法(如SHA-1);
</p>

<p>
2.安全套接字层SSL(传输层)
 1&gt;SSL使用原因
  1)一般Web服务器越强大,包含安全漏洞的概率越高;
  2)Web浏览器也会遇到各种各样的安全威胁;
  3)普通Web应用的应用层数据,在传输过程中都以明文形式传输,可能受到攻击;
</p>

<p>
2&gt;在电子背景下,提出HTTP安全电子商务交易协议;
  在传输层之上构建一个安全层:
  安全套接字层(Secure Socket Layer,SSL)
  传输层安全(Transport Layer Security,TLS)
</p>

<p>
3&gt;SSL可以提供的服务
  机密性,完整性、身份认证等安全服务;
</p>

<p>
用到的加密算法: 公开密钥加密算法, 对称密钥加密算法, MAC算法;
</p>

<p>
4&gt;SSL协议栈(协议的总和)
  SSL是介于TCP传输层和HTTP等应用层协议之间的一个可选层,
  大多数应用层协议直接建立在SSL协议之上,SSL是两层协议;
</p>
<p>
<del>-------------</del>----------------<del>------------</del>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">SSL握手协议</td>
<td class="org-left">SSL更改密码协议</td>
<td class="org-left">SSL警告协议</td>
</tr>
</tbody>
</table>
<p>
<del>-------------</del>----------------<del>------------</del>
</p>
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">SSL记录协议</td>
</tr>
</tbody>
</table>
<p>
<del>-------------------------------------------</del>
</p>
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">TCP</td>
</tr>
</tbody>
</table>
<p>
<del>-------------------------------------------</del>
</p>
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">IP</td>
</tr>
</tbody>
</table>
<p>
<del>-------------------------------------------</del>
</p>

<p>
1)SSL握手协议:
  在握手过程中需要用到SSL握手协议、SSL更改密码协议,SSL警告协议;
  作用:协商密码组 和 建立密码组; 服务器认证与鉴别 和 客户认证与鉴别;
</p>

<p>
2)SSL更改密码协议: 通信双方修改密码组,标志着加密策略的改变;
</p>
<p>
<del>-------------------</del>-----------------------------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">公开密钥加密算法</td>
<td class="org-left">SSL主要是用RSA,其他多种公钥加密算法也支持</td>
</tr>
</tbody>
</table>
<p>
<del>-------------------</del>-----------------------------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">对称密钥加密算法</td>
<td class="org-left">SSL支持DES分组加密、3DES分组密码等</td>
</tr>
</tbody>
</table>
<p>
<del>-------------------</del>-----------------------------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">MAC算法</td>
<td class="org-left">MD5 或 SHA-1</td>
</tr>
</tbody>
</table>
<p>
<del>-------------------</del>-----------------------------------&#x2013;&#x2014;+
</p>

<p>
3)SSL警告协议:
  在发生出错或异常时,为对等实体传递SSL警告或终止当前连接;
  包含两个字段: 警告级别 和 警告代码;
</p>

<p>
4)SSL记录协议:
  描述信息交换过程中的消息格式,前3个协议需要记录协议进行封装与传输;
</p>


<p>
3.虚拟专用网VPN 和 IP安全协议IPSec(网络层)
 1&gt;虚拟专用网VPN
   建立在公共网络上的安全通道,是用户通过公用网络建立的临时的、安全的连接
   实现远程用户、分支机构、业务伙伴等与机构总部网络的安全连接,从而构建针对
   特定组织机构的专用网络,虚拟专用网络最重点的特点就是 虚拟;
   虚拟专用网一般指 构建在Internet上能够 自我管理 的专用网络;
   关键技术: 隧道技术(IPSec), 数据加密; 身份认证; 密钥管理; 访问控制; 网络管理;
</p>

<p>
2&gt;隧道:通过Internet提供的点对点的数据传输的安全通道;
       通过数据加密保证安全,数据进入隧道时,由VPN封装成IP数据报,
       通过隧道在Internet上传输;离开隧道后,进行解装,数据便不受VPN保护;
</p>

<p>
3&gt;IPSec体系
  IPSec是网络层使用的最广泛的安全协议,待IPSec不是一个单一的协议,
 1)主要包括的协议: 封装安全荷载协议(ESP), 认证头(AH)协议;
 2)IPSec传输模式: 传输模式 和 隧道模式
  *1.传输模式: 主机模式, IPSec数据报的发送和接收都是由 端系统完成;
  *2.隧道模式: 将IPSec的功能部署在网络边缘的路由器上,路由器之间建立安全隧道,数据报在其中封装装传输;
</p>

<p>
4&gt;传输模式和协议组合
 1)传输模式AH;
 2)隧道模式AH;
 3)传输模式ESP;
 4)隧道模式ESP:最广泛 和 最重要的IPSec形式; //隧道式安全荷载协议
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-07-16 Thu 00:00</p>
<p class="author">Author: Evan Meek</p>
<p class="date">Created: 2021-02-21 Sun 15:27</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
